Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# DynamicColors.CustomColors.title
source: Custom colors
nl: Aangepaste kleuren
pt_br: Cores customizadas

# DynamicColors.CustomColors.text1
source: When using custom colors, you will need to manually select the correct color for the current appearance.
nl: Bij gebruik van aangepaste kleuren moet je handmatig de juiste kleur selecteren voor het huidige uiterlijk.
pt_br: Quando usando cores customizadas, você vai precisar selecionar manualmente a cor ideal para o seu esquema de cores.

# DynamicColors.CustomColors.comment1
source: Apple's documentation suggests usign Color Assets for this, which we'll cover in the following page.
nl: Apple's documentatie suggereert het gebruik van Color Assets hiervoor, die we in de volgende pagina zullen behandelen.
pt_br: A documentação da Apple sugere usar os assets de cor no XCAssets para isso, que iremos cobrir na página a seguir.

# DynamicColors.CustomColors.text2
source: But most of the time we have a separate library for our colors or a JSON file with the hex codes, and we manually create our color objects.
nl: Maar meestal hebben we een aparte bibliotheek voor onze kleuren of een JSON-bestand met de hex-codes, en maken we handmatig onze kleurobjecten aan.
pt_br: Mas muitas vezes, temos as cores em uma biblioteca separada, ou um arquivo JSON com os códigos hexadecimais de cada cor da noss interface, e criamos os objetos de cor manualmente.

# DynamicColors.CustomColors.text3
source: We can use a specific init in the 'UIColor' object, which gives the current UITraitCollection object, to wrap our color file and help us define the correct color for the context.
nl: We kunnen een specifieke initialisatie in het 'UIColor'-object gebruiken, dat het huidige 'UITraitCollection'-object geeft, om ons kleurenbestand in te pakken en ons te helpen de juiste kleur voor de context te definiëren.
pt_br: Então, precisamos de uma forma de mudar nossas cores quando necessário.

# DynamicColors.CustomColors.text4
source: And in SwiftUI we can use the color scheme Environment property to help us define the correct color.
nl: En in SwiftUI kunnen we de kleurenschema Environment property gebruiken om ons te helpen de juiste kleur te definiëren.
pt_br: E em SwiftUI podemos usar a variável de ambiente do esquema de cores para nos ajudar a decidir qual a core correta a usar.

# DynamicColors.CustomColors.text5
source: The issue, most of the times, is supporting changes on the color scheme with the app running. Make sure to reload the colors on your UIView or ude the color scheme Environment property on your SwiftUI Views.
nl: Het probleem is meestal het ondersteunen van wijzigingen in het kleurenschema terwijl de app wordt uitgevoerd. Zorg ervoor dat je de kleuren opnieuw laadt op je UIView of gebruik de kleurenschema Environment property op je SwiftUI-views.
pt_br: O maior problema, na maioria das vezes, é suportar a mudança dinâmica de esquema de cores, quando o usuário faz alterações com o seu app sendo executado. Garanta que as cores das suas UIViews são recarregadas quando mudanças acontecerem, ou usar a variável de ambiente correta em SwiftUI para identificar o mesmo efeito.

source: Visual Aid
nl: Visuele ondersteuning
pt_br: Ajudas visuais

# ButtonShapes.title
source: Button Shapes
nl: Knopvormen
pt_br: Figuras nos botões

# ButtonShapes.Intro.text1
source: "Button Shapes" is another accessibility option that can be enabled on the system settings.
nl: "Knopvormen" is een andere toegankelijkheidsoptie die kan worden ingeschakeld in de systeeminstellingen.
pt_br: "Figuras nos botões" é outra opção de acessibilidade que pode ser ativada nas configurações do sistema.

# ButtonShapes.Intro.text2
source: The idea is to highlight buttons, by adding outlines to them, in order to help users identify which contents are interactable while using your application.
nl: Het idee is om knoppen te benadrukken door contouren toe te voegen, om gebruikers te helpen identificeren welke inhoud interactief is bij het gebruik van jouw applicatie.
pt_br: A ideia é destacar botões, adicionando formas ao contorno deles, de forma que isso ajuda o usuário a perceber quais elementos podem ser tocados quando usando a sua aplicação.

# ButtonShapes.Intro.comment1
source: If you are using 'UIButton' or a 'Button', this highlight will automatically be displayed whenever the feature is enabled.
nl: Als je 'UIButton' of een 'Button' gebruikt, wordt deze markering automatisch weergegeven wanneer de functie is ingeschakeld.
pt_br: Se você está usando um 'UIButton' ou um 'Button', esse contorno será adicionado automaticamente quando a feature estiver ativada.

# ButtonShapes.Example.text1
source: Check the multiple examples of buttons below, then enable the 'Button Shapes' feature on the device's setting to see how they behave.
nl: Bekijk de verschillende voorbeelden van knoppen hieronder en schakel vervolgens de functie 'Knopvormen' in de systeeminstellingen in om te zien hoe ze zich gedragen.
pt_br: Observe os exemplos abaixo, onde todos são botões, e então ative a opção nas configurações do sistema e note novamente como eles se comportam.

# ButtonShapes.Example.comment1
source: It's nice to notice that not all buttons will have the same highlight. The back button in the navigation bar will be underlined, for instance.
nl: Het is goed om op te merken dat niet alle knoppen dezelfde markering hebben. De terugknop in de navigatiebalk wordt bijvoorbeeld onderstreept.
pt_br: Também é interessante notar que nem todos os botões tem o mesmo tipo de destaque. O botão de voltar na barra de navegação, por exeplo, fica com o texto sublinhado.

# ButtonShapes.Code.text1
source: If you need to identify to make any manual changes on your content, you can use a static variable on UIKit or an Environment variable on SwiftUI.
nl: Als je handmatige wijzigingen aan je inhoud moet aanbrengen, kun je een statische variabele in UIKit of een Environment-variabele in SwiftUI gebruiken.
pt_br: Casso você presice identificar manualmente o estado dessa feature para atualizar seu conteúdo, você pode usar a variável estática do UIAccessibility no UIKit, ou a variável de ambiente em SwiftUI.

source: Button
nl: Knop
pt_br: Botão

# BoldedText.title
source: Bolded Text
nl: Vetgedrukte tekst
pt_br: Texto em Negrito

# BoldedText.Intro.text1
source: "Bolded Text" is another accessibility option that can be enabled on the system settings.
nl: "Vetgedrukte tekst" is een andere toegankelijkheidsoptie die kan worden ingeschakeld in de systeeminstellingen.
pt_br: "Texto em Negrito" é outra opção de acessibilidade que pode ser ativada nas configurações do sistema.

# BoldedText.Intro.text2
source: It's mainly used by people with lower vision to help reading content on your app by enlarging the font's weight.
nl: Het wordt voornamelijk gebruikt door mensen met verminderd zicht om het lezen van inhoud in je app te vergemakkelijken door het gewicht van het lettertype te vergroten.
pt_br: É geralmente usada por pessoas que têm baixa visão com o intuito de aumentar o peso da fonte e deixar o conteúdo mais fácil de ser lido.

# BoldedText.Intro.text3
source: When using system fonts, they will automatically adapt themselves to the user's defined setting for the weight.
nl: Bij gebruik van systeemlettertypen passen ze zich automatisch aan aan de door de gebruiker gedefinieerde instelling voor het gewicht.
pt_br: Quando usando fontes do sistema, elas irão de adaptar automaticamente ao estilo definido pelo usuário.

# BoldedText.Intro.comment1
source: When using custom fonts, you may need to manually define it's weight when necessary.
nl: Bij gebruik van aangepaste lettertypen moet je mogelijk handmatig het gewicht ervan definiëren wanneer dat nodig is.
pt_br: Quando usando fontes customizadas, você pode precisar ajustar manualmente o peso da fonte considerando se esta opção está habilitada.

# BoldedText.Code.text1
source: It's also important to notice that fonts that are already bold, become even 'bolder' when manually adjusting these changes.
nl: Het is ook belangrijk op te merken dat lettertypen die al vet zijn, nog 'vetter' worden bij handmatige aanpassingen van deze wijzigingen.
pt_br: Também é importante perceber que fontes que já estão em negrito, também aumentam seu peso quando esta opção está ativada..

# BoldedText.Code.comment1
source: This app fully supports bolded fonts, change the accessibility option on the device's setting and check how the app behaves.
nl: Deze app ondersteunt volledig vetgedrukte lettertypen, wijzig de toegankelijkheidsoptie in de systeeminstellingen en controleer hoe de app zich gedraagt.
pt_br: Este app suporta a opção de texto em negrito, mude essa opção nas configurações do seu dispositivo e veja como o app se comporta.

# LearnAccessibility.title
source: Learn Accessibility
nl: Leer toegankelijkheid

# ThinkingAccessibility.title
source: Thinking Accessibility
nl: Denken aan toegankelijkheid

# ThinkingAccessibility.text1
source: This section is a different type of guide, where we want to show you how to think about accessibility while developing or creating new applications.
nl: Deze sectie is een ander type handleiding, waarbij we je willen laten zien hoe je moet nadenken over toegankelijkheid bij het ontwikkelen of maken van nieuwe applicaties.

# ThinkingAccessibility.text2
source: Accessibility is one of those things that if you say: "I want to improve accessibility on our app!", nobody is going to say no.
nl: Toegankelijkheid is een van die dingen waarvan, als je zegt: "Ik wil de toegankelijkheid van onze app verbeteren!", niemand nee zal zeggen.

# ThinkingAccessibility.text3
source: But it can get hard to start making these improvements and see a real impact to your users.
nl: Maar het kan moeilijk zijn om te beginnen met het aanbrengen van deze verbeteringen en een echt effect te zien bij je gebruikers.

# ThinkingAccessibility.text4
source: Or maybe you are starting a new app and you want to give support to accessibility features from the begining.
nl: Of misschien begin je een nieuwe app en wil je vanaf het begin ondersteuning bieden voor toegankelijkheidsfuncties.

# ThinkingAccessibility.text5
source: So, we are bringing a content based on real life experiences, alongside the common guide for all the accessibility options and features, to help you not only learn what they are, but the best scenarios to use them.
nl: Daarom brengen we content gebaseerd op echte ervaringen, samen met de gebruikelijke handleiding voor alle toegankelijkheidsopties en functies, om je niet alleen te leren wat ze zijn, maar ook de beste scenario's om ze te gebruiken.

# ThinkingAccessibility.comment1
source: The idea is to help you "think accessibility", understand common pitfalls and start a new project having a good idea of what you should expect when creating an iOS application.
nl: Het idee is om je te helpen "denken aan toegankelijkheid", inzicht te krijgen in veelvoorkomende valkuilen en een nieuw project te starten met een goed idee van wat je kunt verwachten bij het maken van een iOS-applicatie.

# ThinkingAccessibility.text6
source: Welcome, to the Accessibility Handbook classes!
nl: Welkom bij de lessen van het Handboek Toegankelijkheid!

# ThinkingAccessibility.comment2
source: So, sit tight! If you are new on the iOS accessibility world, this is going to be a wild ride!
nl: Dus, zet je schrap! Als je nieuw bent in de wereld van iOS-toegankelijkheid, wordt dit een wilde rit!

# TeamGame.title
source: Accessibility is a team game
nl: Toegankelijkheid is een teamsport

# TeamGame.text1
source: While learning accessibility by yourself feels good, it feels good to be able to reach people you could not before, it fells good to provide new services and content to a whole new group of people, you are most likely not going to handle it on your own.
nl: Hoewel het leren van toegankelijkheid door jezelf goed voelt, het is fijn om mensen te bereiken die je eerder niet kon bereiken, het is fijn om nieuwe diensten en inhoud te bieden aan een hele nieuwe groep mensen, ga je het waarschijnlijk niet alleen redden.

# TeamGame.comment1
source: Bear with me! 🐻
nl: Houd vol! 🐻

# TeamGame.text2
source: If you work on a company, on a startup, or you made a new app project with some friends, you know that creating a new app is not an easy task.
nl: Als je bij een bedrijf werkt, bij een startup, of je hebt een nieuw app-project gemaakt met een paar vrienden, weet je dat het maken van een nieuwe app geen eenvoudige taak is.

# TeamGame.text3
source: And accessibility is not a developer or designer specific job. It's easy to think "Oh, our designer should have figured that!" Or even, "Accessibility? That's a job for our developers!"
nl: En toegankelijkheid is geen specifieke taak van ontwikkelaars of ontwerpers. Het is gemakkelijk om te denken "Oh, onze ontwerper had dat moeten bedenken!" Of zelfs, "Toegankelijkheid? Dat is een taak voor onze ontwikkelaars!"

# TeamGame.text4
source: Think of it as part of your culture. Everybody should understand and question how accessibility should work.
nl: Zie het als onderdeel van je cultuur. Iedereen zou toegankelijkheid moeten begrijpen en zich moeten afvragen hoe toegankelijkheid zou moeten werken.

# TeamGame.text5
source: This way, we can make sure that we have the right questions and issues being tackled on every aspect of your application, on design, development, product... everything!
nl: Op deze manier kunnen we ervoor zorgen dat we de juiste vragen en problemen aanpakken op elk aspect van je applicatie, bij design, ontwikkeling, product... alles!

# TeamGame.TalkToYourTeam.title
source: Talk to your team
nl: Praat met je team

# TeamGame.TalkToYourTeam.text1
source: What was the last time you asked your designer "Have you thought about how to interact with this element with a screen reader?"
nl: Wanneer heb je voor het laatst aan je ontwerper gevraagd: "Heb je nagedacht over hoe je met dit element kunt interageren met een schermlezer?"

# TeamGame.TalkToYourTeam.text2
source: Or what was the last time you asked your developer "How can we make this component have a better interaction when using accessibility features?"
nl: Of wanneer heb je voor het laatst aan je ontwikkelaar gevraagd: "Hoe kunnen we ervoor zorgen dat deze component een betere interactie heeft bij het gebruik van toegankelijkheidsfuncties?"

# TeamGame.TalkToYourTeam.comment1
source: I know this sound a little like coaching, sorry about that, but it's important.
nl: Ik weet dat dit een beetje als coaching klinkt, sorry daarvoor, maar het is belangrijk.

# TeamGame.TalkToYourTeam.text3
source: By asking questions, you are bringing the discussion about accessibility into your daily work.
nl: Door vragen te stellen, breng je de discussie over toegankelijkheid in je dagelijkse werk.

# TeamGame.TalkToYourTeam.text4
source: "This font seems small, do we have support for dynamic fonts?"
nl: "Deze letter lijkt klein, hebben we ondersteuning voor dynamische lettertypen?"

# TeamGame.TalkToYourTeam.text5
source: "The contrast does not seem good, have we checked for colorblindness? Do we have support for a increased contrast color pallet?"
nl: "Het contrast lijkt niet goed, hebben we gecontroleerd op kleurenblindheid? Hebben we ondersteuning voor een kleurenpalet met verhoogd contrast?"

# TeamGame.TalkToYourTeam.text6
source: Make questions. Usually, nobody is a specialist in accessibility, maybe someone knows more about a different platform than the one you are working with, and you can try connecting this knowledge with your current work.
nl: Stel vragen. Meestal is niemand een specialist in toegankelijkheid, misschien weet iemand meer over een ander platform dan waaraan je werkt, en kun je proberen deze kennis te verbinden met je huidige werk.

# TeamGame.TalkToYourTeam.comment2
source: I'm not a designer nor a specialist myself, I'm more of an enthusiast.
nl: Ik ben zelf geen ontwerper of specialist, ik ben meer een enthousiasteling.

# TeamGame.TalkToYourTeam.text7
source: But to make good questions, and give nice suggestions, you need to understand more what are you really working with.
nl: Maar om goede vragen te stellen en goede suggesties te doen, moet je meer begrijpen waar je echt aan werkt.

# TeamGame.ShareTheKnowledge.title
source: Share the knowledge
nl: Deel de kennis

# TeamGame.ShareTheKnowledge.text1
source: Show to your peers whenever you create something nice, when you use a new feature that you have never used before.
nl: Laat aan je collega's zien wanneer je iets moois hebt gemaakt, wanneer je een nieuwe functie hebt gebruikt die je nog nooit eerder hebt gebruikt.
pt_br: We believe that a good knowledge is something to share. And there is no better way to create an accessibility culture without sharing it.

# TeamGame.ShareTheKnowledge.text2
source: Spreading knowledge will help more people to know about it, and give them and yourself more tools to work with in the future.
nl: Kennis verspreiden helpt meer mensen erover te weten te komen en geeft jou en anderen meer tools om in de toekomst mee te werken.

# TeamGame.ShareTheKnowledge.comment1
source: And that goes for everything, not only accessibility!
nl: En dat geldt voor alles, niet alleen voor toegankelijkheid!

# TeamGame.ShareTheKnowledge.text3
source: And if you are using this app, you can even use the neat share tool on top of every page to bring people directly into an example of what you are talking about!
nl: En als je deze app gebruikt, kun je zelfs de handige deeltool bovenaan elke pagina gebruiken om mensen rechtstreeks naar een voorbeeld van waar je het over hebt te brengen!

# LearnTheFeatures.title
source: Learn the Features
nl: Leer de functies

# LearnTheFeatures.text1
source: In order to make good questions, give better suggestions, integrate accessibility on your development...
nl: Om goede vragen te stellen, betere suggesties te doen, toegankelijkheid te integreren in je ontwikkeling...

# LearnTheFeatures.text2
source: You need to learn what the accessibility features and options are, what difference they make on your app, how they impact your users, and most of all: How to use them.
nl: Moet je leren wat de toegankelijkheidsfuncties en opties zijn, wat het verschil maakt in je app, hoe het je gebruikers beïnvloedt, en vooral: hoe je ze moet gebruiken.

# LearnTheFeatures.text3
source: And this is your lucky day! Because this app not only contains guides on how to implement iOS accessibility options, but you can try them for yourself!
nl: En dit is jouw geluksdag! Want deze app bevat niet alleen handleidingen over hoe je iOS-toegankelijkheidsopties implementeert, maar je kunt ze zelf uitproberen!

# LearnTheFeatures.VoiceOver.text1
source: Supporting VoiceOver use on your apps is usually what needs the most implementation and thought.
nl: Het ondersteunen van het gebruik van VoiceOver in je apps is meestal wat de meeste implementatie en overweging vereist.

# LearnTheFeatures.VoiceOver.comment1
source: But, do you know what you can do with VoiceOver?
nl: Maar weet je wat je kunt doen met VoiceOver?

# LearnTheFeatures.VoiceOver.text2
source: It's not only setting an 'accessibility label' into everything. We have different ways to group content, different ways to interact with elements and different ways to navigate through the app.
nl: Het gaat niet alleen om het instellen van een 'toegankelijkheidslabel' voor alles. We hebben verschillende manieren om inhoud te groeperen, verschillende manieren om met elementen te communiceren en verschillende manieren om door de app te navigeren.

# LearnTheFeatures.VoiceOver.text3
source: If you are not familiar with the VoiceOver, the concepts, the names, the gestures, take a look into our VoiceOver section on the Development Guides!
nl: Als je niet bekend bent met VoiceOver, de concepten, de namen, de gebaren, kijk dan eens naar onze VoiceOver-sectie in de Ontwikkelingshandleidingen!

# LearnTheFeatures.VoiceOver.comment2
source: And make sure to try using the VoiceOver while reading the content so you can better understand what each element does.
nl: En zorg ervoor dat je VoiceOver probeert te gebruiken terwijl je de inhoud leest, zodat je beter begrijpt wat elk element doet.

# LearnTheFeatures.VoiceOver.text4
source: And if you want a "hand" to learn how to navigate using the VoiceOver, we have a gesture guide!
nl: En als je een 'hand' wilt om te leren navigeren met behulp van VoiceOver, hebben we een gebarenhandleiding!

# LearnTheFeatures.BeyondTheVoiceOver.title
source: Beyond The VoiceOver
nl: Voorbij VoiceOver

# LearnTheFeatures.BeyondTheVoiceOver.text1
source: Sometimes when talking about accessibility on mobile devices, we focus only on screen readers (on iOS, the VoiceOver).
nl: Soms, als we het hebben over toegankelijkheid op mobiele apparaten, richten we ons alleen op screenreaders (op iOS, de VoiceOver).

# LearnTheFeatures.BeyondTheVoiceOver.text2
source: But that's not what accessibility is about! There is an entire world of features, options, issues, disabilities, devices... that are part of accessibility.
nl: Maar dat is niet waar toegankelijkheid over gaat! Er is een hele wereld van functies, opties, problemen, beperkingen, apparaten... die deel uitmaken van toegankelijkheid.

# LearnTheFeatures.BeyondTheVoiceOver.text3
source: And we also have guides on those!
nl: En daar hebben we ook handleidingen voor!

# LearnTheFeatures.BeyondTheVoiceOver.text4
source: Learn more about colors, motion, visual aids, fonts, haptics, contrast... and much more, so you know what to think and ask about.
nl: Lees meer over kleuren, beweging, visuele ondersteuning, lettertypen, haptiek, contrast... en nog veel meer, zodat je weet waar je aan moet denken en waar je vragen over moet stellen.

# TryItYourself.title
source: Try it yourself
nl: Probeer het zelf

# TryItYourself.text1
source: Yep, thats it, try it for yourself!
nl: Ja, dat is het, probeer het zelf!

# TryItYourself.text2
source: Try not to keep wat you learn here only on this app. Start a new app, try implementing dynamic fonts, VoiceOver features, Dark mode, Rotor entries...
nl: Probeer niet alleen te houden wat je hier leert op deze app. Start een nieuwe app, probeer dynamische lettertypen te implementeren, VoiceOver-functies, Donkere modus, Rotor-items...

# TryItYourself.text3
source: Understand what they do, how they impact your code, and how to use them.
nl: Begrijp wat ze doen, hoe ze invloed hebben op je code, en hoe je ze moet gebruiken.

# TryItYourself.text4
source: We even have hundreds of code examples to help you get started. But they are only examples.
nl: We hebben zelfs honderden codevoorbeelden om je op weg te helpen. Maar het zijn slechts voorbeelden.

# TryItYourself.text5
source: You'll get it for yourself once you really start introducing these featuers on your code and your app.
nl: Je zult het zelf begrijpen zodra je deze functies echt begint toe te passen op je code en je app.

# TryItYourself.text6
source: And also, try running everything on a real device. Get the feel of how things work in the real life, out of Xcode.
nl: En probeer ook alles op een echt apparaat uit te voeren. Krijg het gevoel van hoe dingen werken in het echte leven, buiten Xcode.

# TryItYourself.comment1
source: What was the last time you ran your app with the VoiceOver running? Or that you tried to increase your fonts to see how your layout behaves?
nl: Wanneer heb je voor het laatst je app uitgevoerd met VoiceOver? Of wanneer heb je geprobeerd je lettertypen te vergroten om te zien hoe je lay-out zich gedraagt?
