Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# NotifyChanges.layoutChange
source: Layout change notification
nl: Melding van lay-outwijziging
pt_br: Notificação de mudança de layout

# ChangeCursor.title
source: Change cursor position
nl: Cursorpositie wijzigen
pt_br: Mudar a posição do cursor

# ChangeCursor.Intro.text1
source: Most of the time, we want the user to be in control to where VoiceOver cursor should move to.
nl: Meestal willen we dat de gebruiker controle heeft over waar de VoiceOver-cursor naartoe moet.
pt_br: Na maioria das vezes, queremos que o usuário controle por completo para onde o cursor do VoiceOver vai se mover.

# ChangeCursor.Intro.text2
source: Sometimes, when we change something on the screen, like presenting a modal on top of everything, we want to redirect the user directly to the new content.
nl: Soms, wanneer we iets op het scherm veranderen, zoals het presenteren van een modaal bovenop alles, willen we de gebruiker rechtstreeks naar de nieuwe inhoud leiden.
pt_br: Quando mudamos algo na tela, como apresentar um modal em cima de todo o conteúdo, queremos redirecionar o usuário corretamente para esse novo conteúdo.

# ChangeCursor.Intro.comment
source: But, to do that, it works different in UIKit and SwiftUI, so we are going to have a section for each in this page
nl: Maar hiervoor werkt het anders in UIKit en SwiftUI, dus we gaan voor elke sectie een aparte pagina hebben.
pt_br: Mas, para isso, funciona um pouco diferente em UIKit e SwiftUI, então vamos separa as duas abordagens aqui.

# ChangeCursor.uikit.text1
source: To change the cursor position on UIKit, we are going to use the screen change notifications.
nl: Om de cursorpositie in UIKit te wijzigen, gaan we de meldingen van schermwijzigingen gebruiken.
pt_br: Para mudar a posição do cursor em UIKit, usamos as notificações de mudança de tela.

# ChangeCursor.uikit.text2
source: When triggering one of these notifications, we can pass as the argument the view we want VoiceOver to focus on.
nl: Bij het activeren van een van deze meldingen kunnen we de weergave die we willen dat VoiceOver zich op focust, als argument doorgeven.
pt_br: Quanto disparadas uma dessas notificações, podemos passar uma view como argumento, o que vai fazer com que o leitor mude o foco para essa view.

# ChangeCursor.uikit.link
source: More on Screen Change notifications.
nl: Meer over meldingen van schermwijzigingen.
pt_br: Mais sobre notificações de mudança de tela.

# ChangeCursor.swiftui.text1
source: On SwiftUI, we are not going to use the Accessibility Notifications, instead, we are using the @AccessibilityFocusState
nl: Bij SwiftUI gaan we geen gebruik maken van de toegankelijkheidsmeldingen, in plaats daarvan gebruiken we de @AccessibilityFocusState.
pt_br: Em SwiftUI, não vamos usar notificações, mas sim o @AccessibilityFocusState

# ChangeCursor.swiftui.text2
source: It allow to control if the cursor is focused on a view, and move the navigation to it.
nl: Het stelt ons in staat om te controleren of de cursor is gefocust op een weergave en de navigatie daarnaartoe te verplaatsen.
pt_br: Ele permite saber se o cursor está focado numa view específica, e mover a nevageção pra ela caso necessário.

# ChangeCursor.swiftui.text3
source: First, create a new Boolean property using this wrapper
nl: Maak eerst een nieuwe Boolean-eigenschap met deze wrapper
pt_br: Primeiro, criar um novo Booleano usando esse 'property wrapper'.

# ChangeCursor.swiftui.text4
source: Then, assign it to the view you want to control by using a view modifier.
nl: Wijs het vervolgens toe aan de weergave die je wilt besturen met behulp van een weergavemodifier.
pt_br: Depois, associe-o a sua view usando um 'modifier'.

# ChangeCursor.swiftui.text5
source: Now you can change the focus to the view by setting the property to 'True'.
nl: Nu kun je de focus op de weergave wijzigen door de eigenschap op 'True' in te stellen.
pt_br: Agora, você pode mudar o foco pra essa view setando esse bolleano para 'True'.

# ChangeCursor.swiftui.comment
source: You can even observe this property to handle something when it focus/unfocus on it.
nl: Je kunt zelfs deze eigenschap observeren om iets te behandelen wanneer het gefocust/ongefocust is.
pt_br: Você pode até observar mudanças nessa propriedade para tratar alguma quando quando sua view for focada/desfocada pelo leitor.

# ContentHiererachy
source: Content Hierarchy
nl: Inhoudshiërarchie
pt_br: Hierarquia de conteúdo

# Modal.title
source: Modal views
nl: Modale weergaven
pt_br: Modais

# Modal.Intro.text1
source: Modal Views, in this case, we are talking about any view that is displayed on top of existing content. Banners, toasts, floating buttons...
nl: Modale weergaven, in dit geval hebben we het over elke weergave die bovenop bestaande inhoud wordt weergegeven. Banners, toasts, zwevende knoppen...
pt_br: Modais (Modal Views), nesse caso, estamos falando de views que são exibidas acima de outros conteúdos na tela. Baners, pop-ups, botões flutuantes...

# Modal.Intro.text2
source: The problem is: VoiceOver will try to use the language's Natural reading directions to read the content, and even if your view is on top of every other view, VoiceOver will still focus on the content behind it.
nl: Het probleem is: VoiceOver zal proberen de natuurlijke leesrichting van de taal te gebruiken om de inhoud voor te lezen, en zelfs als je weergave bovenop elke andere weergave staat, zal VoiceOver nog steeds focussen op de inhoud erachter.
pt_br: O problema é: O VoiceOver vai tentar manter a order de leitura natural a língua atual, e mesmo se houver outra view acima das demais, ele pode focar no conteúdo que está atras dessa view, e até mesmo ignorá-la por completo!

# Modal.Intro.text3
source: To prevent this issue, we can mark a view as being a 'Modal'. This will make VoiceOver focus only on that view while it's being presented.
nl: Om dit probleem te voorkomen, kunnen we een weergave markeren als zijnde 'Modaal'. Dit zorgt ervoor dat VoiceOver alleen focust op die weergave terwijl deze wordt gepresenteerd.
pt_br: Para previnir esse problema, podemos marcar uma view como sendo um Modal. Isso faz com que o leitor foque apenas nessa view enquanto ela estiver visível.

# Modal.Intro.comment1
source: But handling Modals has some differences in UIKit and SwiftUI, so I'm splitting into a section for each one here.
nl: Maar het behandelen van modals heeft enkele verschillen in UIKit en SwiftUI, dus ik verdeel het hier in een sectie voor elk.
pt_br: Mas tratar modais também é diferente em UIKit e SwiftUI.

# Modal.Intro.link
source: Read more on reading order.
nl: Lees meer over leesvolgorde.
pt_br: Leia mais sobre ordem de leitura dos componentes.

# Modal.uikit.text1
source: On UIKit, every UIView has the property 'accessibilityViewIsModal'. And we need to set it to 'True' if we want to mark a view as being a modal.
nl: In UIKit heeft elke UIView de eigenschap 'accessibilityViewIsModal'. En we moeten het instellen op 'True' als we een weergave als modaal willen markeren.
pt_br: No UIKit, toda UIView tem a propriedade 'accessibilityViewIsModal'. E só precisamos marcá-la como 'True' para dizer que é um modal.

# Modal.uikit.text2
source: But, on my experience, I find that simply setting it to 'True' sometimes does not have the expected behavior.
nl: Maar in mijn ervaring vind ik dat het eenvoudig instellen op 'True' soms niet het verwachte gedrag heeft.
pt_br: Mas, na minha experiência, apenas setar essa propriedade as vezes não tem o comportamento esperado.

# Modal.uikit.text3
source: I suggest overriding this property on the Modal View's class, and set it to the correct value.
nl: Ik stel voor om deze eigenschap in de Class van de modale weergave te overschrijven en deze op de juiste waarde in te stellen.
pt_br: Eu sugiro dar um override nessa propriedade na sua view modal, e então retornar o valor esperado.

# Modal.swiftui.text1
source: On SwiftUI the 'Modal' can be set as it was an accessibility trait.
nl: Bij SwiftUI kan de 'Modaal' worden ingesteld alsof het een toegankelijkheidstraits is.
pt_br: Em SwiftUI o Modal pode ser setado da mesma forma que um 'accessibility trait'.

# Modal.example.text1
source: Turn VoiceOver on and test the modals below.
nl: Zet VoiceOver aan en test de modals hieronder.
pt_br: Ative o VoiceOver e analise os modais abaixo.

# Modal.example.goodModal
source: Good modal
nl: Goede modale weergave
pt_br: Modal bom

# Modal.example.thisGoodModal
source: This is a Good modal
nl: Dit is een goede modale weergave
pt_br: Este é um bom exemplo de modal.

# Modal.example.badModal
source: Bad Modal
nl: Slechte modale weergave
pt_br: Modal ruim

# Modal.example.thisBadModal
source: This is a Bad modal
nl: Dit is een slechte modale weergave
pt_br: Este é um modal ruim. Não configurado como modal.

# Modal.example.comment
source: Noticed that when opening the good modal, the cursor focused directly on it? It is important when displaying a modal on top of existing content that we do that.
nl: Gemerkt dat bij het openen van de goede modale weergave de cursor er direct op werd gefocust? Dit is belangrijk bij het weergeven van een modale weergave bovenop bestaande inhoud.
pt_br: Percebeu que ao abrir o modal bom, o cursor focou diretamente nele? É importante mudar a navegação do seu cursor para o modal quando ele é exibido sobre o restante do conteúdo da tela.

# Modal.example.link
source: Learn more about it on the Notifications section.
nl: Lees er meer over in de sectie Meldingen.
pt_br: Veja mais sobre isso na seção sobre notificações - Mudando a posição do cursor.

# Grouping.title
source: Grouping Elements
nl: Elementen Groeperen
pt_br: Agrupar elementos

# Grouping.text1
source: To me, Grouping elements correctly is one of the most important parts of building a good accessible view.
nl: Voor mij is het correct groeperen van elementen een van de belangrijkste onderdelen bij het bouwen van een goed toegankelijk weergave.
pt_br: Agrupar elementos corretamente é uma das partes mais importantes de ter uma tela acessível.

# Grouping.text2
source: Imagine a carousel with a bunch of cells, when using VoiceOver, we want the cursor to focus on each individual cell, not on the cells content.
nl: Stel je een carrousel voor met een hoop cellen. Bij gebruik van VoiceOver willen we dat de cursor zich richt op elke afzonderlijke cel, niet op de inhoud van de cellen.
pt_br: Imagine o cenário: Um carrosel de células, quando usando o VoiceOver, queremos que cada célula seja focada individualmente e não focar em cada subview da célula, mas sim ela como um todo.

# Grouping.comment
source: This may seem obvious, but can be easily forgotten on development.
nl: Dit lijkt misschien voor de hand liggend, maar kan gemakkelijk worden vergeten tijdens de ontwikkeling.
pt_br: Pode parece óbvio, mas é fácil de esquecer desse ponto durante o desenvolvimento.

# Grouping.text3
source: Turn VoiceOver on and check both carousels below, one has the content correctly grouped, and the other don't.
nl: Zet VoiceOver aan en controleer beide carrousels hieronder. De een heeft de inhoud correct gegroepeerd en de ander niet.
pt_br: Ligue o VoiceOver e foque nos dois carrosséis abaixo, um tem o conteúdo das células corretamente agrupado e o outro não.

# Grouping.goodCarousel
source: Good Carousel
nl: Gegroepeerde Carrousel
pt_br: Carrossel Bom

# Grouping.badCarousel
source: Bad Carousel
nl: Ongroeperde Carrousel
pt_br: Carrossel ruim

# Grouping.cellTitle
source: Cell title
nl: Cel titel
pt_br: Título

# Grouping.cellContent
source: Cell content
nl: Cel inhoud
pt_br: Conteúdo

# Grouping.cellComment
source: Cell comment
nl: Cel opmerking
pt_br: Comentário

# Grouping.uikit.text
source: On UIKit, you need to make the parent view an accessible element and not the children. Then, combine them to build the correct accessibility label for the parent.
nl: Op UIKit moet je ervoor zorgen dat de bovenliggende weergave een toegankelijk element is en niet de kinderen. Combineer ze vervolgens om het juiste toegankelijkheidslabel voor de bovenliggende weergave te bouwen.
pt_br: No UIKit, você precisa deixar a view pai como sendo um elemento acessível, e não as views filhas. Então, combiná-los para montar o conteúdo correto da 'accessibility label' do pai.

# Grouping.swiftui.text
source: SwiftUI has a better wrapper to combine all children into a single accessible element.
nl: SwiftUI heeft een betere wrapper om alle kinderen te combineren tot een enkel toegankelijk element.
pt_br: SwiftUI tem um 'View Modifier' que simplifica bastante desse trabalho de agrupar as views filhas em um único 'accessible element'.

# GameSuccess.title
source: Congratulations!
nl: Gefeliciteerd!
pt_br: Parabéns!

# GameSuccess.subtitle
source: You solved the puzzle!
nl: Je hebt de puzzel opgelost!
pt_br: Você resolveu o desafio!

# GameSuccess.text
source: If you want to learn more about this puzzle check our documentation
nl: Als je meer wilt weten over deze puzzel, bekijk dan onze documentatie
pt_br: Se você quiser saber mais sobre como o jogo foi montado, não deixe de ver nossa documentação:

# GameSuccess.suggestedReading
source: Suggested reading
nl: Aanbevolen leesmateriaal
pt_br: Leitura sugerida

# Hint.hint
source: Activate to get a hint on how to solve this puzzle.
nl: Activeer om een hint te krijgen over hoe je deze puzzel kunt oplossen.
pt_br: Abrir uma dica sobre este jogo.

# Hint.close
source: Close hint
nl: Sluit hint
pt_br: Fechar dica

# Hint.title
source: 🤔 Having Trouble?
nl: 🤔 Heb je moeite?
pt_br: 🤔 Tendo dificuldades?

# Hint.text1
source: The Handbook puzzles were made to be solved using some kind of accessibility tool (or a combination of them).
nl: De Handboek-puzzels zijn gemaakt om opgelost te worden met behulp van een soort toegankelijkheidstool (of een combinatie daarvan).
pt_br: Os jogos do Handbook foram feitos para serem resolvidos com alguma ferramenta de acessibilidade (ou uma combinação delas).

# Hint.text2
source: If you can't figure it out, maybe this page will help you...
nl: Als je er niet uitkomt, kan deze pagina je misschien helpen...
pt_br: Se você não conseguir descobrir, talvez esta página possa ajudar...

# GameView.comment
source: Try solving these puzzles to learn more about accessibility features!
nl: Probeer deze puzzels op te lossen om meer te leren over toegankelijkheidsfuncties!
pt_br: Jogue para aprender mais sobre acessibilidade!

# GameCell.finishedHint
source: You have already succeeded in this puzzle!
nl: Je hebt deze puzzel al opgelost!
pt_br: Você já terminou este daqui!

# GameCell.unfinishedHint
source: You haven't finished this puzzle yet
nl: Je hebt deze puzzel nog niet voltooid
pt_br: Você ainda não terminou este jogo.

# WhereIsMyContent.title
source: Where is my content?
nl: Waar is mijn inhoud?
pt_br: Cadê o texto?

# WhereIsMyContent.text1
source: This puzzle is pretty easy.
nl: Deze puzzel is vrij eenvoudig.
pt_br: Esse jogo é fácil.

# WhereIsMyContent.text2
source: You need to find the correct button to finish the puzzle by using VoiceOver!
nl: Je moet de juiste knop vinden om de puzzel op te lossen met behulp van VoiceOver!
pt_br: Você precisa encontrar o botão correto usando o VoiceOver!

# FindThePassword.title
source: Find the Password
nl: Vind het Wachtwoord
pt_br: Encontre a senha

# FindThePassword.text1
source: You need to type in the correct password!
nl: Je moet het juiste wachtwoord typen!
pt_br: Digite a senha correta!

# FindThePassword.text2
source: It's as simple as that
nl: Zo eenvoudig is het
pt_br: É só isso

# FindThePassword.comment
source: You just need to find out what the password is...
nl: Je hoeft alleen maar uit te vinden wat het wachtwoord is...
pt_br: Você só tem que descobrir qual a senha...

# BePatient.title
source: Be Patient
nl: Wees Geduldig
pt_br: Paciência

# BePatient.text
source: Tap the elements in the correct order!
nl: Tik op de elementen in de juiste volgorde!
pt_br: Toque nos elementos na ordem correta!

# BePatient.comment
source: Pacience is the key...
nl: Geduld is de sleutel...
pt_br: Paciência é a chave.

# Impostor.title
source: Impostor
nl: Bedrieger

# Impostor.text
source: Find the impostor, and type it's name!
nl: Vind de bedrieger en typ zijn naam!
pt_br: Encontre o impostor e digite o nome dele!

# Impostor.comment
source: Ask them, maybe they'll tell you.
nl: Vraag het ze, misschien vertellen ze het je.
pt_br: Pergunta lá, talvez eles digam alguma coisa.

# Impostor.field
source: Type the impostor's name
nl: Typ de naam van de bedrieger
pt_br: Digite o nome do impostor

# Impostor.hint
source: I'm not the impostor
nl: Ik ben niet de bedrieger
pt_br: Eu não sou o impostor.

# Impostor.impostor
source: Yes, I'm the impostor
nl: Ja, ik ben de bedrieger
pt_br: Sim, eu sou o impostor.

# Invisibility.title
source: Invisibility
nl: Onzichtbaarheid
pt_br: Invisibilidade

# Invisibility.text
source: Just because you can't see, doens't mean it's not there.
nl: Alleen omdat je het niet kunt zien, betekent niet dat het er niet is.
pt_br: Só porque VOCÊ não consegue ver, não significa que não está lá.

# Invisibility.comment
source: Wait... Is this content TRANSPARENT?
nl: Wacht... Is deze inhoud TRANSPARANT?
pt_br: Espera... Esse conteúdo é TRANSPARENTE?

# Invisibility.transparent
source: Wait... Is this content TRANSPARENT?
nl: Wacht... Is deze inhoud TRANSPARANT?
pt_br: Espera... Esse conteúdo é TRANSPARENTE?

# Impostor2.title
source: Impostor 2.0
nl: Bedrieger 2.0

# Impostor2.text
source: Find the impostor, and type it's name!
nl: Vind de bedrieger en typ zijn naam!
pt_br: Encontre o impostor e digite o nome dele!

# Impostor2.comment
source: Ask them, maybe they'll tell you.
nl: Vraag het ze, misschien vertellen ze het je.
pt_br: Pergunta lá, talvez eles digam alguma coisa.

# Impostor2.field
source: Type the impostor's name
nl: Typ de naam van de bedrieger
pt_br: Digite o nome do impostor

# TheMagicPuzzle.title
source: The 'Magic' Puzzle
nl: De 'Magische' Puzzel
pt_br: Quebra cabeça 'Mágico'

# TheMagicPuzzle.text
source: This puzzle is Magic!
nl: Deze puzzel is Magisch!
pt_br: Esse jogo é mágico!

# TheMagicPuzzle.comment
source: I don't know what else to tell you...
nl: Ik weet niet wat ik je nog meer moet vertellen...
pt_br: Eu não sei o que mais te dizer...

# SecretActions.title
source: Secret Actions
nl: Geheime Acties
pt_br: Ações secretas

# SecretActions.text
source: Feed each animal the correct food!
nl: Voer voor elk dier het juiste voedsel!
pt_br: Alimente cada animal com a comida correta!

# SecretActions.comment
source: Don't worry, they'll tell you what they like.
nl: Maak je geen zorgen, ze vertellen je wel wat ze lekker vinden.
pt_br: Não se preocupe, eles vão dizer do que gostam.

# SecretActions.Action.apples
source: Give Apples
nl: Geef Appels
pt_br: Dar maçãs

# SecretActions.Action.grass
source: Give Grass
nl: Geef Gras
pt_br: Dar grama

# SecretActions.Action.bubbles
source: Give Bubbles
nl: Geef Bubbels
pt_br: Dar bolhas

# SecretActions.Action.nectar
source: Give Nectar
nl: Geef Nectar
pt_br: Dar Néctar

# FillTheCup.title
source: Fill the Cup
nl: Vul de Beker
pt_br: Copo cheio

# FillTheCup.text
source: Fill the circles all the way up!
nl: Vul de cirkels helemaal!
pt_br: Encha os cículos até o final!

# FillTheCup.comment
source: You just need to find a way to do it
nl: Je moet gewoon een manier vinden om het te doen
pt_br: Você só tem que encontrar uma forma de fazer isso

# AColorfulMessage.title
source: A 'Colorful' Message
nl: Een 'Kleurrijk' Bericht
pt_br: Uma mensagem 'Colorida'

# AColorfulMessage.text
source: Type in the correct password!
nl: Typ het juiste wachtwoord!
pt_br: Digite a senha correta!

# AColorfulMessage.comment
source: It is a 6 digit password
nl: Het is een wachtwoord van 6 cijfers
pt_br: É uma senha de 6 dígitos

# TheUpsideDown.title
source: The Upside Down
nl: De Omgekeerde Wereld
pt_br: O mundo invertido

# TheUpsideDown.text1
source: Maybe there is a way to see it.
nl: Misschien is er een manier om het te zien.
pt_br: Talvez haja uma maneira de ver...

# TheUpsideDown.text2
source: I feel so inverted
nl: Ik voel me zo omgekeerd
pt_br: Ai, eu to tão invertida!

# SuperFriend.title
source: Super Friend
nl: Super Vriend
pt_br: Super amigo

# SuperFriend.text
source: Everyone here is so friendly,
nl: Iedereen hier is zo vriendelijk,
pt_br: Todos aqui são muito amigáveis,

# SuperFriend.comment
source: Find the person with the biggest amount of friends!
nl: Vind de persoon met de meeste vrienden!
pt_br: Encontre a pessoa com o maior número de amigos!

# SuperFriend.field
source: Super Friend name
nl: Naam Super Vriend
pt_br: Nome do super amigo

# IncreasingHints.title
source: Increasing hints
nl: Toenemende hints
pt_br: Aumentando dicass

# IncreasingHints.text
source: Can you read the hints? Use them to find the correct password.
nl: Kun je de hints lezen? Gebruik ze om het juiste wachtwoord te vinden.
pt_br: Você consegue ler as dicas? Use-as para encontrar a senha correta.

# IncreasingHints.hint1
source: It's just so tiny... I don't remember what I had to say.
nl: Het is zo klein... Ik herinner me niet wat ik moest zeggen.
pt_br: Está tudo tão pequeno... Eu não lembro o que eu ia dizer.

# IncreasingHints.hint2
source: The first hint needs to be a little bigger.
nl: De eerste hint moet iets groter zijn.
pt_br: A primeira dica precisa ser um pouco maior...

# IncreasingHints.hint3
source: The second number is 3, but maybe you can find another hints?
nl: Het tweede getal is 3, maar misschien kun je nog andere hints vinden?
pt_br: O segundo número é 3. E talvez você consiga encontrar outras dicas?

# IncreasingHints.hint4
source: The first number is 2 less than the second one.
nl: Het eerste getal is 2 minder dan het tweede.
pt_br: O primeiro número é 2 a menos que o segundo.

# IncreasingHints.hint5
source: Getting big, aren't we? The last number is 4.
nl: Wordt groot, hè? Het laatste getal is 4.
pt_br: Tá ficando grande! O último número é 4.

# IncreasingHints.hint6
source: The third number is the same as the first one.
nl: Het derde getal is hetzelfde als het eerste.
pt_br: O terceiro número é o mesmo do primeiro.

# IncreasingHints.hint7
source: The fourth number is twice the second one.
nl: Het vierde getal is twee keer het tweede.
pt_br: O quarto número é o dobro do segundo.

# IncreasingHints.hint8
source: The missing number is the same as the last one!
nl: Het ontbrekende getal is hetzelfde als het laatste!
pt_br: O número faltante é o mesmo que o último!

# IncreasingHints.unspecified
source: I'm super lost... I don't know what ot say.
nl: Ik ben helemaal de weg kwijt... Ik weet niet wat ik moet zeggen.
pt_br: Estou perdido... não sei o que dizer.

# AnAlternative.title
source: An alternative
nl: Een alternatief
pt_br: Uma alternativa

# AnAlternative.text
source: You should alternate between... something... and try to enable items in the correct order.
nl: Je moet afwisselen tussen... iets... en proberen items in de juiste volgorde in te schakelen.
pt_br: Você precisa alternar entre... alguma coisa... e ativar os elementos na ordem correta.

# doubleTapToCopy
source: Tap twice to copy
nl: Tik twee keer om te kopiëren
pt_br: Toque duas vezes para copiar

# appleDoc
source:  See more on Apple's documentation for "%@"
nl:  Zie meer in de documentatie van Apple voor "%@"
pt_br:  Veja mais na documentação da Apple para "%@"

source: Next page %@
nl: Volgende pagina %@
pt_br: Próxima página %@

source: Back to Index
nl: Terug naar Index
pt_br: Voltar ao índice

# goPlay
source: Go play it!
nl: Ga spelen!
pt_br: Vá jogar!

source: More on Wikipedia
nl: Meer op Wikipedia
pt_br: Mais na Wikipedia

source: More
nl: Meer
pt_br: Mais

source: More on the Web
nl: Meer op het web
pt_br: Veja mais na internet
