Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# Navigation.comment
source: This entire app was built to be used with VoiceOver enabled, the concept described on the pages will always be followed by an example so you can try them by yourself!
nl: Deze hele app is gebouwd om te worden gebruikt met VoiceOver ingeschakeld, het concept dat op de pagina's wordt beschreven, zal altijd worden gevolgd door een voorbeeld zodat je ze zelf kunt proberen!
pt_br: Este app foi contruído para suportar o VoiceOver, e o conceito abordado em cada página dos guias tem um exemplo implementado do tópico, então você pode usar o leitor para testar como cada coisa funciona!

# Navigation.image
source: On top is an example of the cursor. The title 'Handbook' is currently focused on the image.
nl: Boven aan de afbeelding is een voorbeeld van de cursor. De titel 'Handboek' is momenteel gericht op de afbeelding.
pt_br: Acima, um exemplo do Cursor. O título 'Handbook' está focado.

# Navigation.imageSubtitle
source: Example image of VoiceOver running on an iOS device.
nl: Voorbeeldafbeelding van VoiceOver op een iOS-apparaat.
pt_br: Exemplo do VoiceOver sendo utilizado.

# Navigation.MoveAround.title
source: Move Around
nl: Bewegen
pt_br: Movimente-se

# Navigation.MoveAround.text1
source: When VoiceOver is enabled, swipe horizontally from left to right to move the cursor to focus on the next element.
nl: Wanneer VoiceOver is ingeschakeld, veeg horizontaal van links naar rechts om de cursor te verplaatsen en te focussen op het volgende element.
pt_br: Quando o VoiceOver estiver ativado, deslize horizontalmente para mudar o focos entre os elementos.

# Navigation.MoveAround.text2
source: And swipe from right to left to focus on the previous element.
nl: En veeg van rechts naar links om te focussen op het vorige element.
pt_br: Da esquerda para a direita para o próximo, e da direita para a esquerda para o anterior.

# Navigation.Activate.title
source: Activate an element
nl: Activeer een element
pt_br: Ativar um elemento

# Navigation.Activate.text
source: Activate, is VoiceOver version of tapping an item. Double tap with a single finger to activate an element.
nl: Activeren is de VoiceOver-versie van tikken op een item. Tik tweemaal met één vinger om een element te activeren.
pt_br: Ativar, no VoiceOver, é o mesmo que clicar num item quando o leitor está desativado. Clique duas vezes com um dedo para ativar o elemento focado.

# Navigation.Activate.comment
source: You can learn more about ways to interact with elements on the 'Interaction' section
nl: Je kunt meer leren over manieren om met elementen om te gaan in de sectie 'Interactie'.
pt_br: Você pode ler mais sobre outras formas de interagir na seção 'Interação'

# Navigation.Footer.title
source: Learn more gestures
nl: Leer meer gebaren
pt_br: Aprenda mais gestos

# Navigation.Footer.text1
source: If you tap with 4 fingers twice with VoiceOver enabled, you will activate the 'Gesture Helper'.
nl: Als je met 4 vingers twee keer tikt met VoiceOver ingeschakeld, activeer je de 'Gebarenhelper'.
pt_br: Se você clicar duas vezes com 4 dedos, o VoiceOver irá ativar o 'Guia de Gestos'.

# Navigation.Footer.text2
source: Now, every gesture you make will be announced by VoiceOver, followed by it's function.
nl: Nu wordt elk gebaar dat je maakt aangekondigd door VoiceOver, gevolgd door de functie ervan.
pt_br: Agora, cada gesto executado será anunciado pelo leitor, seguido de sua função. É uma ótima forma de descobrir novas maneiras de interagir com o VoiceOver.

# Navigation.Footer.text3
source: And to disable the helper, tap twice with 4 fiongers again!
nl: En om de helper uit te schakelen, tik je nogmaals twee keer met 4 vingers!
pt_br: E para desabilitar, clique duas vezes com 4 dedos novamente!

# Navigation.Footer.comment
source: These are just a few of the gestures available. We plan on adding a full gesture section in the future, but for now, I suggest you try it for yourself, turn VoiceOver on and test the gestures using the 'Gesture Help'.
nl: Dit zijn slechts een paar van de beschikbare gebaren. We zijn van plan om in de toekomst een volledige sectie met gebaren toe te voegen, maar voor nu raad ik je aan het zelf te proberen, zet VoiceOver aan en test de gebaren met de 'Gebarenhulp'.
pt_br: Esses são apenas alguns dos gestos disponívels. Planejamos adicionar uma seção mais aprofundada com os gestos no futuro, mas por enquanto, sugerimos que você experimente usar o leitor de tela e o guia de gestos para descobrir mais!

# AccElements.title
source: Accessibility Properties
nl: Toegankelijkheidseigenschappen
pt_br: Propriedades de Acessibilidade

# AccElem.title
source: Accessibility Element
nl: Toegankelijkheidselement
pt_br: Elementos acessíveis

# AccElem.text1
source: When using VoiceOver, the cursor will focus on 'accessible' elements. These elements are identified by having the property accessibility element as 'True'.
nl: Bij het gebruik van VoiceOver zal de cursor focussen op 'toegankelijke' elementen. Deze elementen worden geïdentificeerd door de eigenschap toegankelijkheidselement als 'True'.
pt_br: Quando usando VoiceOver, o cursor vai focar em 'elementos acessíveis'. Esses elementos são identificados pela propriedade 'accessibilityElement' sendo 'True'.

# AccElem.text2
source: Every element marked with this property 'True' can be focused by VoiceOver, and the elments with the property 'False' will be ignored.
nl: Elk element dat is gemarkeerd met deze eigenschap 'True' kan worden gefocust door VoiceOver, en de elementen met de eigenschap 'False' worden genegeerd.
pt_br: Todo elemento com essa propriedade marcada como true pode ser focado pelo VoiceOver. Elementos marcados como false serão ignorados.

# AccElem.text3
source: Turn VoiceOver on and navigate through the next elements. Some will not be focused by it.
nl: Zet VoiceOver aan en navigeer door de volgende elementen. Sommige zullen niet worden gefocust door VoiceOver.
pt_br: Ligue o VoiceOver e navegue pelos próximos elementos. Alguns serão focados e outros não.

# AccElem.comment
source: It's important to set elements that should not be focused, such as separators or other elements without accessibility labels, to not be focused.
nl: Het is belangrijk om elementen die niet moeten worden gefocust, zoals scheiders of andere elementen zonder toegankelijkheidslabels, niet te laten focussen.
pt_br: É importante configurar elementos que não devem ser focados corretamente, como separadores ou elementos que não tem 'accessibility labels' como não acessíveis.

# AccElem.comment2
source: This way we prevent empty content, that could confuse the user, to be focused
nl: Op deze manier voorkomen we dat lege inhoud, die de gebruiker zou kunnen verwarren, wordt gefocust.
pt_br: Assim, prevenimos conteúdos vazios, que podem confundir o usuário, de serem focados.

# AccElem.example.isAccessibilityElement
source: This is an accessibility element.
nl: Dit is een toegankelijkheidselement.
pt_br: Este é um elemento acessível.

# AccLabel.title
source: Accessibility Label
nl: Toegankelijkheidslabel

# AccLabel.text1
source: Accessibility labels are the content that is going to be read by VoiceOver when the item is focused.
nl: Toegankelijkheidslabels zijn de inhoud die door VoiceOver wordt voorgelezen wanneer het item wordt gefocust.
pt_br: 'Accessibility label' é a propriedade que reflete o conteúdo que será lido pelo VoiceOver quando o item é focado.

# AccLabel.text2
source: Every element that is focused by VoiceOver should have an accessibility label.
nl: Elk element dat door VoiceOver wordt gefocust, moet een toegankelijkheidslabel hebben.
pt_br: Todo elemento focado pelo leitor deveria ter um 'accessibility label'.

# AccLabel.text3
source: Turn on VoiceOver and focus on the following element. The content read is it's accessibility label.
nl: Zet VoiceOver aan en focus op het volgende element. De inhoud die wordt voorgelezen, is het toegankelijkheidslabel.
pt_br: Ligue o VoiceOver e foque no elemento a seguir. O conteúdo que será lido é o seu 'accessibility label'.

# AccLabel.image
source: Starry Night, by Vincent Van Gogh. This is an accessibility label!
nl: Sterrennacht, door Vincent Van Gogh. Dit is een toegankelijkheidslabel!
pt_br: Noite estrelada, por Vincent Van Gogh. Isto é um accessibility label!

# AccLabel.comment
source: Some components automatically set their accesibility label when created, such as Texts or Buttons, but you can manually set it if necessary.
nl: Sommige componenten stellen automatisch hun toegankelijkheidslabel in bij het maken, zoals Tekst of Knoppen, maar je kunt het indien nodig ook handmatig instellen.
pt_br: Alguns componentes tem o 'accessibility label' configurado automaticamente, como labels e botoões, mas você pode configurá-los manuelmente se necessário.

# AccLabel.text4
source: And, sometimes, you can set a different accessibility label to a view, so its easier to understand its content, like describing measurement units or abreviations.
nl: En soms kun je een ander toegankelijkheidslabel instellen voor een weergave, zodat het gemakkelijker is om de inhoud te begrijpen, zoals het beschrijven van meeteenheden of afkortingen.
pt_br: E, algumas vezes, você pode configurar um 'accessibility label' diferente a uma view como forma de deixar o conteúdo mais fácil de compreender, como descrever unidades de medida ou abreviações.

# AccLabel.accessibilityLabelExample
source: 10 Kilograms
nl: 10 Kilogram
pt_br: 10 Quilos

# AccHint.title
source: Accessibility Hint
nl: Toegankelijkheidstip

# AccHint.text1
source: Accessibility hints are additional content read at the end. They are always the last content to be read.
nl: Toegankelijkheidstips zijn aanvullende inhoud die aan het einde wordt voorgelezen. Ze zijn altijd de laatste inhoud die wordt voorgelezen.
pt_br: 'Accessibility hints', ou dicas de acessibilidade, são conteúdos adicionais lidos ao final de um elemento. São sempre o último conteúdo a ser lido quando um elemento está focado.

# AccHint.text2
source: They are used to provide additional information about a focused item so the user can help better understand how it works.
nl: Ze worden gebruikt om aanvullende informatie te verstrekken over een gefocust item, zodat de gebruiker beter kan begrijpen hoe het werkt.
pt_br: São usados para prover informações adicionais sobre um elemento para que o usuário compreenda melhor o conteúdo ou como interagir com ele.

# AccHint.text3
source: For instance: You have a cell with a long press gesture (triple tap with a single finger), you may add a hint to tell the user about this additional action.
nl: Bijvoorbeeld: Je hebt een cel met een lang indrukken-gebaar (driemaal tikken met één vinger), je kunt een tip toevoegen om de gebruiker te informeren over deze aanvullende actie.
pt_br: Por exemplo: Você tem uma célula com um gesto de 'long press' (que é um toque triplo com um dedo), você pode adicionar essa informação no 'accessibility hint' desse componente para descrever essa ação adicional.

# AccHint.comment
source: Hints should be optional to read. They are left as the last element so they can be skiped if the user already knows what to do.
nl: Tips moeten optioneel zijn om te lezen. Ze staan als laatste element zodat ze kunnen worden overgeslagen als de gebruiker al weet wat te doen.
pt_br: Hints são opcionais, por isso são deixadas ao final da leitura do componente então um usuário não precisa ouvir as hints serem lidas caso ele já conheça o fluxo e sabia o que fazer.

# AccHint.example.hint
source: Tap three times to copy the order code.
nl: Tik drie keer om de bestelcode te kopiëren.
pt_br: Toque três vezes para copiar o código do seu pedido.

# AccHint.example.title
source: Your order
nl: Uw bestelling
pt_br: Seu pedido

# AccHint.example.message
source: French fries with cheese
nl: Friet met kaas
pt_br: Batata frita com queijo

# AccHint.example.notification
source: Order code copied to clipboard
nl: Bestelcode gekopieerd naar klembord
pt_br: Código copiado para área de transferência

# AccTrait.title
source: Accessibility Trait
nl: Toegankelijkheidskenmerk

# AccTrait.text1
source: Accessibility Traits are modifiers we can add to a view in order to give some additional information or add some behavior to it.
nl: Toegankelijkheidskenmerken zijn modifiers die we aan een weergave kunnen toevoegen om wat aanvullende informatie te geven of wat gedrag toe te voegen.
pt_br: 'Accessibility Traits' são modificadores que podem ser adicionados a uma view para alterar seu comportamento ou dar informação adicionar sobre seu comportamento.

# AccTrait.text2
source: There are several traits, some of them you may never have to use, and some other ones are really powerful and you'll be glad to know more about them.
nl: Er zijn verschillende kenmerken, sommige daarvan hoef je misschien nooit te gebruiken, en sommige andere zijn echt krachtig waarvan je blij zult zijn om er meer over te weten.
pt_br: Existem vários traits, alguns talvez você nunca nem precise usar, e outros são muito poderosos e importantes de se conhecer.

# AccTrait.text3
source: Traits are so important we have a dedicated section to them!
nl: Kenmerken zijn zo belangrijk dat we er een speciale sectie aan hebben gewijd!
pt_br: Na verdade, traits são tão importantes que temos uma seção dedicada só para eles!

# AccTrait.comment1
source: Make sure to check that section to learn more about each trait.
nl: Zorg ervoor dat je die sectie controleert om meer te weten te komen over elk kenmerk.
pt_br: Dê uma olhada nessa seção para ver mais sobre cada trait.

# AccTrait.text4
source: And adding a trait to a view is very simple.
nl: En het toevoegen van een kenmerk aan een weergave is heel eenvoudig.
pt_br: Adicionar um 'accessibilty trait' a uma view é muito simples.

# AccValue.title
source: Accessibility Value
nl: Toegankelijkheidswaarde

# AccValue.text1
source: Accessibility Values represent the value (most of the times numeric) associated with your view.
nl: Toegankelijkheidswaarden vertegenwoordigen de waarde (meestal numeriek) die is gekoppeld aan je weergave.
pt_br: 'Accessibility Values' representar o valor (geralmente numérico) associado com uma view.

# AccValue.text2
source: It's mostly used in components that represents quantities, like counters, sliders or quick-adds.
nl: Het wordt voornamelijk gebruikt in componenten die hoeveelheden vertegenwoordigen, zoals tellers, schuifregelaars of snelle toevoegingen.
pt_br: É mais comumente usado em elementos que representam quantidades, como contadores, sliders ou quick-adds.

# AccValue.text3
source: And when changed, if the view is focused, the new value will be announced to the user.
nl: En wanneer deze verandert, als de weergave is gefocust, wordt de nieuwe waarde aan de gebruiker aangekondigd.
pt_br: E quando alterado, com a view está focada, o novo valor será lido pelo leitor.

# AccValue.comment1
source: Check the counter example below, change its quantity and notice the 'Accessibility Value' being read.
nl: Bekijk het voorbeeld van de teller hieronder, verander de hoeveelheid en let op de 'Toegankelijkheidswaarde' die wordt voorgelezen.
pt_br: Dê uma olhada no exemplo abaixo, mude a quantidade e note o 'Accessibility Value' sendo lido pelo leitor.

# AccValue.comment2
source: This example was built using the 'Adjustable Trait'.
nl: Dit voorbeeld is gebouwd met het 'Aanpasbaar kenmerk'.
pt_br: Este é um exemplo montado usando o 'Adjustable Trait'.

# AccPriority.title
source: Accessibility Priority
nl: Toegankelijkheid Prioriteit

# AccPriority.text1
source: Accessibility Sort Priority, in SwiftUI, is a way to change the order of the elements read by VoiceOver
nl: Toegankelijkheid Sorteer Prioriteit, in SwiftUI, is een manier om de volgorde van de elementen die door VoiceOver worden voorgelezen, te wijzigen.
pt_br: 'Accessibility Sort Priority' (ou prioridade de acessibilidade), em SwiftUI, é uma forma de mudar a ordem de leitura dos elementos lidos pelo VoiceOver

# AccPriority.text2
source: It is similar to defining the order of reading the elements using UIKit, but in UIKit we define this order using an array.
nl: Het is vergelijkbaar met het definiëren van de leesvolgorde van de elementen met UIKit, maar in UIKit definiëren we deze volgorde met behulp van een array.
pt_br: No UIKit, para ter o mesmo resultado, a ordem de leitura é definida colocando os elementos na ordem correta no vetor 'accessibilityElements' da view pai.

# AccPriority.text3
source: It can be useful in some situations, check the example below:
nl: Het kan nuttig zijn in sommige situaties, bekijk het onderstaande voorbeeld:
pt_br: Alterar a ordem de leitura pode ser útil em algumas situações, dê uma olhada no exemplo abaixo:

# AccPriority.comment1
source: Yes, you can change the reading order of your elements, but most of the time you dont want to do that.
nl: Ja, je kunt de leesvolgorde van je elementen veranderen, maar meestal wil je dat niet doen.
pt_br: Sim, você pode alterar a ordem de leitura de elementos, mas a maioria das vezes não é necessário.

# AccPriority.comment2
source: As a general guideline, we keep the reading order the same as the natural reading order of the current language
nl: Als algemene richtlijn houden we de leesvolgorde hetzelfde als de natuurlijke leesvolgorde van de huidige taal
pt_br: De maneira geral, a ordem de leitura recomendada é a ordem de leitura natural da língua selecionada no VoiceOver.

# AccPriority.comment3
source: For instance, English reads from left-to-right then from top-to-bottom, and thats the order VoiceOver will try to read the content.
nl: Bijvoorbeeld, Engels leest van links naar rechts en vervolgens van boven naar beneden, en dat is de volgorde die VoiceOver zal proberen om de inhoud voor te lezen.
pt_br: Por exemplo, em Português, o VoiceOver lê o conteúdo da esquerda para a direita e de cima para baixo. Que já é o comportamento padrão do VoiceOver

# AccPriority.notification
source: See how this button even being above the elements, was the last one being focused?.
nl: Zie hoe deze knop, ook al staat hij boven de elementen, de laatste was die werd gefocust?
pt_br: Viu como esse botão foi focado depois dos outros elementos, mesmo estando acima deles?

# AccPriority.Code.uikitComment
source: The content is read in the array's order
nl: De inhoud wordt voorgelezen in de volgorde van de array
pt_br: O conteúdo é lido na ordem colocada no vetor.

# AccPriority.Code.swiftUIComment
source: The highest priority is read first
nl: De hoogste prioriteit wordt eerst voorgelezen
pt_br: A maior prioridade é lida primeiro

# AccTraits.title
source: Accessibility Traits
nl: Toegankelijkheidskenmerken

# ListOfTraits.title
source: List of Accessibility Traits
nl: Lijst van Toegankelijkheidskenmerken
pt_br: Lista de Accessibility Traits

# ListOfTraits.text1
source: Here's a full list of accessibility traits. Some of them are further discussed on this app
nl: Hier is een volledige lijst van toegankelijkheidskenmerken. Sommige ervan worden verder besproken in deze app
pt_br: Aqui uma lista completa dos accessibility traits. Alguns tem uma página de discussão dedicada no app.

# ListOfTraits.comment1
source: Since I think they are the most important ones and I actually have something to talk about. (Or I just didn't have the time yet to write something nice about this trait)
nl: Omdat ik denk dat ze de belangrijkste zijn en ik er eigenlijk iets over te zeggen heb. (Of ik heb gewoon nog geen tijd gehad om iets moois te schrijven over dit kenmerk)
pt_br: Porque eu acho que são os mais importantes (ou os únicos que eu tive tempo / conteúdo suficiente pra fazer uma página dedicada sobre)

# ListOfTraits.text2
source: Others are more obvious about how they should work, and where they should be used.
nl: Andere zijn duidelijker over hoe ze zouden moeten werken en waar ze zouden moeten worden gebruikt.
pt_br: Outros são um pouco mais óbvios do que fazem, onde devem ser usados e como funcionam.

# ListOfTraits.comment2
source: But make sure to check all of their documentations!
nl: Maar zorg ervoor dat je al hun documentatie controleert!
pt_br: Mas dê uma olhadinha sim na documentação de cada um!

# ListOfTraits.button
source: Tells that the item is a button - can be activated with a double tap.
nl: Geeft aan dat het item een knop is - kan worden geactiveerd met een dubbele tik.
pt_br: Marca um elemento como sendo um botão, o que basicamente significa que ele pode ser ativado com um duplo clique.

# ListOfTraits.adjustable
source: Allows gestures to update quantities. This is quite useful in some situations like quick-adds, sliders or counters!
nl: Maakt gebaren mogelijk om hoeveelheden bij te werken. Dit is behoorlijk nuttig in sommige situaties zoals snelle toevoegingen, schuifregelaars of tellers!
pt_br: Adiciona gestos para alterar quantidades. É bem útil em elementos como sliders, contadores ou quick-adds.

# ListOfTraits.header
source: A header that can be focused with rotor function. Indicates the begining of a new section.
nl: Een koptekst die kan worden gefocust met een rotorfunctie. Geeft het begin van een nieuwe sectie aan.
pt_br: Um 'header' (título) pode ser focado com o Rotor, e indica o começo de uma nova seção no conteúdo.

# ListOfTraits.link
source: A link to a web page
nl: Een link naar een webpagina
pt_br: Um link para uma página na internet

# ListOfTraits.image
source: An image. It may not seem, but its important to use when actually focusing on an image. The user may want to share the image with someone, or print screen it to ask more later...
nl: Een afbeelding. Het lijkt misschien niet zo, maar het is belangrijk om te gebruiken bij het daadwerkelijk focussen op een afbeelding. De gebruiker wil de afbeelding mogelijk delen met iemand, of er later meer over vragen...
pt_br: Uma imagem. Pode não parecer, mas é importante quando focado numa imagem que ele tenha esse trait, um deficiente visual pode analisar o conteúdo da imagem com o próprio VoiceOver caso tenha algo escrito, ou até mesmo tirar um print da tela para mostrar para alguém.

# ListOfTraits.searchField
source: Allows typing and when finished will search for something.
nl: Maakt typen mogelijk en zoekt wanneer het is voltooid naar iets.
pt_br: É um campo de busca. Permite digitar conteúdo e inicia uma pesquisa.

# ListOfTraits.keyboardKey
source: A keyboard key. (Probably not very relevant if you are not creating a custom keyboard)
nl: Een toets van het toetsenbord. (Waarschijnlijk niet erg relevant als je geen aangepast toetsenbord maakt)
pt_br: Uma tecla de teclado. Provavelmente não é muito relevante a não ser que você esteja implementando um teclado customizado

# ListOfTraits.staticText
source: A text that does not change
nl: Een tekst die niet verandert
pt_br: Apenas um texto.

# ListOfTraits.tabbar
source: A tabbar item, actually very important if you have a custom tabbar!
nl: Een tabbladitem, eigenlijk erg belangrijk als je een aangepaste tabbalk hebt!
pt_br: Um ícone da TabBar.

# ListOfTraits.summaryElement
source: "The accessibility element provides summary information when the app starts."
nl: "Het toegankelijkheidselement geeft samenvattende informatie wanneer de app start."
pt_br: "Um elemento acessível que provê informações quando o app abre."

# ListOfTraits.selected
source: A selected item - used when there are more items on a list that can be selected as well (segmented controllers, radio buttons…)
nl: Een geselecteerd item - wordt gebruikt wanneer er meer items op een lijst zijn die ook kunnen worden geselecteerd (segmentcontrollers, radioknoppen...)
pt_br: Um item selecionado - usado quando existem mais itens que podem ser selecionados (como segmented controllers, radio buttons...)
