Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# title
source: Accessibility Handbook
nl: Toegankelijkheids handboek
pt_br: Handbook de Acessibilidade

source: Handbook
nl: Handboek

source: Search
nl: Zoeken
pt_br: Pesquisar

source: Share page
nl: Pagina delen
pt_br: Compartilhar página

# Search.Empty.title
source: No results could be found
nl: Geen resultaten gevonden
pt_br: Nenhum resultado encontrado

# Search.Empty.message
source: Try changing your search!
nl: Probeer je zoekopdracht te wijzigen!
pt_br: Tente mudar a sua pesquisa!

# Search.Empty.action
source: Search all pages
nl: Doorzoek alle pagina's
pt_br: Pesquisar em todas as páginas

# Home.developmentGuides
source: Development Guides
nl: Ontwikkelingshandleidingen
pt_br: Guia de Desenvolvimento

# Home.handbookGame
source: The Handbook Game
nl: Het Handboekspel
pt_br: Jogos do Handbook

# Home.handbookGameDescription
source: Test your accessibility knowledge in a series of puzzles!
nl: Test je kennis van toegankelijkheid met een reeks puzzels!
pt_br: Teste seu conhecimento de acessibilidade com uma série de jogos!

# Home.dynamicFonts
source: Dynamic Fonts
nl: Dynamische Lettertypen
pt_br: Fontes dinâmicas

# Home.otherFeatures
source: Other Features
nl: Andere Functies
pt_br: Outras features

# Home.collaborate
source: Collaborate
nl: Samenwerken
pt_br: Colabore

# Home.shortcuts
source: Shortcuts
nl: Sneltoetsen
pt_br: Atalhos

# Home.colors
source: Colors
nl: Kleuren
pt_br: Cores

# Home.notifications
source: Notify
nl: Meldingen
pt_br: Notificar

# WhatsNew.title
source: What's new on the app?
nl: Wat is nieuw in de app?
pt_br: O que há de novo no app?

# WhatsNew.seeTheReleaseNotes
source: See the release notes on GitHub for version %@
nl: Bekijk de release-opmerkingen op GitHub voor versie %@
pt_br: Veja o 'release notes' no GitHub %@

# WhatsNew.version
source: Version %@
nl: Versie %@
pt_br: Versão %@

# WhatsNew.currentVersion
source: Current Version %@
nl: Huidige versie %@
pt_br: Versão autal %@

# WhatsNew.1_1_0.description
source: New Brazilian Protuguese translation 🇧🇷! And new syntax highlight on the code examples.
nl: Nieuwe vertaling naar het Braziliaans Portugees 🇧🇷! En nieuwe syntax highlighting in de codevoorbeelden.
pt_br: Agora disponível em Português do Brasil 🇧🇷! E novo sistema de 'syntax highlight' nos exemplos de código.

# WhatsNew.1_2_0.description
source: New Gestures and Dynamic font guides.
nl: Nieuwe handleidingen voor gebaren en dynamische lettertypen.
pt_br: Novos guias de gestos e fontes dinâmicas.

# WhatsNew.1_3_0.description
source: New Puzzles! New reduce motion guide. And a new dynamic font page about how to identify the preferred font size.
nl: Nieuwe puzzels! Nieuwe handleiding voor het verminderen van beweging. En een nieuwe pagina over dynamische lettertypen over hoe je de voorkeursgrootte van het lettertype kunt identificeren.
pt_br: Novo jogo! Novo guia de reduzir animações. E nova página de fontes dinâmicas.

# WhatsNew.1_4_0.description
source: New Dark mode guide!
nl: Nieuwe handleiding voor de donkere modus!
pt_br: Novo guia de Modo escuro!

# WhatsNew.1_5_0.description
source: New visual aid section on the 'Others Features' New image accessibility trait page.
nl: Nieuwe visuele hulpmiddelen in het gedeelte 'Andere functies' Nieuwe pagina over toegankelijkheid van afbeeldingen.
pt_br: Nova seção de ajudas visuais. Nva página de imagens.

# WhatsNew.1_6_0.description
source: New 'What's new on the app' page to help users find new content they have not yet seen. Search improvements, now the search content is alphabetically sorted with the respective section icon on each page. New share and deeplinking capability on the app - now you can share every page with anyone and they can open them using the direct link! And new accessibility trait pages.
nl: Nieuwe pagina 'Wat is nieuw in de app' om gebruikers te helpen nieuwe inhoud te vinden die ze nog niet hebben gezien. Zoekverbeteringen, nu is de zoekinhoud alfabetisch gesorteerd met het respectieve sectiepictogram op elke pagina. Nieuwe mogelijkheden voor delen en deeplinken in de app - nu kun je elke pagina delen met iedereen en kunnen ze deze openen met de directe link! En nieuwe pagina's over toegankelijkheidskenmerken.
pt_br: Novo 'O que há de novo no app?' para ajudar usuários a encontrar conteúdos que eles ainda não viram. A pesquisa agora é ordenada alfabeticamente, com os ícones de cada respectiva seção. Novo compartilhamento de página por deeplink - agora você pode compartilhar conteúdos com links que podem ser abertos por qualquer um! E novas páginas de traits de acessibilidade.

# WhatsNew.1_7_0.description
source: New Home Screen layout for iPads and iPhones in landscape! Now we are using better the available size on the screen for both formats. And a brand new Rotor example page where you can try using custom rotors for yourself.
nl: Nieuw lay-out voor het startscherm voor iPads en iPhones in liggende modus! We gebruiken nu beter de beschikbare ruimte op het scherm voor beide formaten. En een gloednieuwe pagina met rotorvoorbeelden waar je kunt proberen aangepaste rotors zelf te gebruiken.
pt_br: Novo layout da página inicial para iPads! E uma nova página de exemplos de Rotores! Agora você pode testar usar rotores customizados.

# UsingTheVoiceOver
source: Using VoiceOver
nl: Gebruik VoiceOver
pt_br: Usando o VoiceOver

# EnableVoiceOver.title
source: Enable VoiceOver
nl: VoiceOver inschakelen
pt_br: Ativando o VoiceOver

# EnableVoiceOver.text1
source: VoiceOver is the name of the iOS's native screen reader solution. Used to provide visual impairment accessibility.
nl: VoiceOver is de naam van de ingebouwde schermlezer van iOS. Gebruikt om toegankelijkheid te bieden voor mensen met een visuele beperking.
pt_br: VoiceOver é o nome do leitor de tela nativo do iOS. Usado para prover acessibilidade para deficientes visuais.

# EnableVoiceOver.text2
source: To enable VoiceOver, go to the device's settings, on the 'Accessibility section'.
nl: Om VoiceOver in te schakelen, ga naar de instellingen van het apparaat, naar het gedeelte 'Toegankelijkheid'.
pt_br: Para ativar o VoiceOver, vá nas configurações do seu dispositivo na seção de Acessibilidade.

# EnableVoiceOver.text3
source: Then, navigate to VoiceOver and turn the toggle on.
nl: Navigeer vervolgens naar VoiceOver en schakel de schakelaar in.
pt_br: Então, vá até a seção de VoiceOver e ligue a chave.

# EnableVoiceOver.text4
source: As an alternative to doing this every time you want to enable VoiceOver, you may navigate to the Accessibility section again, and change the 'Accessibility shortcut' section.
nl: Als alternatief voor het telkens inschakelen van VoiceOver, kun je opnieuw naar het gedeelte 'Toegankelijkheid' gaan en de sectie 'Toegankelijkheidssnelkoppeling' wijzigen.
pt_br: Como alternativa a fazer isso toda vez que você quiser ativar o leitor de tela, você pode ir na seção de 'Atalhos de Acessibilidade'.

# EnableVoiceOver.text5
source: There, select the features you want to have quick-access to (make sure to select VoiceOver)
nl: Selecteer daar de functies waar je snel toegang toe wilt hebben (zorg ervoor dat je VoiceOver selecteert)
pt_br: Lá, selecione quais opções você quer ter acesso rápido. Não se esqueça de selecionar o VoiceOver.

# EnableVoiceOver.text6
source: And now, you can access any of those features by triple-pressing the side button on your device (the one that locks the screen).
nl: En nu kun je toegang krijgen tot een van die functies door driemaal op de zijknop van je apparaat te drukken (degene waarmee je het scherm vergrendelt).
pt_br: E agora, você pode acessar quaisquer uma dessas features clicando três vezes no botão lateral do seu dispositivo (o botão que trava a tela).

# EnableVoiceOver.comment
source: Beyond providing faster access to turning VoiceOver on, it also helps to turn it off if you get stuck while using the it.
nl: Naast het bieden van snellere toegang tot het inschakelen van VoiceOver, helpt het ook om het uit te schakelen als je vastloopt tijdens het gebruik ervan.
pt_br: Além de dar um acesso rápido, ele também ajuda a desligar o VoiceOver rapidamente caso você fique travado em alguma coisa enquanto ele está ativado.

# ElementReadingOrder.title
source: Element reading order
nl: Element leesvolgorde
pt_br: Ordem de Leitura

# ElementReadingOrder.text1
source: VoiceOver will read the content on the screen trying to follow the 'Natural reading direction of the Language'
nl: VoiceOver zal de inhoud op het scherm proberen voor te lezen volgens de 'natuurlijke leesrichting van de taal'
pt_br: O VoiceOver lê o conteúdo na tela seguindo a 'ordem de leitura natural da língua do dispositivo'

# ElementReadingOrder.comment1
source: What does it mean?
nl: Wat betekent dit?
pt_br: O quê?

# ElementReadingOrder.text2
source: For instance, English, the natural reading directions is left-to-right then up-to-down
nl: Bijvoorbeeld, in het Engels is de natuurlijke leesrichting van links naar rechts en vervolgens van boven naar beneden
pt_br: Por exemplo, em Português, a ordem de leitura é da esquerda para a direita, e de cima para baixo. Já em japonês é da direita para a esquerda e de cima para baixo.

# ElementReadingOrder.text3
source: So the Voice Over will follow this same order when reading the content.
nl: Dus VoiceOver zal dezelfde volgorde volgen bij het voorlezen van de inhoud.
pt_br: Então, o leitor irá seguir, ou pelo menos tentar, essa mesma ordem enquanto lê o conteúdo.

# ElementReadingOrder.comment2
source: You can change the reading order of your elements... if you want...
nl: Je kunt de leesvolgorde van je elementen veranderen... als je dat wilt...
pt_br: Você pode mudar a ordem de leitura dos elementos, se você quiser.

# ElementReadingOrder.link
source: Check the 'Accessibility Priority' page for more informations
nl: Raadpleeg de pagina 'Toegankelijkheidsprioriteit' voor meer informatie
pt_br: Olhe a página 'Accessibility Priority' para mais informações

# ElementReadingOrder.text4
source: But when we are talking about a single focused element (the element the cursor is currently at)
nl: Maar als we het hebben over een enkel gefocust element (het element waar de cursor momenteel op staat)
pt_br: E quando estamos falando de apenas um elemento focado (Onde o cursor está focado no momento)

# ElementReadingOrder.text5
source: The content will be read in the following order:
nl: Dan wordt de inhoud in de volgende volgorde voorgelezen:
pt_br: O conteúdo desse elemento será lido na seguinte ordem:

# Rotor.comment1
source: The Rotor is one of those things I think not everybody knows about.
nl: De Rotor is een van die dingen waarvan ik denk dat niet iedereen er vanaf weet.
pt_br: O Rotor é esse tipo de coisa que parece que ninguém conhece direito.

# Rotor.text1
source: If you do the gesture of a circle with 2 fingers on the screen, you will enable the rotor.
nl: Als je het gebaar van een cirkel maakt met 2 vingers op het scherm, schakel je de rotor in.
pt_br: Se você fizer um gesto de um cículo com 2 dedos na tela, você vai ativar o Rotor.

# Rotor.comment2
source: Turn VoiceOver on and try it for yourself!
nl: Zet VoiceOver aan en probeer het zelf!
pt_br: Ligue o VoiceOver e tente ativar o rotor agora mesmo!

# Rotor.text2
source: The rotor has some default actions to it like changing the speaking rate or VoiceOver's language.
nl: De rotor heeft enkele standaardacties, zoals het wijzigen van de spreeksnelheid of de taal van VoiceOver.
pt_br: O Rotor têm algumas ações padrão, como mudar a velocidade de leitura ou a língua do leitor.

# Rotor.text3
source: You can also create custom actions to the rotor. The idea is to use it to help users find specific content, like filtering for links, or any other similar elements.
nl: Je kunt ook aangepaste acties aan de rotor toevoegen. Het idee is om het te gebruiken om gebruikers te helpen specifieke inhoud te vinden, zoals filteren op links of andere vergelijkbare elementen.
pt_br: Você também pode criar açõoes customizadas para o Rotor. A ideia é que isso ajude o usuário a encontrar conteúdos específicos, como filtrando por links na sua tela, ou qualquer conteúdo semelhante, permitindo que o usuário navegue apenas nesse itens selecionados no Rotor.

# Rotor.comment3
source: Use the page below to test using Custom rotor items!
nl: Gebruik de onderstaande pagina om het gebruik van aangepaste rotoritems te testen!
pt_br: Use a página abaixo para testar o Rotor com ações customizadas!

# Rotor.openExample
source: Open example page with custom Rotors.
nl: Open voorbeeldpagina met aangepaste rotors.
pt_br: Abrir exemplo

# Rotor.image
source: Rotor example image
nl: Voorbeeld van de rotor
pt_br: Exemplo do Rotor ativado

# RotorExample.title
source: Rotor Example
nl: Voorbeeld van de rotor
pt_br: Exemplo de Rotor

# RotorExample.text1
source: This page contains custom rotor items: Images, Notes, History and Links
nl: Deze pagina bevat aangepaste rotoritems: Afbeeldingen, Notities, Geschiedenis en Links
pt_br: Esta página contém ites customizados no rotor: Images, Notas, História e Links.

# RotorExample.text2
source: Select the desired option on the Rotor, then, swipe up and down to select only the desired content.
nl: Selecteer de gewenste optie op de rotor en veeg vervolgens omhoog en omlaag om alleen de gewenste inhoud te selecteren.
pt_br: Selecione a opção desejada no rotor, então, deslize para cima e para baixo para filtrar apenas pelo conteúdo selecionado.

# RotorExample.text3
source: This is a nice example on how to use rotors to provide easier ways to filter and find content.
nl: Dit is een mooi voorbeeld van hoe je rotors kunt gebruiken om gemakkelijker inhoud te filteren en te vinden.
pt_br: Este é um bom exemplo de como usar os rotores para filtrar conteúdo nas suas páginas, e prover maneiras mais fáceis de encontrar o que se está procurando.

# RotorExample.images
source: Images
nl: Afbeeldingen
pt_br: Imagens

# RotorExample.history
source: History
nl: Geschiedenis
pt_br: História

# RotorExample.notes
source: Notes
nl: Notities
pt_br: Notas

# RotorExample.history1
source: Vincent Van Gogh was a Dutch painter born in March 1853. He's considered one of the most influential painters in all history, although, this recognition only came after his death.
nl: Vincent Van Gogh was een Nederlandse schilder geboren in maart 1853. Hij wordt beschouwd als een van de invloedrijkste schilders in de geschiedenis, hoewel deze erkenning pas na zijn dood kwam.
pt_br: Vincent Van Gogh foi um pintor Holandês nascido em Março de 1853. Ele é considerado um dos pintores mais influentes da história, apesar de ter sido reconhecido apenas depois da sua morte.

# RotorExample.history2
source: He did not start his life as a painter, and only started painting around 1880. And was introduced in Paris to the "Impressioninsm".
nl: Hij begon zijn leven niet als schilder en begon pas rond 1880 te schilderen. Hij werd in Parijs geïntroduceerd in het 'Impressionisme'.
pt_br: Ele não começou sua carreira como pintor, e apenas começou a pintar por volta de 1880. E, quando em Paris, foi introduzido ao "Impressionismo".

# RotorExample.vanGoghImage
source: Self portrait, by Vincent Van Gogh.
nl: Zelfportret, door Vincent Van Gogh.
pt_br: Auto retrato, por Vincent Van Gogh.

# RotorExample.note1
source: Impressionism is the name of a 19th century artistic movement. In painting, characterized by relatively small, thin, yet visible brush strokes, open composition, emphasis on accurate depiction of light in its changing qualities, ordinary subject matter, unusual visual angles, and inclusion of movement as a crucial element of human perception and experience.
nl: Impressionisme is de naam van een artistieke beweging uit de 19e eeuw. In de schilderkunst wordt het gekenmerkt door relatief kleine, dunne, maar zichtbare penseelstreken, een open compositie, nadruk op een nauwkeurige weergave van licht in zijn veranderende kwaliteiten, alledaags onderwerp, ongebruikelijke visuele hoeken en de inclusie van beweging als een cruciaal element van menselijke waarneming en ervaring.
pt_br: O impressionismo foi um movimento que surgiu na pintura francesa do século XIX, vivia-se nesse momento a chamada Belle Époque ou Bela Época em português.

# RotorExample.link1
source: Impressionism
nl: Impressionisme
pt_br: Impressionismo

# RotorExample.history3
source: One of his paintings 'The Starry Night', was painted around 1889, is today one of the most famous paintings in the entire world.
nl: Een van zijn schilderijen, 'De Sterrennacht', geschilderd rond 1889, is vandaag een van de beroemdste schilderijen ter wereld.
pt_br: Uma de suas pinturas, a 'Noite estrelada', foi pintada por volta de 1889, e é hoje uma das pinturas mais famosas no mundo todo.

# RotorExample.starryNight
source: Starry night, by Vincent Van Ghog.
nl: Sterrennacht, door Vincent Van Gogh.
pt_br: A noite estrelada, por Vincent Van Ghog.

# RotorExample.note2
source: It depicts the view from the east-facing window of his asylum room at Saint-Rémy-de-Provence, just before sunrise, with the addition of an imaginary village.
nl: Het toont het uitzicht vanuit het oostelijk gelegen raam van zijn asielkamer in Saint-Rémy-de-Provence, vlak voor zonsopgang, met de toevoeging van een denkbeeldig dorp.
pt_br: Ela mostra a vista de uma janela virada para o leste no seu quarto do asilo, logo antes do amanhecer, com a adição de uma vila imaginária.

# RotorExample.link2
source: The Starry Night
nl: De Sterrennacht
pt_br: A Noite estrelada

# RotorExample.history4
source: And another famous paintings, are the series of 'Sunflowers'. Two collection of paintings depicting sunflowers, and recognized by style and bright colors.
nl: En een ander beroemd werk zijn de serie 'Zonnebloemen'. Twee collecties schilderijen met zonnebloemen, herkenbaar aan stijl en felle kleuren.
pt_br: E outra de suas pinturas mais famosas, faz parte de uma série 'Girassóis'. Duas coleções de pinturas mostrando girassóis, e reconhecida tanto por estilo e pelas cores do pintor.

# RotorExample.sunflower
source: Sunflower, by Vincent Van Gogh.
nl: Zonnebloem, door Vincent Van Gogh.
pt_br: Girassóis, por Vincent Van Gogh.

# RotorExample.note3
source: The first series, executed in Paris in 1887, depicts the flowers lying on the ground, while the second set, made a year later in Arles, shows a bouquet of sunflowers in a vase.
nl: De eerste serie, uitgevoerd in Parijs in 1887, toont de bloemen op de grond, terwijl de tweede serie, een jaar later gemaakt in Arles, een boeket zonnebloemen in een vaas laat zien.
pt_br: A primeira coleção, executada em Paris 1887, mostra as flores no chão, já a segunda parte, pintada depois em Arles, mostra um buquê de flores num vaso.

# RotorExample.link3
source: Sunflowers
nl: Zonnebloemen
pt_br: Girassóis

# RotorAndHeaders.title
source: Rotor and Headers
nl: Rotor en Kopteksten
pt_br: Rotor + Títulos

# RotorAndHeaders.Rotor.text
source: If you haven't seen it yet, check our Rotor page to learn more about this component!
nl: Als je het nog niet hebt gezien, bekijk dan onze Rotor-pagina om meer te weten te komen over dit onderdeel!
pt_br: Se você não viu ainda, dê uma olhada na página do Rotor para ver mais sobre esse componente!

# RotorAndHeaders.Header.text1
source: The accessibility trait 'header' is important to mark the beggining of a new content section, but also its important to notice how it affects the user's navigation with the Rotor.
nl: Het toegankelijkheidskenmerk 'header' is belangrijk om het begin van een nieuwe inhoudssectie te markeren, maar het is ook belangrijk om op te merken hoe het de navigatie van de gebruiker met de Rotor beïnvloedt.
pt_br: O accessibility trait 'header' é importante para marcar o começo de uma seçãod e conteúdo nova, mas, além disso, é importante notar como isso afeta a forma com que o usuário pode navegar nas páginas usando o Rotor.

# RotorAndHeaders.Header.text2
source: If you haven't seen the 'Header Trait page', take a look to leanr more about it!
nl: Als je de pagina 'Header Kenmerk' nog niet hebt gezien, bekijk deze dan om er meer over te leren!
pt_br: Se você não viu a página do trait 'Header', dê uma olhada para aprender mais sobre!

# RotorAndHeaders.Together.title
source: What about them together?
nl: Wat als we ze samen gebruiken?
pt_br: Mas o que tem esses dois juntos?

# RotorAndHeaders.Together.text1
source: If you enable the rotor, you may notice it has the 'Header' options
nl: Als je de rotor inschakelt, merk je misschien dat deze de 'Header'-opties heeft
pt_br: Se você ativar o rotor, você vai notar a opção 'Headers/Títulos'

# RotorAndHeaders.Together.text2
source: When selected, this option will allow you to navigate only on headers by swiping up and down on your device.
nl: Wanneer geselecteerd, stelt deze optie je in staat om alleen op kopteksten te navigeren door omhoog en omlaag te vegen op je apparaat.
pt_br: Quando selecionada, essa opção permite o usuário navegar apenas nos componentes marcados como header, através do gesto de deslizar para cima e para baixo na tela.

# RotorAndHeaders.Together.text3
source: This is extremely useful to find specific content among many other things.
nl: Dit is buitengewoon handig om specifieke inhoud te vinden te midden van veel andere dingen.
pt_br: Isso é extremamente útim para encontrar seções específicas no meio de muito conteúdo.

# RotorAndHeaders.Example.text1
source: If you haven't noticed, this page was built using some headers!
nl: Als je het niet hebt opgemerkt, is deze pagina gebouwd met behulp van enkele kopteksten!
pt_br: Caso você não tenha notado, essa página foi feita usando títulos.

# RotorAndHeaders.Example.text2
source: Turn on VoiceOver and try to navigate only on them!
nl: Zet VoiceOver aan en probeer er alleen op te navigeren!
pt_br: Ligue o VoiceOver e tente navegar neles!

# Navigation.title
source: Navigation
nl: Navigatie
pt_br: Navegação

# Navigation.gesturesLink
source: Open the gestures guide.
nl: Open de gebarenhandleiding.
pt_br: Abrir guia de gestos.

# Navigation.text1
source: VoiceOver navigation is based in gestures. Each gesture, can be perfomed anywhere on the screen, and will trigger a certain action.
nl: Navigatie met VoiceOver is gebaseerd op gebaren. Elk gebaar kan overal op het scherm worden uitgevoerd en zal een bepaalde actie activeren.
pt_br: A navegação do VoiceOver é baseada em gestos. Cada gesto pode ser feito em qualquer lugar da tela e vai disparar uma ação específica.

# Navigation.text2
source: Once enabled, VoiceOver will display a frame on top of the current view that is being read. This frame is called 'Cursor'.
nl: Eenmaal ingeschakeld, toont VoiceOver een kader bovenop het huidige weergavegebied dat wordt voorgelezen. Dit kader wordt 'Cursor' genoemd.
pt_br: Quando ativado, o leitor vai mostrar um marcador em cima de qual view ele está focado. Este marcador é chamado 'Cursor'.

# Navigation.text3
source: To navigate basically means changing the cursor's position, so it will read another element.
nl: Navigeren betekent in feite de positie van de cursor wijzigen, zodat een ander element wordt voorgelezen.
pt_br: Navegar, basicamente significa mudar a posição do cursor, para que ele leia outro elemento.

# Navigation.text4
source: The basic navigation can be done swiping horizontally on the screen to move to cursor to the next or previous element.
nl: De basisnavigatie kan worden uitgevoerd door horizontaal over het scherm te vegen om de cursor naar het volgende of vorige element te verplaatsen.
pt_br: Para ir para o próximo elemento, basta deslizar o dedo horizontalmente na tela da esquerda para a direito, e para voltar, da direita para a esquerda.
