Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# InvertColors.Example.text1
source: Change the display appearance from light/dark mode and the color inversion setting and check the images below.
nl: Wijzig de weergavestand van lichte/donkere modus en de kleurinversie-instelling en controleer de onderstaande afbeeldingen.
pt_br: Altere o seu display entre light/dark mode e ative e desative a inversão de cores nas configurações do seu dispositivo e veja o comportamento das imagens abaixo.

# InvertColors.Example.image1
source: Starry night, by Van Gogh
nl: Sterrennacht, door Van Gogh
pt_br: Noite estrelada, por Van Gogh

# InvertColors.Example.image2
source: Starry night, by Van Gogh. Image does not invert.
nl: Sterrennacht, door Van Gogh. Afbeelding wordt niet omgekeerd.
pt_br: Noite estrelada, por Van Gogh. Esta imagem está marcada para não ser invertida.

# InvertColors.Example.comment
source: Only the second image is set to not invert colors.
nl: Alleen de tweede afbeelding is ingesteld om kleuren niet om te keren.
pt_br: Apenas a segunda imagem está marcada para não ser invertida.

# HeaderTrait.title
source: Header Trait
nl: Koptrekken

# HeaderTrait.text1
source: The Header trait is used to describe headers (obviously), which indicates the beggining of a new content section.
nl: Het koptrekken wordt gebruikt om koppen te beschrijven (uiteraard), wat het begin van een nieuwe inhoudssectie aangeeft.
pt_br: O trait de Header (ou título) é usado para marcar títulos, que indicam uma nova seção de conteúdo.

# HeaderTrait.comment1
source: So... that's all?
nl: Dus... is dat alles?
pt_br: Só isso?

# HeaderTrait.text2
source: The fun part, is that you can navigate only on headers by using the rotor function.
nl: Het leuke is dat je alleen kunt navigeren op koppen door de rotorfunctie te gebruiken.
pt_br: A parte legal, é que você pode navegar apenas nos headers usando o Rotor.

# HeaderTrait.link
source: Check the Rotor and Header page!
nl: Bekijk de Rotor en Header-pagina!
pt_br: Mais sobre Rotores

# HeaderTrait.text3
source: This way, you can skip every content that is not a header, and easily find the section you are looking for.
nl: Op deze manier kun je elke inhoud overslaan die geen kop is en eenvoudig de sectie vinden waar je naar op zoek bent.
pt_br: Dessa forma, você pode passar todo o conteúdo até encontrar a seção que você procura.

# IncreaseContrast.title
source: Increase Contrast
nl: Verhoog het Contrast
pt_br: Aumentar contraste

# IncreaseContrast.Intro.text1
source: Another accessibility option the user can enable on the device's settings.
nl: Een andere toegankelijkheidsoptie die de gebruiker kan inschakelen in de instellingen van het apparaat.
pt_br: Outra opção de acessibilidade que pode ser ativada nas configurações do seu dispositivo.

# IncreaseContrast.Intro.text2
source: This one is also kinda obvious, the user is requesting to enhance contrast between foreground and background colors, so it gets easier to distinguish between them.
nl: Deze is ook vrij voor de hand liggend: de gebruiker vraagt om het contrast tussen voorgrond- en achtergrondkleuren te verbeteren, zodat het gemakkelijker wordt om ze van elkaar te onderscheiden.
pt_br: O nome meio que já entrega, quando ativada, o usuário está pedindo que o contraste aumente entre o seu conteúdo e o plano de fundo, de forma que seja mais fácil de distinguir entre eles.

# IncreaseContrast.Property.title
source: Handling contrast changes
nl: Omgaan met contrastveranderingen
pt_br: Tratando mudanças de contraste

# IncreaseContrast.Property.text1
source: An easy way to support this is by using 'System Colors'. They will automatically adapt to the increase contrast.
nl: Een eenvoudige manier om dit te ondersteunen is door 'System Colors' te gebruiken. Ze passen zich automatisch aan aan het verhoogde contrast.
pt_br: Uma forma simples de suportar isso é usandoa s cores do sistema. Elas vão alterar automaticament quando essa opção for alterada.

# IncreaseContrast.Property.comment1
source: This app was built using system colors! Change the contrast options on your device's settings and check the differences!
nl: Deze app is gebouwd met behulp van systeemkleuren! Verander de contrastopties in de instellingen van je apparaat en bekijk de verschillen!
pt_br: Este app foi contruído usando cores do sistema! Mude suas opções de contraste e veja as diferenças!

# IncreaseContrast.Property.text2
source: Or you can use the 'UIAccessibility.accessibilityDisplayShouldIncreaseContrast' boolean to check the current contrast state, and act accordingly.
nl: Of je kunt de boolean 'UIAccessibility.accessibilityDisplayShouldIncreaseContrast' gebruiken om de huidige contraststatus te controleren en dienovereenkomstig te handelen.
pt_br: Ou você pode usar o 'UIAccessibility.accessibilityDisplayShouldIncreaseContrast' booleano para verificar o estado atual dessa opção.

# IncreaseContrast.swiftUI.text1
source: And in SwiftUI, there is a neat contrast tool you can use to change the contrast on your views
nl: En in SwiftUI is er een handige contrasttool die je kunt gebruiken om het contrast op je weergaven te wijzigen
pt_br: E em SwiftUI, existe um modificador muito interessante que altera o contraste de suas views.

# IncreaseContrast.swiftUI.comment1
source: Not that I have really used this contrast tool in any real project.
nl: Niet dat ik deze contrasttool echt heb gebruikt in een echt project.
pt_br: Não que eu já tenha usado ela na vida real, mas ainda assim é bem interessante.

# IncreaseContrast.example
source: Example of using the contrast tool. There are 6 images with increasing contrast.
nl: Voorbeeld van het gebruik van de contrasttool. Er zijn 6 afbeeldingen met toenemend contrast.
pt_br: Exemplo de uso do modificador de contrast. São 6 imagens onde o contraste aumente progressivamente.

# Haptic.text1
source: Haptics are little vibrations the device can make
nl: Haptiek zijn kleine trillingen die het apparaat kan maken
pt_br: Haptics é o nome chique das vibraçõs que o seu dispositivo pode fazer.

# Haptic.text2
source: There are several types of Haptics, and each one is used to represent something different.
nl: Er zijn verschillende soorten haptiek en elk wordt gebruikt om iets anders te vertegenwoordigen.
pt_br: Existem vários tipos de Haptics, e cada um representa algo diferente.

# Haptic.comment1
source: But... why are we talking about haptics in an accessibility guide?
nl: Maar... waarom praten we over haptiek in een toegankelijkheidsgids?
pt_br: Mas... por que estamos falando de vibrações num guia de acessibildiade?

# Haptic.text3
source: Haptics are a type of feedback. When you select something, when something suceeds...
nl: Haptiek is een vorm van feedback. Wanneer je iets selecteert, wanneer iets slaagt...
pt_br: Haptics são um tipo de feedback. Quando você seleciona algo, quando algo dá errado...

# Haptic.text4
source: It's an additional layer of feedback. Imagine most actions have some kind of visual feedback, like when you tap a button and it changes it's color slightly so you know the button is pressed.
nl: Het is een extra laag feedback. Stel je voor dat de meeste acties enige vorm van visuele feedback hebben, zoals wanneer je op een knop tikt en de kleur ervan licht verandert, zodat je weet dat de knop is ingedrukt.
pt_br: É uma camada a mais de informação. Imagine que a maioria das ações podem produzir uma animação, uma mudança de cor para chamar a atenção do usuário, quando clicamos num botão ele muda ligeiramente de cor para dar a impressão que está sendo pressionado.

# Haptic.text5
source: Since sometimes we cannot rely on visual cues, the Haptics can be a very interesting and powerful way to improve accessibility.
nl: Aangezien we soms niet kunnen vertrouwen op visuele aanwijzingen, kunnen haptiek een zeer interessante en krachtige manier zijn om de toegankelijkheid te verbeteren.
pt_br: Mas não podemos depender de dicas visuais com todos os usuários, então os Haptics podem ser muito úteis em acompanhar esse tipo de feedback, se tornando uma camada a mais de acessibilidade.

# HapticList.title
source: List of Haptics
nl: Lijst van Haptieken
pt_br: Lista de Haptics

# HapticList.text1
source: Here's a list of the Haptics available:
nl: Hier is een lijst van beschikbare haptieken:
pt_br: Aqui uma lista de todos os Haptics disponíveis:

# HapticList.comment
source: I also suggest you check the source code of this project. It has a nice Haptic wrapper to be used on UIKit or SwiftUI!
nl: Ik raad je ook aan de broncode van dit project te bekijken. Het heeft een mooie Haptic-wrapper die kan worden gebruikt op UIKit of SwiftUI!
pt_br: Eu também sugiro que você dê uma olhada no código fonte desse projeto, que tem uma solução legal para disparar os diversos tipos de Haptics.

# HapticList.sourceCode
source: Haptic source code
nl: Broncode Haptic
pt_br: Código fonte

# HapticList.iPadDisclaimer
source: Haptics are not available on iPad, the buttons below may not work on your current device.
nl: Haptiek is niet beschikbaar op iPad, de knoppen hieronder werken mogelijk niet op je huidige apparaat.
pt_br: Haptics não estão disponíveis em iPads. Os botões abaixo podem não funcionar no seu dispositivo atual.

# Haptics.selection
source: Selection
nl: Selectie
pt_br: Seleção

# Haptics.success
source: Success
nl: Succes
pt_br: Sucesso

# Haptics.error
source: Error
nl: Fout
pt_br: Erro

# Haptics.warning
source: Warning
nl: Waarschuwing
pt_br: Alerta

# Haptics.lighImpact
source: Light Impact
nl: Lichte impact
pt_br: Impacto leve

# Haptics.mediumImpact
source: Medium Impact
nl: Gemiddelde impact
pt_br: Impacto médio

# Haptics.heavyImpact
source: Heavy Impact
nl: Zware impact
pt_br: Impacto forte

# Activate.title
source: Activate element
nl: Element Activeren
pt_br: Ativar elemento

# Activate.text1
source: Activating an element (double tapping it with VoiceOver enabled) is the same as a single tap when not using the voice over.
nl: Het activeren van een element (door erop te dubbeltikken met VoiceOver ingeschakeld) is hetzelfde als een enkele tik wanneer je VoiceOver niet gebruikt.
pt_br: Ativar um elemento (clique duplo quando o VoiceOver está ativado) é o mesmo que clicar quando não se está usando o leitor de tela.

# Activate.comment1
source: Tap a button, click on a cell...
nl: Tik op een knop, klik op een cel...
pt_br: Clicar num botão, numa célula...

# Activate.text2
source: Most of the time, this action will hapen automatically when your cell has a tap gesture our is a button.
nl: Meestal gebeurt deze actie automatisch wanneer je cel een taptiksel heeft of een knop is.
pt_br: Na maioria das vezes, esta ação acontece automaticamente se o seu componente tem um gesto de Tap ou é um botão.

# Activate.text3
source: But you can customize or add a specific action for the activation gesture
nl: Maar je kunt de activeringstiksel aanpassen of een specifieke actie toevoegen voor het activeringsgebaar.
pt_br: Mas você pode personalizar ou adicionar ações específicas para este gesto.

# Activate.codeComment
source: Handle Action
nl: Actie afhandelen
pt_br: Tratar ativação

# LongPress.title
source: Long Press
nl: Lang indrukken

# LongPress.comment1
source: Long press?
nl: Lang indrukken?

# LongPress.text1
source: Long press is not an accessibility specific gesture, but I like to add it here because it has a specific gesture to be handled when using VoiceOver.
nl: Lang indrukken is geen specifiek toegankelijkheidsgebaar, maar ik voeg het hier toe omdat het een specifiek gebaar heeft dat moet worden afgehandeld bij gebruik van VoiceOver.
pt_br: 'Long press' não é um gesto de acessibilidade propriamente dito, mas eu gosto de adicionar essa parte porque ele tem um gesto próprio no VoiceOver.

# LongPress.text2
source: To simulate a Long Press you do a triple tap when focused on the item.
nl: Om een lang indrukken te simuleren, voer je een driedubbele tik uit wanneer je gefocust bent op het item.
pt_br: Para simular um 'Long Press' de um toque triplo com um dedo no item focado.

# LongPress.text3
source: Turn VoiceOver on and focus on the next element. It has a long press gesture.
nl: Zet VoiceOver aan en focus op het volgende element. Het heeft een lang indrukken-gebaar.
pt_br: Ligue o VoiceOver e foque no elemento a seguir, ele tem um gesto de long press.

# LongPress.comment2
source: If you are using a long press gesture, I suggest always adding an accessibility hint to tell your user about it!
nl: Als je een lang indrukken-gebaar gebruikt, raad ik altijd aan een toegankelijke hint toe te voegen om je gebruiker hierover te informeren!
pt_br: Se você está usando um gesto de long press, eu sugiro que adicione um 'Accessibility Hint' para avisar o seu usuário dessa interação!

# LongPress.text4
source: The long press is specially useful on 'Back buttons', which on newer iOS will display the navigation hierarchy, allowing you to easily navigate back to the page you want.
nl: Het lang indrukken is vooral handig bij 'Terugknoppen', die op nieuwere iOS-versies de navigatiehiërarchie weergeven, zodat je eenvoudig terug kunt navigeren naar de pagina die je wilt.
pt_br: O 'long press' é especialmente útil nos botões de voltar da barra de navegação. No iOS, ele mostra oda a hierarquia de navegação, facilitando voltar para a página que você está procurando.

# LongPress.Example.text
source: Some generic view in here
nl: Enkele generieke weergave hier
pt_br: Alguma view genérica aqui

# LongPress.Example.hint
source: Tap three times to copy the text
nl: Tik drie keer om de tekst te kopiëren
pt_br: Toque três vezes para copiar o texto

# LongPress.Example.notification
source: Text copied to the clipboard
nl: Tekst gekopieerd naar het klembord
pt_br: Texto copiado para área de transferência

# LongPress.Code.comment
source: Handle gesture
nl: Gebaar afhandelen
pt_br: Tratar gesto

# CustomActions.title
source: Custom Actions
nl: Aangepaste Acties
pt_br: Ações Customizadas

# CustomActions.text1
source: 'Custom Actions' is the name of the ability to add multiple actions to be executed on the same view. When focused, VoiceOver will read 'actions available' at the end, meaning you can swipe up and down to change the action that will be executed when you activate the element.
nl: 'Aangepaste Acties' is de naam van de mogelijkheid om meerdere acties toe te voegen die worden uitgevoerd op dezelfde weergave. Als je gefocust bent, zal VoiceOver 'beschikbare acties' aan het einde lezen, wat betekent dat je omhoog en omlaag kunt vegen om de actie te wijzigen die wordt uitgevoerd wanneer je het element activeert.
pt_br: Ações customizadas, ou 'Custom Actions', é o nome da habilidade de adicinar múltiplas ações em um único elemento acessível. Quando focado, o leito vai ler 'ações dispon;iveis' ao final, o que significa que você pode deslizar o dedo para cima ou para baixo na tela para escolher a ação que será executada quando o elemento for ativado.

# CustomActions.comment1
source: But, when would I even use that?
nl: Maar wanneer zou ik dat zelfs gebruiken?
pt_br: Mas, quando eu usaria isso?

# CustomActions.text2
source: It's a good tool to improve the accessibility on elements that can perform multiple actions.
nl: Het is een goede tool om de toegankelijkheid van elementen die meerdere acties kunnen uitvoeren, te verbeteren.
pt_br: É uma ótima ferramenta para melhorar a acessibilidade de elementos que pode fazer várias ações.

# CustomActions.text3
source: Like a Card cell, which can select the card, delete, edit
nl: Zoals een kaartcel, die de kaart kan selecteren, verwijderen, bewerken
pt_br: Como uma célula de cartão que pode selecionar, deletar ou editar o cartão salvo.

# CustomActions.text4
source: Usually you'd have multiple buttons for each action, but focusing on each individual button would not be a very good VoiceOver experience.
nl: Meestal zou je meerdere knoppen hebben voor elke actie, maar focussen op elke afzonderlijke knop zou geen erg goede VoiceOver-ervaring zijn.
pt_br: Geralmente, você tem múltiplos botões, um para cada ação, mas focar em cada um deles separadamente não é uma boa experiência de VoiceOver.

# CustomActions.comment2
source: I find custom actions to be also very useful when some of the actions are hidden behind an animation, like when you need to tap an icon, something changes, and other icons appears.
nl: Ik vind aangepaste acties ook erg handig wanneer sommige van de acties verborgen zijn achter een animatie, zoals wanneer je op een pictogram moet tikken, er iets verandert en andere pictogrammen verschijnen.
pt_br: Eu acho que as ações customizadas são uma maneira muito útil de deixar acessíveis ações que ficam escondidas atrás de animações, como quando você clica num ícone de edição e então aparecem outros ícones com mais opções.

# CustomActions.accessible
source: Credit Card, ending in 1234
nl: Creditcard, eindigend op 1234
pt_br: Cartão de Crédito, terminado em 1234

# MagicTap.title
source: Magic Tap
nl: Magische Tik

# MagicTap.text1
source: 'Magic Tap' is a double tap with two fingers gesture.
nl: 'Magische Tik' is een gebaar van dubbel tikken met twee vingers.
pt_br: O 'Magic Tap', ou Toque Mágico, é um gesto de clique duplo com dois dedos.

# MagicTap.text2
source: You can configure the 'Magic Tap' to do basically anything.
nl: Je kunt de 'Magische Tik' configureren om zo ongeveer alles te doen.
pt_br: Você pode configurar o 'Magic Tap' para executar qualquer ação.

# MagicTap.text3
source: Apple's documentation suggests you use it to be a shortcut to 'your main action', such as a music player, it would be suited to play and pause actions, or on a camera app, it would be suited to take a photo.
nl: De documentatie van Apple suggereert dat je het moet gebruiken als een snelkoppeling naar 'je belangrijkste actie', zoals bij een muziekspeler, zou het geschikt zijn voor afspelen en pauzeren, of bij een camera-app zou het geschikt zijn voor het nemen van een foto.
pt_br: A documentação da Apple sugere que ele seja usado como um atalho para a função principal da sua aplicação, como dar play/pause em um reprodutor de música, ou tirar uma foto num app de câmera.

# MagicTap.text4
source: Test the Magic tap on the view below!
nl: Test de Magische tik op de weergave hieronder!
pt_br: Teste o Magic Tap na view abaixo.

# MagicTap.comment1
source: When implementing the 'Magic Tap', make sure it's enabled on the focused view, otherwise, it competes with the devices media player, because it's the same gesture to play/pause on the device.
nl: Bij het implementeren van de 'Magische Tik' zorg ervoor dat deze is ingeschakeld op de gefocuste weergave, anders concurreert deze met de mediaspeler van het apparaat, omdat het hetzelfde gebaar is om af te spelen/pauzeren op het apparaat.
pt_br: Quando implementando o 'Magic Tap', garanta que ele está habilitado na view focada, caso contrário, ele compete com o reprodutor de mídia do dispositivo, já que o mesmo gesto é usado para dar play/pause de maneira global.

# MagicTap.Example.thisContentIsMagic
source: This content has a Magic Tap!
nl: Deze inhoud heeft een Magische Tik!
pt_br: Este conteúdo tem um Magic Tap!

# MagicTap.Example.magicPerformed
source: Magic tap perfomed
nl: Magische tik uitgevoerd
pt_br: Magic tap executado

source: VoiceOver Guide
nl: VoiceOver Gids
pt_br: Guia do VoiceOver

# AccNotifications.title
source: Accessibility Notifications
nl: Toegankelijkheidsmeldingen
pt_br: Notificações de Acessibilidade

# Announcement.title
source: Announcement
nl: Aankondiging
pt_br: Anúncio

# Announcement.textToBeRead
source: Text to be read
nl: Tekst om te lezen
pt_br: Texto a ser lido

# Announcement.text1
source: An announcement notification is a way to make VoiceOver read something that is not currently focused.
nl: Een aankondigingsmelding is een manier om VoiceOver iets te laten voorlezen dat momenteel niet is gefocust.
pt_br: Uma notificação de anúncio, ou 'announcement notification', é uma forma de fazer o VoiceOver ler algo que não está focado no momento.

# Announcement.text2
source: Sometimes, some information changes on the screen and we show to the user using some animation to grab their attention.
nl: Soms verandert er informatie op het scherm en tonen we dit aan de gebruiker met een animatie om hun aandacht te trekken.
pt_br: As vezes, alguma informação muda na tela, e mostramos pro usuário com alguma animação para puxar a sua atenção.

# Announcement.text3
source: But, we cannot rely on visual cues to show information when talking about visual accessibility.
nl: Maar we kunnen niet vertrouwen op visuele aanwijzingen om informatie te tonen als we het hebben over visuele toegankelijkheid.
pt_br: Mas, não podemos depender de dicas visuais quando estamos falando de acessibilidade de deficiênia visual.

# Announcement.comment1
source: To me, that's where the announcements shine!
nl: Naar mijn mening komen aankondigingen hier goed van pas!
pt_br: É aqui que os anúncios brilham! Ler mudanças de conteúdo na tela mas que não estão focadas no momento.

# Announcement.comment2
source: The code cells bellow are another example of announcements when you copy the code!
nl: De codecellen hieronder zijn een ander voorbeeld van aankondigingen wanneer je de code kopieert!
pt_br: Os exemplos de código abaixo também são exemplos de anúncios quando você copia o código usando long press com o VocieOver habilitado.

# Announcement.Notifications.negative
source: Going negative, aren't we?
nl: Negatief gaan, nietwaar?
pt_br: Indo negativo não é?

# Announcement.Notifications.small
source: Oh the values are increasing!
nl: Oh, de waarden nemen toe!
pt_br: Os valores estão aumentando!

# Announcement.Notifications.medium
source: You like to increase, don't you?
nl: Je houdt van verhogen, hè?
pt_br: Você gosta de aumentar, não?

# Announcement.Notifications.large
source: Yep, keep increasing...
nl: Ja, blijf maar verhogen...
pt_br: Isso, continue assim...

# Announcement.Notifications.huge
source: Getting close to the end
nl: Dicht bij het einde
pt_br: Perto do fim agora

# Announcement.Notifications.final
source: This is the final message
nl: Dit is het laatste bericht
pt_br: Esta é a mensagem final.

# NotifyChanges.title
source: Notify Screen changes
nl: Meldingen van schermwijzigingen
pt_br: Notificar mudanças na tela

# NotifyChanges.text1
source: When something changes on the screen, we need to remember a VoiceOver user will not be able to see it.
nl: Wanneer er iets op het scherm verandert, moeten we onthouden dat een VoiceOver-gebruiker het niet kan zien.
pt_br: Quando algo muda na tela, precisamos lembrar que um usuário de VoiceOver não será capaz de ver essa alteração.

# NotifyChanges.text2
source: This is also valid to when the screen itself changes.
nl: Dit geldt ook wanneer het scherm zelf verandert.
pt_br: Isso também vale pra quando a própria tela muda.

# NotifyChanges.text3
source: But, we have some Accessibility Notifications that behave like audio cues to tell the user something has happened.
nl: Maar we hebben enkele toegankelijkheidsmeldingen die zich gedragen als audiocues om de gebruiker te vertellen dat er iets is gebeurd.
pt_br: Mas, temos notificações de acessibilidade para dizer ao usuário o que aconteceu.

# NotifyChanges.comment1
source: But what is the argument that is 'nil' on the code?
nl: Maar wat is het argument dat 'nil' is in de code?
pt_br: O que é o argumento 'nil' no exemplo?

# NotifyChanges.comment2
source: Find out more about it on the following page!
nl: Ontdek er meer over op de volgende pagina!
pt_br: Descubra mais na página a seguir!

# NotifyChanges.screenChange
source: Screen change notification
nl: Melding van schermwijziging
pt_br: Notificação de mudança da tela
