Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# ListOfTraits.notEnabled
source: The content interaction is disabled - eg: a disabled button
nl: De inhoudsinteractie is uitgeschakeld - bijv. een uitgeschakelde knop
pt_br: A interação com o componente está desativada - por exemplo, um botão desabilitado.

# ListOfTraits.allowsDirectInteraction
source: The accessibility element allows direct touch interaction for VoiceOver users.
nl: Het toegankelijkheidselement staat directe aanraakinteractie toe voor VoiceOver-gebruikers.
pt_br: O elemento permite interação direta para usuários do VoiceOver.

# ListOfTraits.updatesFrequently
source: The value or label frequently changes.
nl: De waarde of label verandert vaak.
pt_br: O valor da 'accessibility label' muda com frequência.

# ListOfTraits.causesPageTurn
source: Makes an automatic page turn when it finished reading the element.
nl: Veroorzaakt automatisch een paginawending wanneer het element klaar is met lezen.
pt_br: Caus uma mudança automáica de página quando termina de ler o elemento.

# ListOfTraits.playsSound
source: Plays sound when activated
nl: Speelt geluid af wanneer geactiveerd
pt_br: Toca um som quando ativado.

# ListOfTraits.startsMediaSession
source: Starts playing from a media session.
nl: Start met afspelen vanuit een mediasessie.
pt_br: Começa uma sessão de mídia - tocadores de música ou de vídeo.

# ButtonTrait.title
source: Button Trait
nl: Knopkenmerk

# ButtonTrait.text1
source: The button trait is, to me, THE most important trait.
nl: Het knopkenmerk is voor mij HET belangrijkste kenmerk.
pt_br: O trait de botão é, pra mim, o mais importante dos traits.

# ButtonTrait.text2
source: It basically tells the user that they can activate the element (with a double tap) and that something will happen
nl: Het vertelt de gebruiker in feite dat ze het element kunnen activeren (met een dubbele tik) en dat er iets zal gebeuren
pt_br: Ele basicamente diz pro usuário que ele pode ativar um elemento (com um toque duplo) e que alguma coisa vai acontecer quando ele for ativado.

# ButtonTrait.text3
source: If you are using a Button or a UIButton it will automatically have the 'button' trait
nl: Als je een Button of een UIButton gebruikt, heeft het automatisch het 'knop'-kenmerk
pt_br: Se você está usando um Button ou um UIButton, ele vai automaticamente ter o trait de botão.

# ButtonTrait.text4
source: But sometimes we need to add it manually to our view, like when making a cell that can be tapped, or some other content with a tap gesture.
nl: Maar soms moeten we het handmatig toevoegen aan onze weergave, zoals bij het maken van een cel die kan worden getikt, of andere inhoud met een tikbeweging.
pt_br: Mas, algumas vzes, você precisa adicioná-lo manualmente, como uma célula que abre uma tela nova, ou qualquer conteúdo com um gesto de Tap.

# ButtonTrait.myCell
source: My Cell
nl: Mijn Cel
pt_br: Minha célula

# ButtonTrait.cellDescription
source: cell description
nl: celbeschrijving
pt_br: Descrição

# ButtonTrait.additionalInformation
source: Additional information
nl: Extra informatie
pt_br: Informação adicional

# ButtonTrait.cellTapped
source: This cell was tapped
nl: Deze cel is getikt
pt_br: A célula foi clicada

# ImageTrait.title
source: Image Trait
nl: Afbeeldingkenmerk

# ImageTrait.text1
source: The image trait is good for images or other visual elements that have no text or action.
nl: Het afbeeldingkenmerk is goed voor afbeeldingen of andere visuele elementen zonder tekst of actie.
pt_br: O trait de imagem serve para imagens ou outros elementos visuais que não contém nenhum texto ou ação.

# ImageTrait.text2
source: If you are using an Image or an UIImage it will automatically have the image trait. However, you may also want to apply this trait to other elements, such as graphics or animations.
nl: Als je een Image of een UIImage gebruikt, heeft het automatisch het afbeeldingkenmerk. U wilt echter dit kenmerk mogelijk ook toepassen op andere elementen, zoals grafische elementen of animaties.
pt_br: Se você está usando uma Image ou uma UIImage, ela vai automaticamente ter o trait de imagem. Entretanto, você pode querer aplicar esse trait também em outros elementos que façam sentido, como, por exemplo, um gráfico ou uma animação.

# ImageTrait.text3
source: This will make the Voice Over to identify and read the element as an image.
nl: Hierdoor zal VoiceOver het element identificeren en lezen als een afbeelding.
pt_br: Isso fará o Voice Over identificar e ler o elemento como uma imagem.

# ImageTrait.description
source: Image description
nl: Afbeeldingsbeschrijving
pt_br: Descrição da imagem

# SummaryElementTrait.title
source: Summary Element Trait
nl: Samenvattingselementkenmerk

# SummaryElementTrait.text1
source: The Summary Element Trait gives a summarized description of the most important info of the screen.
nl: Het samenvattingselementkenmerk geeft een samengevatte beschrijving van de belangrijkste informatie op het scherm.
pt_br: O trait de elemento de resumo fornece uma descrição resumida da informação mais relevante daquela tela.

# SummaryElementTrait.text2
source: An example is Apple's Weather app, in which the view that contains the city and current weather is used as a summary.
nl: Een voorbeeld is de Weather-app van Apple, waarin de weergave met de stad en het huidige weer wordt gebruikt als een samenvatting.
pt_br: Um exemplo é o app de Tempo do iPhone, onde o a view que contém a cidade e temperaturas atuais, no topo da tela, possui essa trait e é usada como sumário.

# SummaryElementTrait.text3
source: This trait makes VoiceOver read this element as soon as the screen appears, regardless of the position of this element in the view hierarchy. The focus order is not affected.
nl: Dit kenmerk maakt VoiceOver om dit element te lezen zodra het scherm verschijnt, ongeacht de positie van dit element in de weergavehiërarchie. De focusvolgorde wordt niet beïnvloed.
pt_br: Esse trait faz o Voice Over ler esse elemento assim que a tela aparece, independente da posição dele na hierarquia da view.

# SummaryElementTrait.description
source: This screen is about summary element traits
nl: Dit scherm gaat over samenvattingselementkenmerken
pt_br: Essa tela fala sobre summary element traits.

# SearchFieldTrait.title
source: Search Field Trait
nl: Zoekveldkenmerk

# SearchFieldTrait.text1
source: The Search Field Trait is good for fields that are not just data inputs, but also performs some visual change on the screen when filled.
nl: Het zoekveldkenmerk is goed voor velden die niet alleen gegevensinvoer zijn, maar ook enige visuele verandering op het scherm veroorzaken wanneer ze zijn ingevuld.
pt_br: O trait de campo de busca serve para campos de texto que não são apenas entradas de dados, mas também produzem alguma alteração visual na tela quando preenchidos.

# SearchFieldTrait.text2
source: When we search for something, normally these searches results are displayed somewhere on the screen.
nl: Wanneer we iets zoeken, worden deze zoekresultaten normaal gesproken ergens op het scherm weergegeven.
pt_br: Quando fazemos uma busca textual, é normal que os resultados dessa busca sejam apresentados em algum lugar da tela.

# SearchFieldTrait.text3
source: This trait allows VoiceOver to warn the user that the UI will change somewhere.
nl: Dit kenmerk stelt VoiceOver in staat om de gebruiker te waarschuwen dat de UI ergens zal veranderen.
pt_br: Esse trait permite que o VoiceOver avise que a UI vai mudar em algum lugar.

# SearchFieldTrait.button
source: Try here!
nl: Probeer hier!
pt_br: Teste esse exemplo!

# SearchFieldTrait.description
source: Type what you are searching for.
nl: Typ waar je naar op zoek bent.
pt_br: Digite o que você está buscando.

# SearchFieldTrait.AnimalsArray.Bee
source: 🐝 Bee
nl: 🐝 Bij
pt_br: 🐝 Abelha

# SearchFieldTrait.AnimalsArray.Bird
source: 🦜 Bird
nl: 🦜 Vogel
pt_br: 🦜 Ave

# SearchFieldTrait.AnimalsArray.Cat
source: 🐈 Cat
nl: 🐈 Kat
pt_br: 🐈 Gato

# SearchFieldTrait.AnimalsArray.Cow
source: 🐄 Cow
nl: 🐄 Koe
pt_br: 🐄 Vaca

# SearchFieldTrait.AnimalsArray.Dog
source: 🐶 Dog
nl: 🐶 Hond
pt_br: 🐶 Cachorro

# SearchFieldTrait.AnimalsArray.Snake
source: 🐍 Snake
nl: 🐍 Slang
pt_br: 🐍 Cobra

# Adjustable.title
source: Adjustable trait
nl: Aanpasbaar kenmerk

# Adjustable.text1
source: Adjustable components are actually using an accessibility trait.
nl: Aanpasbare componenten maken eigenlijk gebruik van een toegankelijkheidskenmerk.
pt_br: Componentes ajustáveis estão na verdade usando um 'accessibility trait'.

# Adjustable.text2
source: It's used on components that have some kind of quantity change or selection, like sliders, counters or quick-adds.
nl: Het wordt gebruikt bij componenten met een soort wijziging van hoeveelheid of selectie, zoals schuifregelaars, tellers of snelle toevoegingen.
pt_br: É usado em componentes que tem algum tipo de alteração de quantidade ou seleção de conteúdo, como quick-adds, sliders ou contadores.

# Adjustable.text3
source: It's very powerful, and, when focused, an adjustable view will gain the swipe up and down gestures
nl: Het is zeer krachtig en een aanpasbare weergave krijgt, wanneer deze is gefocust, de veegbewegingen omhoog en omlaag
pt_br: É muito poderoso, e, quando focado, um elemento ajustável ganha os gestos de deslizar para cima e para baixo.

# Adjustable.text4
source: That can be implemented to handle it's respective actions, without the need to directly tap into the buttons.
nl: Die kunnen worden geïmplementeerd om de respectieve acties te behandelen, zonder dat u rechtstreeks op de knoppen hoeft te tikken.
pt_br: Que podem ser implementados para tratar suas ações respectivamente.

# Adjustable.seeMore
source: See more on accessibility traits!
nl: Zie meer over toegankelijkheidskenmerken!
pt_br: Veja mais sobre accessibility traits!

# Adjustable.Code.increment
source: Handle increment
nl: Behandel verhoging
pt_br: Tratar incremento

# Adjustable.Code.decrement
source: Handle decrement
nl: Behandel verlaging
pt_br: Tratar decremento

# ColorsGuide.title
source: Colors Guide
nl: Kleurengids
pt_br: Guia de cores

# ColorsGuide.introduction
source: Introduction
nl: Inleiding
pt_br: Introdução

# AboutColors.title
source: About Colors
nl: Over kleuren
pt_br: Sobre cores

# AboutColors.text1
source: I like colors. But not everybody experience them in the same way.
nl: Ik hou van kleuren. Maar niet iedereen ervaart ze op dezelfde manier.
pt_br: Eu gosto de cores. Mas nem todos as veem da mesma forma.

# AboutColors.comment1
source: Some people don't experience them at all!
nl: Sommige mensen ervaren ze helemaal niet!
pt_br: Algumas pessoas não veem cor alguma.

# AboutColors.text2
source: Colors are how our brains make sense of the light that reach our eyes. We have cells that will interact with different frequencies of light, and their combination will produce what we see.
nl: Kleuren zijn hoe onze hersenen zin geven aan het licht dat onze ogen bereikt. We hebben cellen die reageren op verschillende frequenties van licht, en hun combinatie produceert wat we zien.
pt_br: Cores são como nossos cérebros tratam a luz que chega nos nossos olhos, que têm células que interagem com frequências diferentes de luz, e a combinação delas gera a cor que nós vemos.

# AboutColors.comment2
source: I'm over extending myself into physics and biology, but bear with me.
nl: Ik begeef me te veel in de fysica en biologie, maar houd vol.
pt_br: Eu estou entrando um pouco em física e biologia aqui, mas não desista de mim.

# AboutColors.text3
source: And when building an app, colors are usually something that come before actually programming anything, or during what I like to call 'The design step'.
nl: En bij het bouwen van een app zijn kleuren meestal iets dat komt vóór het programmeren van iets, of tijdens wat ik graag 'de ontwerpstap' noem.
pt_br: E quando construindo uma aplicação, cores são geralmente algo que tratamos antes de realmente começar a implementar alguma coisa, durante o que eu gosto de chamar de 'O período de design'.

# AboutColors.text4
source: So, if you are working on a team with a Designer, I highly recommend you bring these discussion to them. Understanding more about colors, how they affect the users and what we can consider accessibility while handling colors on our app.
nl: Dus, als je samenwerkt met een ontwerper, raad ik je ten zeerste aan om deze discussie met hen te voeren. Begrijp meer over kleuren, hoe ze van invloed zijn op de gebruikers en wat we kunnen overwegen met betrekking tot toegankelijkheid bij het omgaan met kleuren in onze app.
pt_br: Então, se você está trabalhando num time com um Designer, eu recomendo levar a discussão sobre cores para seu time! Para entender mais sobre cores, como elas afetam os usuários e como podemos considerar acessibilidade com o uso delas.

# AboutColors.comment3
source: If you don't have a designer there... Well, I hope this content also helps you understand a little bit more about it!
nl: Als je daar geen ontwerper hebt... Nou, ik hoop dat deze inhoud je ook helpt er een beetje meer over te begrijpen!
pt_br: E se você não tem um Designer por aí... Bom, eu espero que esse conteúdo possa te ajudar a entender um pouco mais sobre!

# AboutColors.higColors
source: Human Interface Guidelines - Colors
nl: Human Interface Guidelines - Kleuren

# AboutColors.image
source: Image of pretty colors
nl: Afbeelding van mooie kleuren
pt_br: Uma imagem de cores bonitas

# Collaboration.title
source: Collaboration
nl: Samenwerking
pt_br: Colaboração

# Collaboration.OpenSource.text1
source: Yep, the Handbook is an Open Source project!
nl: Ja, de Handleiding is een open source project!
pt_br: Sim, o Handbook é um projeto de código livre!

# Collaboration.OpenSource.text2
source: The idea is that the app's code can be used as examples. Take a look into the code, see for yourself how the feature actually works when running on an app.
nl: Het idee is dat de code van de app als voorbeelden kan worden gebruikt. Bekijk de code, zie zelf hoe de functie werkt wanneer deze op een app wordt uitgevoerd.
pt_br: A ideia é que o app possa ser usado como exemplo, onde se possa ver o código, e testar a feature rodando num app de verdade.

# Collaboration.OpenSource.comment1
source: It's not perfect, and it's a little weird in some places... I know that, ok?
nl: Het is niet perfect, en het is op sommige plaatsen een beetje vreemd... Dat weet ik, oké?
pt_br: Não é perfeito, e talvez um pouco estranho em alguns lugares...

# Collaboration.OpenSource.text3
source: But fell free to suggest changes, fix some bugs and identify issues on our GitHub project!
nl: Maar voel je vrij om wijzigingen voor te stellen, wat bugs te repareren en problemen te identificeren op ons GitHub-project!
pt_br: Mas sinta-se a vontade de sugerir edições, mudanças, corrigir alguns bugs e identificar problemas no nosso projeto do GitHub!

# Collaboration.githubPreoject
source: Check our GitHub project!
nl: Bekijk ons GitHub-project!
pt_br: Veja o projeto no GitHub

# Collaboration.license
source: License
nl: Licentie
pt_br: Licensa

# Collaboration.Issue.title
source: Found an issue?
nl: Een probleem gevonden?
pt_br: Encontrou um problema?

# Collaboration.Issue.text1
source: Report to us on our GitHub project!
nl: Meld het ons op ons GitHub-project!
pt_br: Reporte para nós no GitHub!

# Collaboration.Issue.text2
source: It could be some translation problem, some accessibility issue (nobody's perfect, okay?), or anything at all!
nl: Het kan een probleem zijn met vertaling, een toegankelijkheidsprobleem (niemand is perfect, oké?), Of iets heel anders!
pt_br: Pode ser um problema de tradução, algo errado na acessibilidade de um component (ninguém é perfeito), ou qualquer coisa!

# Collaboration.submitIssue
source: Submit an issue report!
nl: Dien een probleemrapport in!
pt_br: Submeta uma issue!

# Collaboration.Translate.title
source: Help us translate
nl: Help ons vertalen
pt_br: Nos ajude a traduzir

# Collaboration.Translate.text1
source: If you are a developer and would like to bring the handbook closer to your community and your peers, consider helping us translating the app to other languages!
nl: Als je een ontwikkelaar bent en de handleiding dichter bij je gemeenschap en je collega's wilt brengen, overweeg dan ons te helpen bij het vertalen van de app naar andere talen!
pt_br: Se você é um desencolvedor e gostaria de levar o Handbook mais próximo da sua comunidade local, considere nos ajudar a traduzir o conteúdo para outras línguas!

# Collaboration.Translate.text2
source: You can get the project on GitHub and open a Pull Requets translating the content!
nl: Je kunt het project op GitHub krijgen en een pull-verzoek openen om de inhoud te vertalen!
pt_br: Você pode abrir um PR no GitHub traduzindo o conteúdo.

# Collaboration.Translate.comment
source: It's a lot of stuff... I know, but the more the merrier!
nl: Het is veel spul... Ik weet het, maar hoe meer zielen, hoe meer vreugd!
pt_br: Eu sei que é bastante coisa... mas quanto mais melhor!

# Collaboration.submitPR
source: Submit a Pull Request with the changes!
nl: Dien een Pull Request in met de wijzigingen!
pt_br: Submeta um Pull Request com suas mudanças!

# Collaboration.Suggestion.title
source: Want to see something specific?
nl: Wil je iets specifieks zien?
pt_br: Quer ver algo específico?

# Collaboration.Suggestion.text1
source: Maybe you have something that you wanted to know that is not present on the app
nl: Misschien heb je iets dat je wilt weten dat niet aanwezig is in de app
pt_br: Talvez você tenha algo que queria saber mas não encontrou aqui

# Collaboration.Suggestion.text2
source: Or you'd like to suggest a new puzzle to add to the games.
nl: Of je wilt een nieuwe puzzel voorstellen om aan de games toe te voegen.
pt_br: Ou gostaria de sugerir um jogo novo?

# Collaboration.Suggestion.text3
source: Fell free to tell us ay idea you have!
nl: Voel je vrij om ons alle ideeën te vertellen die je hebt!
pt_br: Fique a vontade para nos trazer qualquer ideia!

# Collaboration.submitFeatureRequest
source: Submit a feature request!
nl: Dien een functieverzoek in!
pt_br: Submeta um pedido de feature!

# AboutTheApp.title
source: About the app
nl: Over de app
pt_br: Sobre o app

# AboutTheApp.History.text1
source: The Accessibility Handbook started as an idea with some colleagues and friends, aiming to be an easy way to learn more about iOS accessibility features.
nl: De Toegankelijkheidshandleiding begon als een idee met enkele collega's en vrienden, met als doel een gemakkelijke manier te bieden om meer te weten te komen over iOS-toegankelijkheidsfuncties.
pt_br: O 'Accessibility Handbook' começou como uma ideia com alguns colegas de trabalho e amigos, para ser uma maneira fácil de aprender e testar features de acessibilidade em iOS.

# AboutTheApp.History.text2
source: At the time we started working on it, but we never got to finish or publish the Handbook. So, a while later, I took what I learned and decided to bring it into the world! Rewriting the contents, adding UIKit and SwiftUI versions to make something really fresh and nice.
nl: Toen we eraan begonnen te werken, hebben we het nooit afgemaakt of gepubliceerd. Dus, een tijdje later nam ik wat ik had geleerd en besloot ik het naar buiten te brengen! De inhoud herschrijven, UIKit- en SwiftUI-versies toevoegen om iets echt fris en mooi te maken.
pt_br: Com o passar do tempo, trabalhamos na ideia, mas nunca chegamos a terminar de fato. Agora, puxamos de novo o projeto, reescrevendo o conteúdo em SwiftUI, mas com exemplos em UIKit e SwiftUI, tentando trazer algo realmente legal para ser usado por todo mundo.

# AboutTheApp.History.text3
source: I always thought the information about accessibility was always there, but you had to know what to look for.
nl: Ik dacht altijd dat de informatie over toegankelijkheid er altijd was, maar dat je moest weten waar je moest zoeken.
pt_br: Eu sempre achei que informação sobre acessibilidade sempre esteve por aí, mas você tinha que saber exatamente o que procurar.

# AboutTheApp.History.text4
source: That's where this handbook comes, it's something that can be collaborative, easy to use, and fast to find! It's an app! You can carry it around with you and read anytime.
nl: Daar komt deze handleiding om de hoek kijken, het is iets dat samenwerkend, gemakkelijk te gebruiken en snel te vinden moet zijn! Het is een app! Je kunt het altijd bij je dragen en op elk moment lezen.
pt_br: Então é aí que entra o 'Handbook', é algo fácil de acessar, colaborativo e rápido de encontrar! E é um app! Algo que você carrega pra todo lado.

# AboutTheApp.History.text5
source: It's mostly based on my experiences as a developer, with real-life examples that (I hope) will help you understand more about Accessibility and also help you use in your own projects!
nl: Het is voornamelijk gebaseerd op mijn ervaringen als ontwikkelaar, met voorbeelden uit het echte leven die je hopelijk zullen helpen meer te begrijpen over toegankelijkheid en je ook zullen helpen het in je eigen projecten te gebruiken!
pt_br: É baseado em experiências de desenvolvedores com situações de verdade, e eu espero que ajude você a compreender mais sobre o tema e aplicar nos seus próprios projetos!

# AboutTheApp.Game.title
source: What about the Game?
nl: Wat dacht je van het spel?
pt_br: E sobre os Jogos?

# AboutTheApp.Game.text1
source: The Handbook was pretty nice and all... but it was a little boring.
nl: De Handleiding was best leuk en zo... maar het was een beetje saai.
pt_br: O Guia em si é muito legal e tudo mais... mas era meio chato.

# AboutTheApp.Game.text2
source: So I tryied to make something that would be nicer to use and to learn,
nl: Dus probeerde ik iets te maken dat leuker zou zijn om te gebruiken en te leren,
pt_br: Então, tentamos trazer algo que ajudasse a compreender melhor o conteúdo,

# AboutTheApp.Game.text3
source: And what best way to do that than with a game?
nl: En wat is een betere manier om dat te doen dan met een spel?
pt_br: E qual a melhor forma de se afzer isso do que com um jogo?

# AboutTheApp.Game.comment
source: The puzzles are not supposed to be hard, they are just a nice way to practice your accessibility knowledge!
nl: De puzzels moeten niet moeilijk zijn, ze zijn gewoon een leuke manier om je kennis van toegankelijkheid te oefenen!
pt_br: O sdesafios não são feitos para serem difíceis, mas uma forma de forçar você a entender como habilitar e utilizar diversas opções de acessibilidade, e claro, praticar o seu conhecimento!

# AboutTheApp.Disclaimer.text1
source: This app and it's content is supposed to be a helpful guide, based on real development experiences.
nl: Deze app en de inhoud ervan zijn bedoeld als een nuttige gids, gebaseerd op echte ontwikkelervaringen.
pt_br: O app e o conteúdo foi feito para ser um guia, baseado em esperiências reais.

# AboutTheApp.Disclaimer.text2
source: I do not know EVERYTHING about accessibility, and I'm learning a little bit more every day.
nl: Ik weet NIET ALLES over toegankelijkheid, en ik leer elke dag een beetje meer.
pt_br: Não sabemos TUDO sobre acessibilidade, e estamos aprendendo mais a cada dia.

# AboutTheApp.Disclaimer.comment1
source: And I have sure learned a lot while developing this very own app!
nl: En ik heb zeker veel geleerd tijdens het ontwikkelen van deze app!
pt_br: E com certeza aprendemos muito enquanto desenvolvendo esta aplicação.

# AboutTheApp.Disclaimer.text3
source: It may have some mistakes or misconceptions, so please, consider reporting if you find any of those.
nl: Het kan wat fouten of misvattingen bevatten, dus meld het alsjeblieft als je er een vindt.
pt_br: Podem haver problemas e até soluções melhores do que as explicadas aqui. E caso você as encontre, considere reportar para a gente!
