Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# UIFontMetrics.Intro.text1
source: UIFontMetrics is the solution to support scaling custom fonts automatically. You create a font metrics object that specifies the font style that you want to use in your app.
nl: UIFontMetrics is de oplossing om het schalen van aangepaste lettertypen automatisch te ondersteunen. Je maakt een lettermetriekobject dat de letterstijl specificeert die je in je app wilt gebruiken.
pt_br: UIFontMetrics é a solução para suportar escalar automaticamente fontes customizadas. Você cria um objeto de 'metrics' que especifica o estilo de fonte que você quer usar.

# UIFontMetrics.Intro.text2
source: Then, you load your custom font and scale it using the UIFontMetrics.
nl: Vervolgens laad je je aangepaste lettertype en schaal je het met behulp van UIFontMetrics.
pt_br: Depois, você carrega a sua fonte e a escala usando o UIFontMetrics.

# UIFontMetrics.Intro.comment1
source: Make sure your font looks good in bigger and smaller sizes! Readability is they key in every font size.
nl: Zorg ervoor dat je lettertype er goed uitziet in grotere en kleinere maten! Leesbaarheid is de sleutel bij elke lettergrootte.
pt_br: Garanta que sua fonte é legível tanto em tamanhos menores como maiores! Legibilidade é a chave em todo tamanho de fonte.

# AdjustLayoutToScaledFontPage.title
source: Adjust Layout to Scaled Fonts
nl: Indeling Aanpassen aan Geschaalde Lettertypen
pt_br: Ajustar o layout para fontes aumentadas

# AdjustLayoutToScaledFontPage.Intro.text1
source: The most difficult part of supporting dynamic fonts is: "Your carefully crafted layout is probably going to break once the labels increase or decrease in size."
nl: Het moeilijkste deel van het ondersteunen van dynamische lettertypen is: "Uw zorgvuldig ontworpen lay-out gaat waarschijnlijk kapot zodra de labels in grootte toenemen of afnemen."
pt_br: A parte mais difícil de suportar fontes dinâmicas é: "Garantir que o seu layout cuidadosamente planejado para um tamanho de texto não quebre."

# AdjustLayoutToScaledFontPage.Intro.text2
source: We need to consider what we want to happen once the font increases. Will it break into a new line? Will part of the content just be cut off? Will the view itself increase in size?
nl: We moeten overwegen wat we willen dat er gebeurt zodra het lettertype groter wordt. Zal het in een nieuwe regel breken? Zal een deel van de inhoud gewoon worden afgesneden? Zal de weergave zelf groter worden?
pt_br: Precisamos considerar o que vai acontecer quando mudarmos o tamanho da fonte. O conteúdo vai ter uma quebra de linha? Parte dele não ficará mais visível? A view que contém o texto irá aumentar de tamanho?

# AdjustLayoutToScaledFontPage.Intro.comment1
source: Hiding content is never a good solution, so we need to check approaches to make everything work with any size of font.
nl: Inhoud verbergen is nooit een goede oplossing, dus we moeten benaderingen controleren om alles te laten werken met elk lettertype.
pt_br: Esconder parte do conteúdo, de maneira geral, nunca é uma boa solução. Então, precisamos estudar e conhecer as abordagens para garantir que tudo funciona e continua legível com todos os tamanhos de contes.

# AdjustLayoutToScaledFontPage.Intro.comment2
source: This is also important to be discussed with your design team!
nl: Dit is ook belangrijk om te bespreken met uw ontwerpteam!
pt_br: Isso é muito importante de discutir com o seu time de design! 😉

# AdjustLayoutToScaledFontPage.Intro.text3
source: Check the following examples by changing the settings for the font size on your device and checking how each one behaves.
nl: Controleer de volgende voorbeelden door de instellingen voor de lettergrootte op uw apparaat te wijzigen en te kijken hoe elk ervan zich gedraagt.
pt_br: Observe os exemplos a seguir e altere o tamanho do texto nas configurações do seu dispositivo. Depois volte e veja como cada um se comporta com um tamanho de fonte diferente.

# AdjustLayoutToScaledFontPage.FixedSize.title
source: Fixed size
nl: Vaste grootte
pt_br: Tamanho Fixo

# AdjustLayoutToScaledFontPage.FixedSize.text1
source: The main rule is: Avoid fixed sizes as much as possible. When enlarging the font, it will probably not break the layout itself, but the content that is being displayed.
nl: De belangrijkste regel is: vermijd zoveel mogelijk vaste maten. Bij het vergroten van het lettertype breekt het waarschijnlijk niet de lay-out zelf, maar de inhoud die wordt weergegeven.
pt_br: A regra principal é: Evitar tamanhos fixos o máximo possível. Quando a fonte aumentar, o layout provavelmente não irá quebrar, mas o conteúdo escrito pode ser suprimido, e talvez não sej apossível de ser lido.

# AdjustLayoutToScaledFontPage.LineBreak.title
source: Allow line breaking
nl: Toestaan van regelovergang
pt_br: Quebra de linha

# AdjustLayoutToScaledFontPage.LineBreak.text1
source: By allowing the text to line break you can support displaying the content independently of it's size. But the issue is: It will probably increase the size of your layout vertically.
nl: Door de tekst toe te staan om over te gaan naar een nieuwe regel, kunt u de inhoud ondersteunen onafhankelijk van de grootte. Maar het probleem is: het vergroot waarschijnlijk de grootte van uw lay-out verticaal.
pt_br: Ao permitir que o texto tenha quebra de linha, você pode exibir qualquer conteúdo, independente do tamanho da fonte. O problema é: Aumentar o tamanho vertical do seu layout.

# AdjustLayoutToScaledFontPage.LineBreak.comment1
source: Make sure you are expecting this! Sometimes we do not want our cells or groups to increase too much because it can break our entire layout.
nl: Zorg ervoor dat je dit verwacht! Soms willen we niet dat onze cellen of groepen te veel toenemen omdat het onze hele lay-out kan breken.
pt_br: Garanta que esse é o comportamento esperado! As vezes, não queremos que as nossas células ou grupos cresçam muito de tamanho, pois isso também pode quebrar nosso layout.

# AdjustLayoutToScaledFontPage.ScaleSize.title
source: Scale size up to a limit
nl: Schaalgrootte tot een limiet
pt_br: Escalar até um limite

# AdjustLayoutToScaledFontPage.ScaleSize.text1
source: Another option, is allowing your content to scale it's size up to a limit so it doesn't break the layout (that much).
nl: Een andere optie is om uw inhoud toe te staan de grootte te schalen tot een bepaalde limiet, zodat de lay-out niet (te veel) wordt verbroken.

# AdjustLayoutToScaledFontPage.ScaleSize.comment1
source: I think it's a nice solution when paired with multiline text, but, you need to make sure to test it with different content sizes.
nl: Ik vind het een mooie oplossing als het wordt gecombineerd met meerregelige tekst, maar u moet ervoor zorgen dat u het met verschillende tekstgroottes test.
pt_br: Eu acho que é uma boa solução, de maneira geral, pareada com o uso de quebras de linha. Mas sempre teste sua aplicação com diferentes variações de tamanho.

# AdjustLayoutToScaledFontPage.AllowTextToIncrease.title
source: Allow text to control the size of the content
nl: Tekst toestaan de grootte van de inhoud te regelen
pt_br: Permitir que o texto controle o tamanho do conteúdo

# AdjustLayoutToScaledFontPage.AllowTextToIncrease.text1
source: Sometimes, the text does not define alone out content size, but it's paired with an image or something else that controls the dimensions.
nl: Soms bepaalt de tekst niet alleen de grootte van onze inhoud, maar wordt deze gecombineerd met een afbeelding of iets anders dat de afmetingen regelt.
pt_br: Na maioria das vezes, o texto não define o tamanho das nossas views. Quando está dentro de uma célula, ou associado a uma imagem, esses outros componentes costumam definir as dimensões exibidas.

# AdjustLayoutToScaledFontPage.AllowTextToIncrease.text2
source: To better support dynamic fonts, you need to make your layout expand beyond the size of the paired content, but keep everything still cohesive.
nl: Om dynamische lettertypen beter te ondersteunen, moet u uw lay-out uitbreiden buiten de grootte van de gekoppelde inhoud, maar alles nog steeds samenhangend houden.
pt_br: Para suportar fontes dinâmicas, você pode ajustar o seu layout para escalar junto com o tamanho da fonte, de uma forma que tudo se matenha coeso.

# AdjustLayoutToScaledFontPage.AllowTextToIncrease.comment1
source: This is the complicated part, you need to make the layout accounting for text changes and visualize what would break and handle it correctly so it keeps working with bigger fonts.
nl: Dit is het ingewikkelde deel, u moet de lay-out maken met het oog op tekstveranderingen en visualiseren wat zou breken en het correct behandelen zodat het blijft werken met grotere lettertypen.
pt_br: Essa é a parte mais cimplicada, você precisa implementar o layout já considerando as mudanças de dimensão do text (e testar com diferentes tamanhos também), e visualizar onde pode quebrar caso o texto aumente e ajustar o comportamento do layout corretamente.

# AdjustLayoutToScaledFontPage.AllowTextToIncrease.comment2
source: In this case, it would also be nice to set a minimum size for the content, in case of smaller fonts that could also break the expected layout.
nl: In dit geval is het ook goed om een minimale grootte voor de inhoud in te stellen, voor het geval van kleinere lettertypen die ook de verwachte lay-out kunnen breken.
pt_br: Nesse caso, também seria legal configurar um tamanho mínimo pro conteúdo, no caso de uma fonte menor que o esperado.

# AdjustLayoutToScaledFontPage.WhatOption.title
source: Which option should I use?
nl: Welke optie moet ik gebruiken?
pt_br: Qual opção eu devo usar?

# AdjustLayoutToScaledFontPage.WhatOption.text1
source: Well, that's the hard part. It depends. It depends on where the text is at, it depends on how we want to scale our content (can our cells get wider? Should we break the lines instead?)
nl: Nou, dat is het moeilijke gedeelte. Het hangt af. Het hangt ervan af waar de tekst staat, het hangt ervan af hoe we onze inhoud willen schalen (kan onze cellen breder worden? Moeten we in plaats daarvan de regels breken?)
pt_br: Bom, aí que está a questão. Depende. Depende de onde está o texto, de como ele vai mudar outros componentes na tela (nossas células podem ficar mais largas? Devemos usar quebras de linhas?)

# AdjustLayoutToScaledFontPage.WhatOption.comment1
source: That's why implementing Dynamic fonts after an app is ready and in production is so difficult. Literally anything can break.
nl: Daarom is het implementeren van dynamische lettertypen nadat een app klaar is en in productie is, zo moeilijk. Letterlijk alles kan breken.
pt_br: Por isso é extremamente complicado suportar fontes dinâmicas com um app já pronto e em produção. Literalmente tudo pode quebrar.

# AdjustLayoutToScaledFontPage.WhatOption.text2
source: But, such as adjusting the content to support screen readers, implementing dynamic fonts is a group work. Talk with your designers, question them "What should happen if this title had an enlarged font?", and bring all these discussion points to when you are building the layout.
nl: Maar net zoals het aanpassen van de inhoud om schermlezers te ondersteunen, is het implementeren van dynamische lettertypen een groepswerk. Praat met uw ontwerpers, stel hen de vraag "Wat zou er moeten gebeuren als deze titel een vergroot lettertype had?", en breng al deze discussiepunten naar voren wanneer u de lay-out bouwt.
pt_br: Mas, assim como suportar leitores de tela no seu conteúdo, implementar fontes dinâmicas é um trabalho de grupo. Converse com seus designers, com o time de produto, com outros desenvolvedores, e questione "O que deveria acontecer caso a fonte fossse maior?" e traga as pessoas mais próximas da discussão e já considere esses pontos enquanto você implementa novos layouts.

# AdjustLayoutToScaledFontPage.Example.title
source: Content title
nl: Inhoudstitel
pt_br: Título do conteúdo

# AdjustLayoutToScaledFontPage.Example.body
source: Content body some content
nl: Inhoudsbody enkele inhoud
pt_br: Corpo do texto com mais conteúdo

# AdjustLayoutToScaledFontPage.Example.description
source: Content description
nl: Inhoudsbeschrijving
pt_br: Descrição aqui embaixo

# IdentifyCurrentPreferredFontSizePage.title
source: Identify preferred content size
nl: Identificeer de voorkeursgrootte van de inhoud
pt_br: Identificar tamanho de fonte selecionado

# IdentifyCurrentPreferredFontSizePage.Intro.text1
source: When selecting the preferred font size on the device's settings, multiple sizes and options are available.
nl: Bij het selecteren van de voorkeursgrootte van het lettertype in de instellingen van het apparaat zijn meerdere maten en opties beschikbaar.
pt_br: Quando selecionando um tamanho de fonte nas configurações do dispositivo, múltiplas opções estão disponíveis.

# IdentifyCurrentPreferredFontSizePage.Intro.text2
source: Even without enabling the accessibility option, the user can still select different font sizes.
nl: Zelfs zonder de toegankelijkheidsoptie in te schakelen, kan de gebruiker nog steeds verschillende lettergroottes kiezen.
pt_br: Mesmo sem habilitar as opções de acessibilidade, é possível selecionar um tamanho de fonte preferido que é diferente do padrão.

# IdentifyCurrentPreferredFontSizePage.Intro.text3
source: You may want to identify the currently selected font size to take additional actions on your device, you can do that by checking the preferred content size category on UIApplication.
nl: U wilt mogelijk de momenteel geselecteerde lettergrootte identificeren om aanvullende acties op uw apparaat uit te voeren, u kunt dit doen door de voorkeursgroottecategorie van de inhoud te controleren in UIApplication.
pt_br: Você pode querer identificar qual o tamanho de fonte preferido selecionado no momento, e você pode fazer isso observandp 'preferredContentSizeCategory' do 'UIApplication'.

# IdentifyCurrentPreferredFontSizePage.Variations.title
source: Variations
nl: Variaties
pt_br: Variações

# IdentifyCurrentPreferredFontSizePage.Variations.text1
source: When the accessibility option is disabled, the size varies from extra small to extra extra extra large.
nl: Wanneer de toegankelijkheidsoptie is uitgeschakeld, varieert de grootte van extra klein tot extra extra extra groot.
pt_br: Quando as opções de acessibilidade estão desabilitadas, os tamanhos variam de extra pequeno a extra extra extra grande.

# IdentifyCurrentPreferredFontSizePage.Variations.text2
source: And when the accessibility option is enabled, it goes from accessibility medium to accessibility extra extra extra large.
nl: En wanneer de toegankelijkheidsoptie is ingeschakeld, gaat het van toegankelijkheid medium tot toegankelijkheid extra extra extra groot.
pt_br: E quando as opções de acessibilidade estão habilitadas, eles variam de 'accessibility medium' até 'accessibility large'.

# IdentifyCurrentPreferredFontSizePage.Variations.text3
source: The thing is: The accessibility medium is larger than then regular extra extra extra large size.
nl: Het ding is: de toegankelijkheid medium is groter dan de reguliere extra extra extra grote grootte.
pt_br: O problema é: O 'accessibility medium' é maior que o valor (sem acessibilidade), extra extra extra grande, o que pode ser muito confuso.

# IdentifyCurrentPreferredFontSizePage.Variations.comment1
source: The content below is a recriation of the system's settings, and it's just an example. Slide the indicator to see how the value changes.
nl: De inhoud hieronder is een nabootsing van de systeeminstellingen en het is slechts een voorbeeld. Schuif de indicator om te zien hoe de waarde verandert.
pt_br: O conteúdo abaixo é a recriação do seletor de tamanho de conteúdo na configuração do sispositivo. Mova o seletor e veja como as fontes mudam.

# IdentifyCurrentPreferredFontSizePage.Example.toggle
source: Larger Accessibility Sizes
nl: Grotere toegankelijkheidsmaten
pt_br: Tamanhos de Acessibilidade maiores

# IdentifyCurrentPreferredFontSizePage.List.title
source: Example list of sizes
nl: Voorbeeldlijst van maten
pt_br: Lista de exemplos

# DismissPage.title
source: Escape
nl: Sluiten

# DismissPage.text1
source: VoiceOver has a dedicated 'dismiss gesture', the Escape, which is used to close modals or pop the current view on the navigation stack.
nl: VoiceOver heeft een speciale 'sluit-gesture', de Escape, die wordt gebruikt om modals te sluiten of de huidige weergave op de navigatiestapel terug te gaan.
pt_br: O VoiceOver tem um gesto dedicado para fechar Modais e outros conteúdos: O 'Ecape'.

# DismissPage.comment1
source: Try it out! Enable VoiceOver and perform a 'Z' with 2 fingers.
nl: Probeer het uit! Schakel VoiceOver in en voer een 'Z' uit met 2 vingers.
pt_br: Você pode tentar executar esse gesto aqui mesmo! Faça um 'Z' com 2 dedos na tela.

# DismissPage.Handle.text1
source: On UIKit, you can add a custom handling to this gesture by implementing the 'perform escape' method.
nl: Op UIKit kunt u aangepaste behandeling toevoegen aan deze gesture door de methode 'sluiten uitvoeren' te implementeren.
pt_br: No UIKit, você pode adicionar um tratamento customizado implementando o método de 'perform escape'.

# DismissPage.Handle.text2
source: On SwiftUI, it's the same as adding a 'Magic Tap' action, but using the escape type.
nl: Op SwiftUI is het hetzelfde als het toevoegen van een 'Magic Tap'-actie, maar met gebruik van het escapetype.
pt_br: Já em SwiftUI, é a mesma maneira de adicionar um 'Magic Tap', mas usando o tipo `escape`.

source: Motion
nl: Beweging
pt_br: Movimento

# ReduceMotion.title
source: Reduce Motion
nl: Verminder Beweging
pt_br: Reduzir animações

# ReduceMotion.Intro.text1
source: Sometimes, we add moving items to our views. They may be some cool way to visualize something, an animation to present an item, a nice screen transition, or anything else at all.
nl: Soms voegen we bewegende items toe aan onze weergaven. Ze kunnen een leuke manier zijn om iets te visualiseren, een animatie om een item te presenteren, een mooie schermovergang, of iets anders heel anders.
pt_br: Às vezes, adicionamos movimento ou animações nas nossas views. É uma forma de apresentat algo de maneira mais legal, uma transição de tela, ou qualquer outra coisa.

# ReduceMotion.Intro.text2
source: The problem is: Some people may feel discomfort when observing these animations, due to motion sickness or similar issues.
nl: Het probleem is: sommige mensen kunnen zich ongemakkelijk voelen bij het observeren van deze animaties, vanwege bewegingsziekte of soortgelijke problemen.
pt_br: O problema é: Algumas pessoas podem ficar desconfortáveis quando vendo animações no uso de aplicações.

# ReduceMotion.Intro.text3
source: That's why iOS systems have a a built in feature that allows users to request for reduced animations while using applications.
nl: Daarom hebben iOS-systemen een ingebouwde functie waarmee gebruikers kunnen vragen om verminderde animaties tijdens het gebruik van applicaties.
pt_br: É por isso que o iOS tem opções de acessibilidade para permitir os usuários pedirem aos apps que reduzam animações.

# ReduceMotion.Disclaimer.text1
source: Apple's documentation suggests that if this property is 'True' UI should avoid large animations, especially those that simulate the third dimension.
nl: De documentatie van Apple suggereert dat als deze eigenschap 'Waar' is, UI grote animaties moet vermijden, vooral die de derde dimensie simuleren.
pt_br: A documentação da Apple sugere que, caso essa opção esteja ativada, elementos da interface devem evitar animações grandes, especialmente aquelas que usam efeitos 3D.

# ReduceMotion.Disclaimer.comment1
source: But as an overall guideline, we should usually disable all custom animations on views, parallax effects, and additional screen transitions.
nl: Maar als algemene richtlijn moeten we meestal alle aangepaste animaties op weergaven, parallax-effecten en aanvullende schermovergangen uitschakelen.
pt_br: Mas de maneira geral, devemos remover todas as animações customizadas, efeitos de paralaxe ou transições de tela adicionais.

# ReduceMotion.Disclaimer.text2
source: Go to settings and change the reduce motion option, then, check the examples below.
nl: Ga naar instellingen en wijzig de optie voor het verminderen van bewegingen, bekijk vervolgens de onderstaande voorbeelden.
pt_br: Vá até as configurações do dispositivo e mude a opção de 'Reduzir animações', então, obverve os exemplos abaixo.

# ReduceMotion.simpleAppearance
source: Small animations can be disabled as well, but they are not required to. As a general guide, we'd like to disable them as well.
nl: Kleine animaties kunnen ook worden uitgeschakeld, maar dit is niet vereist. Als algemene richtlijn willen we ze ook uitschakelen.
pt_br: Pequenas animações podem ser desativadas, mesmo que não seja necessário.

# ReduceMotion.simpleAppearance.text
source: Open more actions
nl: Open meer acties
pt_br: Abrir mais opções

# ReduceMotion.cardFlip
source: The example above used a 3D animation to flip the card when tapped. This is a fine example of animations that should be disabled.
nl: Het bovenstaande voorbeeld gebruikte een 3D-animatie om de kaart om te draaien wanneer erop werd getikt. Dit is een prima voorbeeld van animaties die moeten worden uitgeschakeld.
pt_br: O exemplo acima uma uma animação 3D para virar o cartão. Este ;e um bom exemplo de onde devemos desativar as animações caso esta feature esteja habilitada.

# ReduceMotion.cardFlip2
source: It's also a nice example to use Custom Actions for screen reader accessibility!
nl: Het is ook een mooi voorbeeld om aangepaste acties te gebruiken voor toegankelijkheid van schermlezers!
pt_br: É um bom exemplo também de onde usar ações customizadas para melhorar acessibilidade de leitores de tela!

# PreferCrossFadePage.title
source: Prefers cross-fade transitions
nl: Heeft voorkeur voor cross-fade-overgangen
pt_br: Preferir transições cross-fade

# PreferCrossFadePage.text1
source: This is an additional option inside the 'Reduce Motion' on the device's settings.
nl: Dit is een aanvullende optie in de 'Verminder beweging' in de instellingen van het apparaat.
pt_br: Esta é uma opção adicional dentro do 'Reduzir animações'.

# PreferCrossFadePage.text2
source: When enabled, screen transitions should be reduced to a cross-fade animation instead of sliding-in.
nl: Bij inschakeling moeten schermovergangen worden beperkt tot een cross-fade-animatie in plaats van schuifinvoer.
pt_br: Quando ativado, transições de tela devem ser reduzidas e alteradas para um cross-fade, ao invés de animações onde a tela se move até o lugar esperado.

# PreferCrossFadePage.text3
source: This will also change the default behavior for NavigationViews and NavigationStacks, without additional code necessary.
nl: Dit zal ook het standaardgedrag voor NavigationViews en NavigationStacks veranderen, zonder dat er extra code nodig is.
pt_br: Essa opção também altera o comportamento padrão da NavigationView ou de NavigationStacks sem precisar fazer mudanças adicionais no código.

# PreferCrossFadePage.comment1
source: This app uses a default navigation stack. Go to settings and change this accessibility option, then come back and try opening new scenes or going back to previous ones. The default slide transition should be replaced with cross-fades.
nl: Deze app gebruikt een standaardnavigatiestapel. Ga naar instellingen en wijzig deze toegankelijkheidsoptie, kom dan terug en probeer nieuwe scènes te openen of terug te gaan naar eerdere.
pt_br: Este app foi constru;ido uma navigation stack padrão, vá até as configurações do seu dispositivo, altere esta opção de acessibilidade e volte. Depois, navegue entre as telas do app e veja que a animação terá mudado para um cross-fade.
