Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

source: Dedicated page
nl: Toegewijde pagina
pt_br: Página dedicada

source: Select
nl: Selecteer
pt_br: Selecionar

source: Delete
nl: Verwijderen
pt_br: Deletar

source: Edit
nl: Bewerken
pt_br: Editar

source: Selected
nl: Geselecteerd
pt_br: Selecionado

source: Deleted
nl: Verwijderd
pt_br: Deletado

source: Edited
nl: Bewerkt
pt_br: Editado

source: Handle Action
nl: Handel Actie
pt_br: Tratar ação

source: Dismiss
nl: Afwijzen
pt_br: Fechar

source: Go Back
nl: Ga Terug
pt_br: Voltar

source: Tap to win
nl: Tik om te winnen
pt_br: Toque para vencer

source: Tap to change
nl: Tik om te veranderen
pt_br: Toque para alterar

source: Code copied!
nl: Code gekopieerd!
pt_br: Código copiado!

source: Copy Code
nl: Kopieer Code
pt_br: Copiar código

source: Close code view
nl: Sluit de code-weergave
pt_br: Fechar código

source: %@ code example.
nl: %@ code voorbeeld.
pt_br: exemplo de código %@

# codeHint
source: Tap twice to open code in full screen, and tap three times to copy.
nl: Tik twee keer om de code op volledig scherm te openen, en tik drie keer om te kopiëren.
pt_br: Toque duas vezes para ver o código em tela cheia, ou toque três vezes parta copiar.

source: Free shipping
nl: Gratis verzending
pt_br: Entrega grátis

source: Additional cost
nl: Extra kosten
pt_br: Custo adicional

source: Early access
nl: Vroege toegang
pt_br: Acesso antecipado

source: Extra bureaucracy
nl: Extra bureaucratie
pt_br: Burocracia extraß

source: Regular text
nl: Reguliere tekst
pt_br: Texto normal

source: Bold text
nl: Vette tekst
pt_br: Texto em negrito

source: Open Settings
nl: Open Instellingen
pt_br: Abrir configurações

source: Haptic
nl: Haptisch

source: Haptics
nl: Haptiek

source: Moon
nl: Maan
pt_br: Lua

source: Cloud
nl: Wolk
pt_br: Nuvem

source: Sun
nl: Zon
pt_br: Sol

source: Sunrise
nl: Zonsopgang
pt_br: Nascer do Sol

source: Snow
nl: Sneeuw
pt_br: Neve

source: Rain
nl: Regen
pt_br: Chuva

source: Fog
nl: Mist
pt_br: Neblina

source: Weather Icons
nl: Weer Iconen
pt_br: Ícones de Clima

# interactrion
source: Interaction
nl: Interactie
pt_br: Interação

source: Modal
nl: Modaal

source: Example
nl: Voorbeeld
pt_br: Exemplo

source: Examples
nl: Voorbeelden
pt_br: Exemplos

source: Lobster
nl: Kreeft
pt_br: Lagosta

source: Pumpkin
nl: Pompoen
pt_br: Abóbora

source: Ice cream
nl: IJs
pt_br: Sorvete

source: Flag
nl: Vlag
pt_br: Bandeira

source: Potato
nl: Aardappel
pt_br: Batata

source: Password
nl: Wachtwoord
pt_br: Senha

source: Puzzles
nl: Puzzels
pt_br: Jogos

source: Unfinished Puzzles
nl: Onvoltooide Puzzels
pt_br: Jogos em aberto

source: Completed Puzzles
nl: Voltooide Puzzels
pt_br: Jogos terminados

source: Pencil
nl: Potlood
pt_br: Lápis

source: Paper
nl: Papier
pt_br: Papel

source: Paper plane
nl: Papieren vliegtuig
pt_br: Avião de papel

source: Book
nl: Boek
pt_br: Livro

source: Bell
nl: Bel
pt_br: Sino

# Gestures.title
source: Gestures Guide
nl: Gids voor Gebaren
pt_br: Guia de Gestos

# Gestures.text1
source: Here's an initial guide to start using VoiceOver gestures.
nl: Hier is een eerste gids om te beginnen met het gebruik van VoiceOver-gebaren.
pt_br: Aqui um guia inicial de como usar alguns dos gestos do VoiceOver.

# Gestures.swipeRight.description
source: Move cursor to the next element
nl: Verplaats de cursor naar het volgende element
pt_br: Mover o cursor para o próximo elemento.

# Gestures.swipeLeft.description
source: Move cursor to the previous element
nl: Verplaats de cursor naar het vorige element
pt_br: Mover o cursor para o elemento anterior

# Gestures.swipeUp.description
source: Change Rotor filter / Increase adjustable element / Change selected custom action
nl: Verander Rotor-filter / Verhoogbaar element vergroten / Geselecteerde aangepaste actie wijzigen
pt_br: Mudar filtro do Rotor / Aumentar elemento ajustável / Mudar ação customizada

# Gestures.swipeDown.description
source: Change Rotor filter / Decrease adjustable element / Change selected custom action
nl: Verander Rotor-filter / Verlaagbaar element verlagen / Geselecteerde aangepaste actie wijzigen
pt_br: Mudar filtro do Rotor / Diminuir elemento ajustável / Mudar ação customizada

# Gestures.singleTap.description
source: Read focused element
nl: Lees gefocust element voor
pt_br: Ler elemento

# Gestures.doubleTap.description
source: Activate element, the same as tapping it when the VoicOver is disabled.
nl: Activeer element, hetzelfde als tikken wanneer VoiceOver is uitgeschakeld.
pt_br: Ativar elemento, o mesmo que clicar quando o VoiceOver está desativado.

# Gestures.tripleTap.description
source: Long press gesture
nl: Lang indrukken
pt_br: Gesto de 'Long press'

# Gestures.twoFingersSingleTap.description
source: Pause/Play reading. You can make VoiceOver pause the current reading, and by making the same gesture again, it will keep going from where it stoped.
nl: Pauzeer/Afspelen lezen. U kunt VoiceOver de huidige lezing laten pauzeren, en door dezelfde beweging opnieuw te maken, gaat het verder vanaf waar het gestopt is.
pt_br: Pausar/continuar leitura. Você pode fazer o VoiceOver pausar a leitura atual e depois retomá-la, usando o mesmo gesto.

# Gestures.twoFingersDoubleTap.description
source: Execute Magic Tap.
nl: Voer een Magische Tik uit.
pt_br: Executar o 'Magic Tap'.

# Gestures.twoFingersSwipeUp.description
source: Read from top - will move the cursor to the top of the page.
nl: Lees vanaf boven - verplaatst de cursor naar de bovenkant van de pagina.
pt_br: Ler do topo. Move o cursor para o começo da tela.

# Gestures.twoFingersSwipeDown.description
source: Read all - will starting readin the content automatically.
nl: Lees alles - begint de inhoud automatisch te lezen.
pt_br: Ler tudo. Começa a ler o conteúdo automaticamente.

# Gestures.threeFingersSwipeUp.description
source: Scroll down.
nl: Scroll naar beneden.
pt_br: Scroll para baixo.

# Gestures.threeFingersSwipeDown.description
source: Scroll up.
nl: Scroll omhoog.
pt_br: Scroll para cima.

# Gestures.threeFingersSwipeLeft.description
source: Scroll right.
nl: Scroll naar rechts.
pt_br: Scroll para a direita.

# Gestures.threeFingersSwipeRight.description
source: Scroll left.
nl: Scroll naar links.
pt_br: Scroll para a esquerda.

# Gestures.threeFingersSingleTap.description
source: Read item summary. It will also describe the cursor position on the screen.
nl: Lees item samenvatting. Het zal ook de positie van de cursor op het scherm beschrijven.
pt_br: Resumo do item. Lê também a posição do cursor na tela.

# Gestures.threeFingersDoubleTap.description
source: Mute/unmute the screen reader
nl: Dempen/ongedempt maken van de schermlezer
pt_br: Mutar/Desmutar o leitor.

# Gestures.threeFingersTripleTap.description
source: Enable/disable the screen curtain. Turns the screen off but the content is still running.
nl: Schermgordijn in-/uitschakelen. Schakelt het scherm uit maar de inhoud blijft draaien.
pt_br: Ligar/Desligar cortina de fumaça. Desliga a tela do aparelho com o VoiceOver ainda executando.

# Gestures.fourFingersDoubleTap.description
source: Start/Stop gesture helper. When enabled, it will tell every gesture performed and what it does.
nl: Start/stop hulp bij gebaren. Wanneer ingeschakeld, vertelt het elke uitgevoerde beweging en wat het doet.
pt_br: Ajuda de Gestos. Quando ativo, irá descrever cada gesto performado.

# Gestures.helper
source: Gesture Helper
nl: Gebarenhelper
pt_br: Ajuda de gestos

# Gestures.reading
source: Reading
nl: Lezen
pt_br: Leitura

# Gestures.dismiss.description
source: Gesture to dismiss modals and pop to preview view on navigation stack.
nl: Gebaar om modals te sluiten en terug te gaan naar de preview-weergave op de navigatiestapel.
pt_br: Gesto de fechar conteúdo. Fecha modais ou volta pra página anterior na navegação.

# Gesture.swipeRight
source: Swipe Right
nl: Veeg naar rechts
pt_br: Swipe para direita

# Gesture.swipeLeft
source: Swipe Left
nl: Veeg naar links
pt_br: Swipe para esquerda

# Gesture.swipeUp
source: Swipe Up
nl: Veeg omhoog
pt_br: Swipe para cima

# Gesture.swipeDown
source: Swipe Down
nl: Veeg omlaag
pt_br: Swipe para baixo

# Gesture.singleTap
source: Single Tap
nl: Enkele tik
pt_br: Toque único

# Gesture.doubleTap
source: Double Tap
nl: Dubbele tik
pt_br: Toque duplo

# Gesture.tripleTap
source: Triple Tap
nl: Drievoudige tik
pt_br: Toque triplo

# Gesture.twoFingersSingleTap
source: Two fingers single Tap
nl: Twee vingers enkele tik
pt_br: Toque único com 2 dedos

# Gesture.twoFingersDoubleTap
source: Two fingers double Tap
nl: Twee vingers dubbele tik
pt_br: Toque duplo com 2 dedos

# Gesture.twoFingersSwipeUp
source: Two fingers swipe up
nl: Twee vingers omhoog vegen
pt_br: Swipe para cima com 2 dedos

# Gesture.twoFingersSwipeDown
source: Two fingers swipe down
nl: Twee vingers omlaag vegen
pt_br: Swipe para baixo com 2 dedos

# Gesture.threeFingersSwipeUp
source: Three fingers swipe up
nl: Drie vingers omhoog vegen
pt_br: Swipe para cima com 3 dedos

# Gesture.threeFingersSwipeDown
source: Three fingers swipe down
nl: Drie vingers omlaag vegen
pt_br: Swipe para baixo com 3 dedos

# Gesture.threeFingersSwipeLeft
source: Three fingers swipe left
nl: Drie vingers naar links vegen
pt_br: Swipe para esquerda com 3 dedos

# Gesture.threeFingersSwipeRight
source: Three fingers swipe right
nl: Drie vingers naar rechts vegen
pt_br: Swipe para direita com 3 dedos

# Gesture.threeFingersSingleTap
source: Three fingers single tap
nl: Drie vingers enkele tik
pt_br: Toque único com 3 dedos

# Gesture.threeFingersDoubleTap
source: Three fingers double tap
nl: Drie vingers dubbele tik
pt_br: Toque duplo com 3 dedos

# Gesture.threeFingersTripleTap
source: Three fingers triple tap
nl: Drie vingers drievoudige tik
pt_br: Toque triplo com 3 dedos

# Gesture.fourFingersDoubleTap
source: Four fingers double tap.
nl: Vier vingers dubbele tik.
pt_br: Toque duplo com 4 dedos

# Gesture.dismiss
source: 'Z' with 2 fingers.
nl: 'Z' met 2 vingers.

# Gesture.accessible
source: Animation representing the gesture for %@
nl: Animatie die het gebaar voor %@ vertegenwoordigt

# DynamicFonts.title
source: Dynamic Fonts
nl: Dynamische Lettertypen
pt_br: Fontes dinâmicas

# DynamicFonts.implementing
source: Implementing Dynamic Fonts
nl: Implementatie van Dynamische Lettertypen
pt_br: Implementando fontes dinâmicas

# Fonts.title
source: Fonts
nl: Lettertypen
pt_br: Fontes

# AboutFonts.title
source: About Fonts
nl: Over Lettertypen
pt_br: Sobre fontes

# AboutFonts.Intro.comment1
source: Fonts are cool.
nl: Lettertypen zijn gaaf.
pt_br: Fontes são legais.

# AboutFonts.Intro.text1
source: A font is a particular size, weight and style of lettering. I like to think about the 'drawing' of the characters that make the text.
nl: Een lettertype is een bepaalde grootte, gewicht en stijl van letters. Ik denk graag na over het 'tekenen' van de tekens die de tekst vormen.
pt_br: Uma 'fonte' é um tipo, tamanho, peso e estilo particular de um texto. Eu gosto de pensar como se fosse o 'desenho' de cada caracter.

# AboutFonts.Intro.text2
source: You are currently reading a text, written in a specific font.
nl: Je leest momenteel een tekst, geschreven in een specifiek lettertype.
pt_br: Vocês está nesse momento lendo um texto, escrito em uma fonte específica.

# AboutFonts.Intro.comment2
source: This is the iOS's system font, and it is called SF Pro.
nl: Dit is het systeemlettertype van iOS en het heet SF Pro.
pt_br: Esta é a fonte padrão do sistema iOS, SF Pro.

# AboutFonts.Intro.text3
source: There are several fonts. Hundreds and hundreds of thousands. And we may decide to use a custom font for our app, maybe it fits better in our content, maybe it's part of our global identity with other platforms, maybe we want to evoke a specifc feeling from the font...
nl: Er zijn verschillende lettertypen. Honderden en honderdduizenden. En we kunnen besluiten om een aangepast lettertype voor onze app te gebruiken, misschien past het beter bij onze inhoud, misschien maakt het deel uit van onze wereldwijde identiteit met andere platforms, misschien willen we een specifiek gevoel oproepen vanuit het lettertype...
pt_br: Existem inúmeras fontes. Centenas de centenas de milhares. E podemos decidir usar uma fonte customizada na nossa aplicação, talvez por se encaixar melhor no nosso conteúdo, ou talvez seja parte da identidade global da sua marca.

# AboutFonts.Intro.text4
source: But the font is how we direclty display content to the user. Most of the time we expect the user to READ the content. So, the Font used to render it is extremely important.
nl: Maar het lettertype is hoe we de inhoud rechtstreeks aan de gebruiker tonen. Het grootste deel van de tijd verwachten we dat de gebruiker de inhoud LEEST. Dus, het lettertype dat wordt gebruikt om het weer te geven, is uiterst belangrijk.
pt_br: Mas a fonte é como apresentamos conteúdo diretamente pro usuário. E a maioria das vezes espeamos que os usuários sejam capazes de LER o conteúdo. Então, a maneira como a fonte é apresentada é extremamente importante.

# AboutFonts.Intro.text5
source: The basic is: We want the font to be readable.
nl: De basisregel is: We willen dat het lettertype leesbaar is.
pt_br: O básico é: O texto tem que ser legível.

# AboutFonts.Intro.comment3
source: But since we already stablished that not everyone percieves content or colors the same way...
nl: Maar aangezien we al hebben vastgesteld dat niet iedereen inhoud of kleuren op dezelfde manier waarneemt...
pt_br: Mas já estabelecemos que nem todo mundo percebe conteúdo ou cores da mesma forma.

# AboutFonts.Intro.text6
source: The second part is: We want everyone, who can read, to be able to read our content.
nl: Het tweede deel is: We willen dat iedereen die kan lezen, onze inhoud kan lezen.
pt_br: E em segundo: Queremos que todos, que possam ler, consigam ler nosso conteúdo.

# AboutFonts.Intro.comment4
source: And that's where accessibility comes and it gets interesting.
nl: En dat is waar toegankelijkheid binnenkomt en het interessant wordt.
pt_br: E é aí que acessibilidade começa a ficar interessante

# AboutFonts.link
source: Check some different fonts!
nl: Bekijk enkele verschillende lettertypen!
pt_br: Veja mais fontes online.

# UIContentSizeCategory.Intro.text1
source: The 'UIContentSizeCategory' is a system enum that represents the user's selected preferred content size.
nl: De 'UIContentSizeCategory' is een systeem-enum dat de geselecteerde voorkeursinhoudsgrootte van de gebruiker vertegenwoordigt.
pt_br: O 'UIContentSizeCategory' é um enum do sistema que representa o tamanho preferido de fontes selecionado pelo usuário.

# UIContentSizeCategory.Intro.text2
source: It has 12 different size options from extra small to extra extra extra large, then the 'accessibility sizes' from accessibility medium to accessibility extra extra extra large. (Yep, 3 extras)
nl: Het heeft 12 verschillende grootteopties van extra klein tot extra extra extra groot, vervolgens de 'toegankelijkheidsgroottes' van toegankelijkheid medium tot toegankelijkheid extra extra extra groot. (Ja, 3 extra's)
pt_br: Ele tem 12 opções diferentes de tamanho, de extra pequeno até extra extra extra grande. E então, os 'tamanhos de acessibilidade' de 'accessibility medium' até 'accessibility extra extra extra large' (Isso mesmo, 3 extras).

# UIContentSizeCategory.Intro.comment1
source: The accessibility sizes are larger than the other ones, even if their name starts at 'accessibility medium' it's still larger than the regular 'extra extra extra large' size.
nl: De toegankelijkheidsgroottes zijn groter dan de andere, zelfs als hun naam begint bij 'toegankelijkheid medium', is het nog steeds groter dan de reguliere 'extra extra extra grote' grootte.
pt_br: Os tamanhos de acessibilidade são maiores que os demais, mesmo que o nome do menos deles seja 'accessibility medium', ele ainda é maior que o tamanho 'extra extra extra grande'.

# UIContentSizeCategory.List.title
source: List of UIContentSizeCategory
nl: Lijst van UIContentSizeCategory
pt_br: Lista de UIContentSizeCategory

# UIContentSizeCategory.List.text1
source: Here's a list of all the available content size categories. You can check the 'Identify preferred content size' page to get more information on how to properly identify them.
nl: Hier is een lijst van alle beschikbare inhoudsgroottes. U kunt de pagina 'Voorkeursinhoudsgrootte identificeren' bekijken voor meer informatie over hoe u deze correct kunt identificeren.
pt_br: Aqui segue uma lista de todos os tamanhos disponíveis no sistems. Você pode ver a página 'Identificar tamanho de fonte selecionado' para mais informações.

# UIContentSizeCategory.List.comment1
source: Although, on code, usually you should not check this information directly and just use the UIFontMetric or system fonts to scale your font to the correct size.
nl: Hoewel, in code, moet je deze informatie meestal niet rechtstreeks controleren en gewoon de UIFontMetric of systeemlettertypen gebruiken om je lettertype naar de juiste grootte te schalen.
pt_br: Mas, no código, geralmente não devemos verificar qual o tamanho esperado da fonte, apenas deixar que ele escale nosso conteúdo corretamente, seja usando o UIFontMetric ou as fontes definidas do sistema.

# UIContentSizeCategory.List.current
source: This is your current content size.
nl: Dit is je huidige inhoudsgrootte.
pt_br: Este é o seu 'content size' atual.

# UIContentSizeCategory.Code.text1
source: You can check the system's font size by using the following code.
nl: Je kunt de lettergrootte van het systeem controleren met de volgende code.
pt_br: Você pode verificar o tamanho das fontes do sistema usando o código a seguir.

source: Font size: %@
nl: Lettergrootte: %@
pt_br: Tamanho da fonte: %@

# SizeAndWeight.title
source: Size and Weight
nl: Grootte en Gewicht
pt_br: Peso e Tamanho

# ImplementingDynamicFonts.title
source: Scaling Fonts Automatically
nl: Lettertypen automatisch schalen
pt_br: Escalando fontes automaticamente

# ImplementingDynamicFonts.Intro.text1
source: Scaling fonts automatically is the property of a label or text to automatically increase the font size according to the user's accessibility settings.
nl: Het automatisch schalen van lettertypen is de eigenschap van een label of tekst om automatisch de lettergrootte te vergroten volgens de toegankelijkheidsinstellingen van de gebruiker.
pt_br: Escalar fontes automaticamente é a capacidade de uma Label ou Text de aumentar o tamanho da sua fonte automaticamente de aocrdo com a configuração de acessibilidade do usuário.

# ImplementingDynamicFonts.Intro.comment1
source: Thats what we call 'Dynamic fonts'.
nl: Dat noemen we 'Dynamische lettertypen'.
pt_br: Isso é o que chamamos de 'Fontes dinâmicas'.

# ImplementingDynamicFonts.Intro.text2
source: To support this, we stop using 'fixed' font sizes, and start working with 'text styles'.
nl: Om dit te ondersteunen, stoppen we met het gebruik van 'vaste' lettergroottes en beginnen we te werken met 'tekststijlen'.
pt_br: Para suportar isso, temos que parar de usar tamanhos fixos de fontes, e começar a trabalhr com 'estilos de texto'.

# ImplementingDynamicFonts.Intro.comment2
source: In the example above, we are using a fixed font size (36), which will not cut it if we are expecting our font to scale itself automatically.
nl: In het bovenstaande voorbeeld gebruiken we een vaste lettergrootte (36), wat niet voldoende zal zijn als we verwachten dat ons lettertype automatisch wordt geschaald.
pt_br: No exemplo acima, estamos usando uma fonte de tamanho fixo (36), que não vai servir caso queiramos que ela escale automaticamente de tamanho.

# ImplementingDynamicFonts.TextStyles.title
source: Text Styles
nl: Tekststijlen
pt_br: Estilos de texto

# ImplementingDynamicFonts.TextStyles.text1
source: Text styles represent a context for your font (title, body, caption...), instead of a fixed font size.
nl: Tekststijlen vertegenwoordigen een context voor je lettertype (titel, body, bijschrift...), in plaats van een vaste lettergrootte.
pt_br: Extilos de text, ou 'Text styles', representam um contexto onde sua fonte pode ser usada (corpo do texto, título, legenda...).

# ImplementingDynamicFonts.TextStyles.text2
source: The font size will be defined by what is the current configuration on the device's settings, and it will scale every text style accordingly.
nl: De lettergrootte wordt bepaald door wat de huidige configuratie is in de instellingen van het apparaat, en het zal elke tekststijl dienovereenkomstig schalen.
pt_br: O tamanho da fonte será definido de acordo com a configuração do dispositivo, e será diferente para cada tamanho de fonte selecionado.

# ImplementingDynamicFonts.TextStyles.comment1
source: So don't worry, your content will still have differences between titles and bodies and comments, and every other text-style you are using.
nl: Dus maak je geen zorgen, je inhoud zal nog steeds verschillen tussen titels en lichamen en opmerkingen, en elke andere tekststijl die je gebruikt.
pt_br: Então, não se preocupe, seu conteúdo terá diferenças de tamanho entre títulos, corpos, legendas e quaisquer outros estilos de texto que você esteja usando.

# ImplementingDynamicFonts.TextStyles.text3
source: Also, If the 'adjustsFontForContentSizeCategory' property is set to 'False', the font will initially be the right size, but it won't respond to text-size changes the user makes in Settings or Control Center.
nl: Ook, als de eigenschap 'pastLettertypeAanVoorToegankelijkheid' is ingesteld op 'False', zal het lettertype aanvankelijk de juiste grootte hebben, maar het reageert niet op tekstgrootteveranderingen die de gebruiker aanbrengt in Instellingen of het Bedieningspaneel.
pt_br: Além disso, se a propriedade 'adjustsFontForContentSizeCategory' estiver configurada como `False`, a fonte vai estar do tamanho correto quando for exibida, mas não vai se ajustar automaticamente caso ocorram mudanças no tamanho do texto enquanto está sendo exibida.

# ImplementingDynamicFonts.SystemFonts.title
source: System Fonts
nl: Systeemlettertypen
pt_br: Fontes do sistema

# ImplementingDynamicFonts.SystemFonts.text1
source: The easiest way to support scaling your fonts automatically, is using the system defined text styles and fonts.
nl: De eenvoudigste manier om het schalen van je lettertypen automatisch te ondersteunen, is door de systeemgedefinieerde tekststijlen en lettertypen te gebruiken.
pt_br: A maneira mais fácil de suportar fontes dinâmicas é usando fontes e estilos do sistema.

# ImplementingDynamicFonts.SystemFonts.text2
source: They are going to work seemelesly with the user changes on font sizes.
nl: Ze werken naadloos samen met de wijzigingen die de gebruiker aanbrengt in de lettergroottes.
pt_br: Eles vão funcionar de maneira transparente com as mudanças de tamanho de fonte nas configurações do dispositivo.

# ImplementingDynamicFonts.SystemFonts.comment1
source: The tough part comes with custom fonts, that we'll be discussing more on the following pages.
nl: Het moeilijke komt met aangepaste lettertypen, waar we het later op de volgende pagina's over zullen hebben.
pt_br: A parte mais complicada é suportar o mesmo comportamento com fontes customizadas. Iremos discutir melhor nas páginas seguintes este assunto.
