Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# PreferCrossFadePage.text4
source: You can also check if this feature is enabled to make manual adjustments.
nl: U kunt ook controleren of deze functie is ingeschakeld om handmatige aanpassingen te maken.
pt_br: Você também pode verificar se esta opçã está habilitada para fazer tratamentos manuais nas suas animações..

# PreferCrossFadePage.comment2
source: When enabled, this also means 'Reduce Motion' is also enabled.
nl: Bij inschakeling betekent dit ook dat 'Verminder beweging' is ingeschakeld.
pt_br: Quando ativado, tamb;em signifca que a opção 'Reduzir animações' também está ativada.

source: Dark Mode
nl: Donkere modus

# lighMode
source: Light Mode
nl: Lichte modus

source: You are currently on: %@
nl: U bevindt zich momenteel op: %@
pt_br: Você está no: %@

# WhatIsDarkMode.title
source: What is dark mode?
nl: Wat is de donkere modus?
pt_br: O que é 'Dark Mode'?

# WhatIsDarkMode.Intro.text1
source: Dark mode is the ability to change the interface to a darker appearance. Where, usually, the background consists in darker colors and written content in lighter colors.
nl: Donkere modus is de mogelijkheid om de interface naar een donker uiterlijk te veranderen. Hierbij bestaat de achtergrond doorgaans uit donkere kleuren en de geschreven inhoud uit lichtere kleuren.
pt_br: Modo escuro, ou 'Dark mode', é a habilidade de mudar a interface para uma aparência mais escura. Onde, geralmente, as cores de fundo consistem em cores escuras sobrepostas por conteúdo em cores mais claras.

# WhatIsDarkMode.Intro.comment1
source: The existence of a dark mode also implies the existence of a light mode, which is the opposite use of colors - light background and dark content.
nl: Het bestaan van een donkere modus impliceert ook het bestaan van een lichte modus, die het tegenovergestelde gebruik van kleuren is - een lichte achtergrond en donkere inhoud.
pt_br: A existência de um modo escuro implica na existência o modo claro, ou 'light mode', que é o oposto do modo escuro - cores de fundo claras com elementos escuros na frente.

# WhatIsDarkMode.Intro.text2
source: It is, sometimes, an aesthetic preference for the user. In MacOS it can be even automatically set to change on specific ambient or lighting conditions.
nl: Het is soms een esthetische voorkeur van de gebruiker. In MacOS kan het zelfs automatisch worden ingesteld om te veranderen op specifieke omgevings- of lichtomstandigheden.
pt_br: Às vezes, é uma preferência estética para o usuário. No MacOS pode ser configurado para alternar entre os temas de acrodo com condições do ambiente de luminosidade.

# WhatIsDarkMode.Intro.text3
source: But the deal here is that supporting dark mode can be a form of accessibility. The user can prefer using it for any reason, reading light content maybe feels better on top of a dark background, specially on low-light environments, or just felling more comfortable with less light comming from the device.
nl: Maar waar het hier om gaat, is dat het ondersteunen van de donkere modus een vorm van toegankelijkheid kan zijn. De gebruiker kan ervoor kiezen om het om welke reden dan ook te gebruiken; het lezen van lichte inhoud voelt misschien beter aan op een donkere achtergrond, vooral in omgevingen met weinig licht, of gewoon comfortabeler voelen met minder licht van het apparaat.
pt_br: Mas, além disso, suportar o Dark mode pode ser uma forma de acessibilidade. Os usuários podem preferir a leitura de conteúdo claso no fundo escuro, especialmente em ambientes de pouca luz.

# WhatIsDarkMode.Intro.comment2
source: You can read more on the 'Invert colors' page for more insights into different content colors.
nl: Lees meer op de pagina 'Kleuren omkeren' voor meer inzichten in verschillende kleuren voor inhoud.
pt_br: Você pode ler mais na página sobre Inverter socres para mais informações.

# WhatIsDarkMode.DoINeedIt.title
source: Do I need to support dark mode?
nl: Moet ik de donkere modus ondersteunen?
pt_br: Preciso ter um modo escuro?

# WhatIsDarkMode.DoINeedIt.text1
source: Sometimes, your interface does not need to support dark mode. Maybe it's a game and the colors have been specifically chosen for it, or the content's color take a bigger part in what your app does, so supporting dark mode is not an option.
nl: Soms hoeft uw interface de donkere modus niet te ondersteunen. Misschien is het een spel en zijn de kleuren specifiek voor het spel gekozen, of de kleur van de inhoud speelt een grotere rol in wat uw app doet, dus het ondersteunen van de donkere modus is geen optie.
pt_br: Às vezes, sua interface não precisa suportar o modo escure. Tallvez seja um jogo que tem a interface com cores especificamente selecionadas, ou a cor do conteúdo tem um papel maior na compreensão da sua aplicação.

# WhatIsDarkMode.DoINeedIt.text2
source: But when we are talking about apps that are mostly written content, so the user needs to read a lot of things while using the application, or use some shade of white as the default background color, these are good examples of apps that should support dark mode.
nl: Maar als we het hebben over apps die voornamelijk uit geschreven inhoud bestaan, zodat de gebruiker veel dingen moet lezen tijdens het gebruik van de applicatie, of gebruikmaken van een of andere schaduw van wit als de standaard achtergrondkleur, dan zijn dit goede voorbeelden van apps die de donkere modus moeten ondersteunen.
pt_br: Mas quando estamos falando de apps que, em sua maioria, são conteúdo escrito, que o usuário precisa ler para compreender e entender, ou usam branco como a cor padrão de cundo, são bons exemplos de apps que poderiam suportar o modo escuro.

# WhatIsDarkMode.DoINeedIt.text3
source: Maybe to give the aesthetic choice, but also to support those who prefer the dark mode to read the content.
nl: Misschien om de esthetische keuze te geven, maar ook om degenen te ondersteunen die de voorkeur geven aan de donkere modus om de inhoud te lezen.
pt_br: Talvez para dar a escolha estética, mas também suportar aqueles que preferem o modo escuro para legibilidade do conteúdo ou melhorar a leitura em ambientes de baixa luminosidade.

# WhatIsDarkMode.ThisAppSupports.title
source: This app supports dark mode!
nl: Deze app ondersteunt de donkere modus!
pt_br: Este app suporta o dark mode!

# WhatIsDarkMode.ThisAppSupports.text1
source: The Accessibility Handbook fully supports dark mode. If you are using and iOS device, you can change you appearance on the system's settings.
nl: De Accessibility Handbook ondersteunt volledig de donkere modus. Als u een iOS-apparaat gebruikt, kunt u uw uiterlijk wijzigen in de instellingen van het systeem.
pt_br: O Handbook suporta o modo escuro. Se você está usando um dispositivo iOS, você pode mudar sua aparência nas configurações do disposiivo.

# WhatIsDarkMode.ThisAppSupports.text2
source: Or use the Control center menu (the system's pull down menu) as a shortcut, by long pressing the display brightness option, and it will display a control to select between light and dark modes.
nl: Of gebruik het Control Center-menu (het uittrekbare menu van het systeem) als snelkoppeling, door lang op de optie voor de helderheid van het display te drukken, en er wordt een bediening weergegeven om te schakelen tussen lichte en donkere modi.
pt_br: Ou usar o centro de controle (o menu que você puxa para baixo do canto superior direito) como um atalho. Dê um 'long press' nas opções de luminosidade da sua tela, e ele irá mostrar a opção de alternar entre os modos claro e escuro.

# WhatIsDarkMode.ThisAppSupports.text3
source: And if you are running this on an iOS simulator on a Mac, you can quickly change the appearance option with the keyboard command.
nl: En als u dit op een iOS-simulator op een Mac gebruikt, kunt u de verschijningsinstelling snel wijzigen met het toetsenbordcommando.
pt_br: E se você está usando um simulador iOS no Mac, você pode mudar a aparência rapidamente usando um atalho no teclado.

# WhatIsDarkMode.ThisAppSupports.command
source: Command + shift + A
nl: Commando + shift + A

# WhatIsDarkMode.ThisAppSupports.comment1
source: I strongly suggest reading the content on the Apple's 'Human Interface Guidelines' about Dark Mode.
nl: Ik raad ten zeerste aan de inhoud te lezen op de 'Human Interface Guidelines' van Apple over de donkere modus.
pt_br: Eu recomendo fortemente ler a documentação da Applu no 'Human Interface Guidelines' sobre Dark Mode.

# WhatIsDarkMode.ThisAppSupports.image
source: Example of the Control center menu after long pressing the displays brightness options.
nl: Voorbeeld van het Control Center-menu na lang drukken op de helderheidsopties van het scherm.
pt_br: Exemplo do centro de controle depois de um long press nas opções de luminosidade do display.

# Appearances.title
source: Appearance changes
nl: Wijzigingen in uiterlijk
pt_br: Mudanças de aparência

# Appearances.Intro.text1
source: In this context, appearences is the group of possible interface color schemes the users can select on their iOS devices. Currently: dark or light modes.
nl: In deze context is uiterlijk de groep mogelijke kleurenschema's van de interface die gebruikers kunnen selecteren op hun iOS-apparaten. Momenteel: donkere of lichte modi.
pt_br: Neste contexto, 'aparências' é o grupo de possíveis esquema de cor da interface que o usuário pode selecionar. Atualmente: Claro ou Escuro.

# Appearances.Intro.text2
source: We can identify which of these the user has currently selected and adjust our content accordingly.
nl: We kunnen identificeren welke hiervan de gebruiker momenteel heeft geselecteerd en onze inhoud dienovereenkomstig aanpassen.
pt_br: Podemos identifica qual destes o usuário tem selecionado e ajustar nosso conteúdo de acordo.

# Appearances.Code.title
source: Identify current color scheme
nl: Huidig kleurenschema identificeren
pt_br: Identifica esquema de cores

# Appearances.Code.text1
source: In SwiftUI, it's as easy as an Environment variable. So it will automatically be notified whenever the user changes this setting, and your app will adjust itself automatically.
nl: In SwiftUI is het zo eenvoudig als een omgevingsvariabele. Het wordt dus automatisch op de hoogte gesteld wanneer de gebruiker deze instelling wijzigt, en uw app past zich automatisch aan.
pt_br: Em SwiftUI, é tão fácil quanto usar uma variável de ambiente. Então, sua UI será automaticamente notificada quando um usuário mudar essa configuração e irá atualizar a sua interface automaticamente.

# Appearances.Code.text2
source: And, of course, things are a little more complicated in UIKit, you need to use the 'UITraitCollection' object.
nl: En natuurlijk zijn dingen een beetje ingewikkelder in UIKit, je moet het object 'UITraitCollection' gebruiken.
pt_br: E, claro, em UIKit as coisas são um pouco mais complicadas. Você vai precisar usar o objeto de 'UITraitCollection'.

# Appearances.Code.comment1
source: The main complication is the existence of the `unspecified` case in the 'UIUserInterfaceStyle' enum, (because of course it exists) but in this case, just throw your default variation of the content.
nl: De belangrijkste complicatie is het bestaan van de `unspecified` case in het 'UIUserInterfaceStyle' enum (omdat het natuurlijk bestaat), maar in dit geval gooi je gewoon je standaardvariant van de inhoud.
pt_br: A grande diferença é a existência de um caso `unspecified` no enum 'UIUserInterfaceStyle', (porque é claro que ele existe), mas nesse caso, você pode usar o 'unspecified' como o seu esquema padrão de cores.

# Appearances.Code.text3
source: And, in order to handle dynamic changes on the user interface style, you need to listen to changes on the trait collection object in a UIView or UIViewController, and update your content whenever it changes.
nl: En om dynamische wijzigingen in de gebruikersinterfacestijl te verwerken, moet je luisteren naar wijzigingen op het trait collection-object in een UIView of UIViewController, en je inhoud bijwerken telkens wanneer deze verandert.
pt_br: E, para suportar mudanças dinâmicas no esquema de cores com seua aplicação aberta, você precisa ouvir as mudanças no trait collection, e atualizar sua interface quando ela mudar o esquema de cores.

# Appearances.supportingDarkMode
source: Supporting dark mode.
nl: Ondersteuning van de donkere modus.
pt_br: Suportando o modo escuro

# DynamicContent.title
source: Dynamic Assets
nl: Dynamische assets
pt_br: Assets Dinâmicos

# DynamicContent.Intro.text1
source: When talking about supporting dark mode, we do not need to talk only about changing colors between the color schemes, but other contents can also be adapted to different modes.
nl: Als we het hebben over het ondersteunen van de donkere modus, hoeven we het niet alleen te hebben over het veranderen van kleuren tussen de kleurenschema's, maar kunnen andere inhoudstypen ook worden aangepast aan verschillende modi.
pt_br: Quando falamos sobre suportar o modo escuro, não estamos falando apenas de cores, mas outros conteúdos podem ser adaptados para esquema de cores diferentes.

# DynamicContent.Intro.text2
source: Here we'll be addressing assets, specially images, but the same thing applies to color assets.
nl: Hier zullen we het hebben over assets, met name afbeeldingen, maar hetzelfde geldt voor kleurassets.
pt_br: Aqui vamos discutir melhor assets, em especial imagens, mas o mesmo se aplica para assets de cores.

# DynamicContent.XCTAssets.text1
source: When using XCAssets on Xcode, they provide options to support different assets for different color schemes, along side multiple assets for different screen dimensions. This can be used in both images and color assets.
nl: Bij het gebruik van XCAssets in Xcode bieden ze opties om verschillende assets te ondersteunen voor verschillende kleurenschema's, naast meerdere assets voor verschillende schermdimensies. Dit kan worden gebruikt voor zowel afbeeldingen als kleurassets.
pt_br: Quando usando o XCAssets no Xcode, eles provém opções para adicionar assets diferentes para esquemas de cores distintos, além de múltiplos assets para dimensões diferentes de tela.

# DynamicContent.XCTAssets.text2
source: Specially when the images have background colors or are difficult to see on a specific color scheme, you can provide different assets for them.
nl: Vooral wanneer afbeeldingen achtergrondkleuren hebben of moeilijk te zien zijn op een specifiek kleurenschema, kun je verschillende assets voor ze leveren.
pt_br: Especialmente quando imagens tem uma cor de fundo, ou são difíceis de serem vistas no seu esquema de cores atual, você pode adicionar variantes nessas imagens para cada esquema de cor.

# DynamicContent.XCTAssets.image1
source: Above is an image of the Xcode's asset catalog. When selecting an image asset, the right panel will display the 'Appearance' option, which you can enable to add images for light and dark modes.
nl: Hierboven is een afbeelding van de asset-catalogus van Xcode. Bij het selecteren van een image asset, wordt aan de rechterkant het 'Appearance' optie weergegeven, die je kunt inschakelen om afbeeldingen toe te voegen voor lichte en donkere modi.
pt_br: Acima, está uma imagem do catálogo de assets do Xcode. Quando selecionando um asset de imagem, no painel direito você pode mudar as opções de 'Appearance', ou aparência, que você pode habilitar para adicionar imagens diferentes para os modos claro e escuro.

# DynamicContent.XCTAssets.text3
source: When switching from dark/light mode and if you are using the XCTAssets the images will automatically change themselves to the correct version.
nl: Bij het schakelen tussen donkere/lichte modus en als je XCTAssets gebruikt, veranderen de afbeeldingen automatisch naar de juiste versie.
pt_br: Quando mudando entre os modos claro/escuro, se você está suando os assets no XCTAssets, as imagens irão mudar automaticamente para a versão correta da sua interface.

# DynamicContent.XCTAssets.text4
source: The examples below have been built using the XCTAssets and have different assets for each color scheme. Change between light and dark mode and check how they behave.
nl: De onderstaande voorbeelden zijn gebouwd met behulp van XCTAssets en hebben verschillende assets voor elk kleurenschema. Schakel tussen lichte en donkere modus en controleer hoe ze zich gedragen.
pt_br: O exemplo acima foi construído usando XCTAssets, e tem variações diferentes para cada esquema de cor. ude entre os modos claro e escuro e veja como eles se comportam.

# TintableImages.title
source: Tintable images
nl: Kleurbare afbeeldingen

# TintableImages.TintableImages.text1
source: You don't necessarily need to have different assets for different color schemes. One thing you can use with XCAssets are tintable images. It means adding the image as a template, and defining it's color later.
nl: Je hoeft niet per se verschillende assets te hebben voor verschillende kleurenschema's. Een ding dat je kunt gebruiken met XCAssets zijn kleurbare afbeeldingen. Dit betekent dat je de afbeelding als een sjabloon toevoegt en de kleur later definieert.
pt_br: Você não precisa necessariamente ter 2 assets com cores diferentes para cada esquema de cor. Uma outra opção é usar 'tintable images' (numa tradução literal seria 'imagens coloríveis', mas é uma referência a propriedade 'tintColor' das 'UIImageViews'). Isso significa adicionar uma imagem como 'template', e definir a sua cor depois, programaticamente.

# TintableImages.TintableImages.text2
source: From Apple's documentation:
nl: Uit de documentatie van Apple:
pt_br: Da documentação da Apple:

# TintableImages.TintableImages.citation1
source: When you add a template image to a button or image view, you also specify a tint color. The view applies the tint color to every pixel that doesn’t have an alpha of 0.0, causing the image’s shape to adopt that color. To support different appearances, simply change the tint color. For example, you might apply a dark tint color in light environments and a light tint color in dark environments.
nl: Wanneer je een sjabloonafbeelding toevoegt aan een knop of image view, geef je ook een tintkleur op. De view past de tintkleur toe op elke pixel die geen alfa heeft van 0.0, waardoor de vorm van de afbeelding die kleur aanneemt. Om verschillende verschijningen te ondersteunen, verander je eenvoudig de tintkleur. Je zou bijvoorbeeld een donkere tintkleur kunnen toepassen in lichte omgevingen en een lichte tintkleur in donkere omgevingen.
pt_br: Quando você adicionar uma imagem como template a um botão ou image view, você também especifica um 'tint color'. A view aplica essa cor a cada pixel que não tem alpha 0.0, causando com que a forma da imagem adore a cor escolhida. Para suportar aparências distintas, você pode apenas mudar esta cor.

# TintableImages.TintableImages.citation2
source: When creating your image, use a transparent background and add black pixels wherever you want the image to appear. The pixels can be fully or partially opaque, depending on whether you want portions of your template image to blend with the background colors. When adding the image to your asset catalog, set the Render As option for the Image Set asset to Template Image in the inspector.
nl: Bij het maken van je afbeelding gebruik je een transparante achtergrond en voeg je zwarte pixels toe waar je de afbeelding wilt laten verschijnen. De pixels kunnen volledig of gedeeltelijk ondoorzichtig zijn, afhankelijk van of je wilt dat delen van je sjabloonafbeelding mengen met de achtergrondkleuren. Bij het toevoegen van de afbeelding aan je asset-catalogus, stel je de Render As-optie voor de Image Set asset in op Template Image in de inspector.
pt_br: Quando criando a sua imagem, use um fundo tranaparente e pixeis pretos onde você quer que a imagem apareça. Os pixels podem ser pacialmente opacos, dependendo se você quer que parte da sua imagem mescle com as cores de fundo. Quando adicionar a imagem ao seu catálogo de assets, configure para ser renderizada como uma imagem de template.

# TintableImages.Example.text1
source: The image above was built using a template image. When no tint color is provided, it's going to use the default color for the image. This is a good approach for icons you may have on your UI.
nl: De bovenstaande afbeelding is gebouwd met behulp van een sjabloonafbeelding. Wanneer geen tintkleur wordt opgegeven, wordt de standaardkleur voor de afbeelding gebruikt. Dit is een goede aanpak voor pictogrammen die je mogelijk op je UI hebt.
pt_br: A imagem acima foi adicionada como um template. Quando nenhuma 'tint color' é adicionada, ela usa as cores padrão do sistema e do seu esquema de cores atual. Esta é auma boa abordagem para ícones que você pode ter na sua interface.

# TintableImages.Example.text2
source: But you can specify custom tint colors. Remember to keep these colors also adapted to each color scheme available.
nl: Maar je kunt aangepaste tintkleuren specificeren. Vergeet niet deze kleuren ook aan te passen aan elk beschikbaar kleurenschema.
pt_br: Mas você pode especificar 'tint colors' customizadas. Lembre-se de manter as cores adaptadas a cada esquema de cor disponível.

# TintableImages.Example.text3
source: And if you haven't set the asset as a 'template image' on the XCTAssets, you can force the template on code as well.
nl: En als je de asset niet hebt ingesteld als een 'sjabloonafbeelding' op de XCTAssets, kun je het sjabloon ook in code afdwingen.
pt_br: E se você não configurou a imagem como uma 'template image' no catálogo de assets, você pode forçar essa opção em código.

# TintableImages.doc
source: Providing images for different appearances
nl: Het verstrekken van afbeeldingen voor verschillende verschijningen

# DynamicColors.title
source: Dynamic colors
nl: Dynamische kleuren
pt_br: Cores dinâmicas

# DynamicColors.Intro.text1
source: When talking about supporting Dark Mode, 'dynamic colors' is the capability of colors to correctly adjust themselves to the current color scheme.
nl: Bij het bespreken van ondersteuning voor de donkere modus, verwijst 'dynamische kleuren' naar het vermogen van kleuren om zich correct aan te passen aan het huidige kleurenschema.
pt_br: Quando falamos em suportar o modo escuro, vores dinâmicas são cores que se adaptam automaticamente ao esquema de cores selecionado no sistema.

# DynamicColors.SystemColors.title
source: System colors
nl: Systeemkleuren
pt_br: Cores do sistema

# DynamicColors.SystemColors.text1
source: When using System colors, they may automatically adjust themselves to the current color scheme.
nl: Bij gebruik van systeemkleuren passen ze zich automatisch aan aan het huidige kleurenschema.
pt_br: Quando usando as cores do sistema, elas podem se ajustar automaticamente ao esquema de cores atual.

# DynamicColors.SystemColors.text2
source: This is true to background and label colors.
nl: Dit geldt met name voor achtergrond- en labelkleuren.
pt_br: Isto é verdade, por exemplo, para as cores de texto e de fundo do sistema.

# DynamicColors.SystemColors.text3
source: UIColors also have colors with the 'system' preffix, which means they are adaptable to color scheme as well.
nl: UIColors hebben ook kleuren met het voorvoegsel 'system', wat betekent dat ze zich aanpassen aan het kleurenschema.
pt_br: 'UIColors' também tem cores com o prefixo 'system', qu significa que elas são adaptáveis para o esquema de cores atual.

# DynamicColors.SystemColors.comment1
source: SwiftUI 'Color' currently does not have these system colors, but you can map the 'UIColor' object into a 'Color' if you want.
nl: SwiftUI 'Color' heeft momenteel deze systeemkleuren niet, maar je kunt het 'UIColor'-object naar een 'Color' mappen als je dat wilt.
pt_br: Em SwiftUI o 'Color' atualmente não suporta essas cores de sistema, mas você pode mapear o opbeto de 'UIColor' em um objeto de 'Color' caso seja necessário.
