Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# AboutTheApp.Disclaimer.text4
source: I want it to be a reliable tool that can be cosulted during everyday development.
nl: Ik wil dat het een betrouwbare tool is die kan worden geraadpleegd tijdens de ontwikkeling van alledag.
pt_br: Gostaríamos que o guia fosse uma ferramente confiável no dia-a-dia do seu desenvolvimento.

# AboutTheApp.Disclaimer.openCollaborationPage
source: Check the Collaboration page to see more ways to report issues and to help the app's development!
nl: Bekijk de samenwerkingspagina voor meer manieren om problemen te melden en bij te dragen aan de ontwikkeling van de app!
pt_br: Dê uma olhada na página sobre colaboração para ver outras formas de ajudar o projeto!

# AboutTheApp.Review.text
source: Review the Handbook on the AppStore!
nl: Beoordeel de Handleiding op de AppStore!
pt_br: Avalie o Guia na AppStore!

# AboutTheApp.Review.button
source: Make a review
nl: Een beoordeling schrijven
pt_br: Faça uma avaliação

# AboutTheApp.language
source: The Handbook is available in English US and Portuguese BR. Change your language preference for the app at the device's settings.
nl: De Handleiding is beschikbaar in het Engels (VS) en Portugees (BR). Pas de taalvoorkeur voor de app aan in de instellingen van het apparaat.
pt_br: O Guia está disponível em Portugês do Brasil e Inglês dos Estados Unidos. Mude sua preferência de idioma nas configurações do dispositivo.

# ColorBlind.About.text1
source: Color blindness is a decreased ability to see color differences.
nl: Kleurblindheid is een verminderd vermogen om kleurverschillen waar te nemen.
pt_br: Daltonismo é o nome dado a habilidade reduzida de enxergar ou perceber diferenças em cores.

# ColorBlind.About.text2
source: What you may not know is that there are 'levels' of color blindness. A person with green color deficiency, for example, may not see the green color at all, or may see it a little bit less that a non-color-blind person.
nl: Wat je misschien niet weet, is dat er 'gradaties' van kleurenblindheid zijn. Iemand met groenkleurenblindheid ziet bijvoorbeeld de groene kleur helemaal niet, of iets minder dan een niet-kleurblinde persoon.
pt_br: O que você pode não saber, é que existem 'níveis de daltonismo'. Uma pessoa com deficiência de visão da cor verde pode não ver essa cor por completo ou apenas um pouco menos que as outras pessoas.

# ColorBlind.About.text3
source: You may take an Ishihara test to check if you are color blind. I have a friend who discovered she was color blind when we were in college! And before that, I'd expect you to identify this condition much earlier in life.
nl: Je kunt een Ishihara-test doen om te controleren of je kleurenblind bent. Ik heb een vriendin die ontdekte dat ze kleurenblind was toen we op de universiteit zaten! En daarvoor zou je verwachten dat je deze aandoening veel eerder in het leven zou identificeren.
pt_br: Você pode fazer um Teste de Ishihara para verificar se você é daltônico. Eu tenho uma amiga que descobriu quando estávamos na faculdade! E antes disso, eu esperava que fosse descoberto quando você fosse mais jovem, mas foi uma maneira de mostrar que a condição pode aparecer e manifestar de maneiras diferentes na vida de cada pessoa.

# ColorBlind.About.ishihara
source: Example of ishihara color identifying test.
nl: Voorbeeld van de Ishihara-kleuridentificatietest.
pt_br: Exemplo de um teste de Ishihara.

# ColorBlind.About.comment
source: These above are examples of an Ishihara test. For a 'normal' vision person, it's expected to see '12', '6' and '74' respectively.
nl: Dit zijn voorbeelden van een Ishihara-test. Voor een persoon met 'normaal' zicht wordt verwacht dat hij respectievelijk '12', '6' en '74' ziet.
pt_br: A imagem acima é de um teste de Ishihara. Para uma pessoa de visão 'normal', é esperado que se veja os número '12', '6' e '74', respectivamente.

# ColorBlind.About.text4
source: But how does this affect our work when we are building an app?
nl: Maar hoe beïnvloedt dit ons werk bij het bouwen van een app?
pt_br: Mas como isso afeta quando você está fazendo um app?

# ColorBlind.Handle.title
source: Handling content considering colorblindness
nl: Inhoud behandelen rekening houdend met kleurenblindheid
pt_br: Tratando conteúdo considerando Daltonismo

# ColorBlind.Handle.text1
source: First, make sure your content does not rely on colors only to take any actions or to identify informations. Take the example below.
nl: Zorg er eerst voor dat je inhoud niet alleen afhankelijk is van kleuren om acties te ondernemen of informatie te identificeren. Bekijk het onderstaande voorbeeld.
pt_br: Primeiro, garanta que o seu conteúdo não dependa apenas de cores para diferenciar informações. Observe o exemplo a seguir.

# ColorBlind.Handle.text2
source: Here, on the first column, we are color coding red the negative items and green the positive ones. But that's exactly what we want to avoid. The second Colum has a much better 'universal' experience where identifying these items as positive or negative does not rely solely on color.
nl: Hier kleurcoderen we in de eerste kolom negatieve items in het rood en positieve in het groen. Maar dat is precies wat we willen vermijden. De tweede kolom biedt een veel betere 'universele' ervaring waarbij het identificeren van deze items als positief of negatief niet uitsluitend afhangt van kleur.
pt_br: Aqui, na primeira coluna, estamos usando apenas a cor vermelha para marcar itens negativos, e cor verde para os itens positivos. Mas isso é exatamente o que queremos evitar. A segunda coluna tem uma informação mais 'universal', onde identificamos itens positivos e negativos pela cor mas também pelo uso de ícones associados ao conteúdo.

# ColorBlind.Handle.comment1
source: Using + and - may have cultural connotations, so it may not be the best example here. But it's just an example.
nl: Het gebruik van + en - kan culturele connotaties hebben, dus het is misschien niet het beste voorbeeld hier. Maar het is slechts een voorbeeld.
pt_br: Usar os ícones + e - e até mesmo cores vermelho e verde tem conotações culturais e pode variar de acordo com cada localidade. Mas aqui é só um exemplo mesmo.

# ColorBlind.Handle.comment2
source: If you do rely on colors only on some part of your app, don't want to change it, but still want to to make it usable for colorblind users, check our 'Differentiate without colors' page.
nl: Als je toch op sommige delen van je app alleen op kleuren vertrouwt, het niet wilt veranderen, maar het wel bruikbaar wilt maken voor kleurenblinde gebruikers, bekijk dan onze pagina 'Onderscheid maken zonder kleuren'.
pt_br: Se você tem um conteúdo que depende apenas de cores para ser identificado no seu app, e não consegue ou não quer alterar a forma como ele é apresentado para o público geral, mas ainda que dar suporta para as pessoas que são daltônicas, dê uma olhada na página 'Differentiate without colors'.

# ColorBlind.Images.title
source: Careful with images
nl: Let op met afbeeldingen
pt_br: Cuidado com imagens

# ColorBlind.Images.text1
source: Sometimes we render content with images. Banners loaded from Backend, some promotional stuff, or just something that looks nicer on the image render.
nl: Soms renderen we inhoud met afbeeldingen. Banners geladen vanuit de backend, promotionele inhoud of gewoon iets dat er mooier uitziet op de afbeeldingsrendering.
pt_br: As vezes, apresentamos conteúdos que estão dentro de imagens. Baners que vieram do backend, informações promocionais, ou alguma coisa que foi montada para aparecer melhor na imagem.

# ColorBlind.Images.comment
source: First, make sure to add an accessibility label to this image!
nl: Zorg er eerst voor dat je deze afbeelding een toegankelijkheidslabel geeft!
pt_br: Primeiro, adicione um texto alternativo 'accessibility label' à imagem!

# ColorBlind.Images.text2
source: You also need to be careful to not have content ot be read on conflicting colors for color blindness.
nl: Wees ook voorzichtig dat de inhoud niet conflicteert met kleuren die kleurenblindheid veroorzaken.
pt_br: Você tembém tem que tomar cuidado para que o conteúdo exibido não tenha cores conflitantes para usuários daltônicos.

# Contrast.text1
source: Contrast is the difference in luminance or colour that makes an object (or its representation in an image or display) distinguishable.
nl: Contrast is het verschil in helderheid of kleur dat een object (of de representatie ervan in een afbeelding of weergave) onderscheidend maakt.
pt_br: Contraste é a diferença de luminosidade or cor que faz com que um objeto (ou a sua representação em uma imagem ou tela) distinguível.

# Contrast.comment1
source: But why talk about contrast on an accessibility context?
nl: Maar waarom praten over contrast in een toegankelijkheidscontext?
pt_br: Mas porque falar de contraste quando estamos falando de acessibilidade?

# Contrast.text2
source: Contrast is important when taking colors on your applications. Everything that should be visible should be well... Visible.
nl: Contrast is belangrijk bij het gebruik van kleuren in je applicaties. Alles wat zichtbaar moet zijn, moet nou ja... zichtbaar zijn.
pt_br: Contraste é importante quando considerando as cores da sua aplicação. Tudo que é apresentado deveria ser... bom, visível.

# Contrast.text3
source: By that I mean you should be careful when adding colored text on top of colored backgrounds. The base good contrast is black-on-white (or white-on-black) text.
nl: Hiermee bedoel ik dat je voorzichtig moet zijn bij het toevoegen van gekleurde tekst bovenop gekleurde achtergronden. De basis voor goed contrast is zwarte tekst op een witte (of witte tekst op zwarte) achtergrond.
pt_br: E por isso, queremos dizer que você tem que tomar cuidado ao adicionar conteúdo que deve ser lido em cores sobre outras cores. A base do contraste é sempre o texto preto no fundo branco (ou o texto brando no fundo preto - Dark Mode).

# Contrast.comment2
source: But is also depends on the font itself, the font's weight...
nl: Maar het hangt ook af van het lettertype zelf, het gewicht van het lettertype...
pt_br: Mas isso também depende da fonte que você está usando, do peso e do tamanho dela.

# Contrast.Example.text1
source: A nice way to test for contrast is using the WCAG contrast guide
nl: Een mooie manier om contrast te testen is met de WCAG-contrastgids
pt_br: Uma forma legal de testar o contraste, é usando o guia do WCAG.

# Contrast.Example.comment1
source: WCAG stands for 'Web Content Accessibility Guidelines', and I know it's more directed to web, not mobile environments, but that's also nice to take a look into, specially if you are interested in learning more about contrast in accessibility.
nl: WCAG staat voor 'Web Content Accessibility Guidelines', en ik weet dat het meer gericht is op web, niet op mobiele omgevingen, maar het is ook goed om daar naar te kijken, vooral als je meer wilt leren over contrast in toegankelijkheid.
pt_br: WCAG significa 'Web Content Accessibility Guidelines' (Guia de conteúdo de acessibilidade para Web), e mesmo sendo direcionado para navegadores de internet e não diretamente para ambientes mobile, é uma ótima referência de acessibilidade de maneira geral, especialmente na parte de contraste.

# Contrast.Example.example1
source: This example above fails the WCAG test for contrast.
nl: Dit voorbeeld hierboven slaagt niet voor de WCAG-contrasttest.
pt_br: O exemplo acima falha o teste de contraste do WCAG.

# Contrast.Example.example2
source: This one does kida ok, so you can use this color combination with larger fonts.
nl: Deze doet het redelijk goed, dus je kunt deze kleurencombinatie gebruiken bij grotere lettertypen.
pt_br: Este exemplo é mais ou menos, você pode usar essa combinação de cores com fontes maiores, por exemplo.

# Contrast.Example.example3
source: And this one is pretty good! The classics.
nl: En deze is behoorlijk goed! De klassiekers.
pt_br: E esse contraste é muito bom! O clássico preto-no-branco.

# Contrast.Example.link
source: You can try for yourself on this contrast-check tool!
nl: Je kunt zelf proberen met deze contrastcontrole-tool!
pt_br: Você pode tentar você mesmo com essa ferramenta online de teste de contraste!

# Differentiate.title
source: Differentiate without colors
nl: Onderscheiden zonder kleuren
pt_br: Diferenciar sem cores

# Differentiate.Intro.text1
source: The Differentiate Without Colors, is the way the user can ask to, well, do not use only colors to differentiate content.
nl: De functie 'Onderscheiden zonder kleuren' is de manier waarop de gebruiker kan vragen om, nou ja, niet alleen kleuren te gebru iken om inhoud te onderscheiden.
pt_br: O 'Differentiate Without Colors' (ou, diferenciar sem cores), é uma forma com que o usuário pode pedir para não usar apenas cores para diferenciar conteúdos.

# Differentiate.Intro.text2
source: On code, it's basically going to be a boolean you can check if the user enabled this feature or not.
nl: In code wordt het in feite een booleaanse waarde die je kunt controleren om te zien of de gebruiker deze functie heeft ingeschakeld of niet.
pt_br: No código, isso se resume a um Booleano que você pode checar para ver se essa opção de acessibilidade está ativada ou não.

# Differentiate.Intro.comment1
source: Although, most of the time, it is a good practice to not use only colors to differentiate content. This is the kind of issue that can be prevented on the 'design step', while planning your app or your feature, and before implementing it.
nl: Hoewel het meestal een goede praktijk is om niet alleen kleuren te gebruiken om inhoud te onderscheiden. Dit is het soort probleem dat kan worden voorkomen tijdens de 'ontwerpfase', bij het plannen van je app of je functie, en voordat je het implementeert.
pt_br: Apesar que, na maioria das vezes, é uma boa prática adotar como comportamento padrão que o seu conteúdo não dependa apenas de cores para ser identificado. Este é o tipo de problema que pode ser previnido com boas discussões equanto montando designs e layouts para suas aplicações, antes mesmo de começar a implementar.

# Differentiate.Intro.text3
source: This feature can be enabled on the device's settings at the Accessibility section.
nl: Deze functie kan worden ingeschakeld in de instellingen van het apparaat bij de toegankelijkheidssectie.
pt_br: Esta opção pode ser abilitada nas configurações do dispositivo, na seção de acessibilidade.

# Differentiate.Intro.text4
source: Here's a classic example, the wire game! Where you need to connect the wires with the same color on both sides of the screen.
nl: Hier is een klassiek voorbeeld, het draadspel! Waarbij je de draden met dezelfde kleur aan beide zijden van het scherm moet verbinden.
pt_br: Aqui, um exemplo clássico, o jogo do fio! Onde você tem que conectar os fios de cores iguais nos lados opostos da tela.

# Differentiate.Intro.text5
source: By adding icons next to the wires, you make sure the game does not rely only on color coding to be played.
nl: Door pictogrammen naast de draden toe te voegen, zorg je ervoor dat het spel niet alleen afhankelijk is van kleurcodering om te worden gespeeld.
pt_br: Ao adicionar ícones nos fios, você garante que eles coneguem ser diferenciados não só pelas cores.

# Differentiate.Intro.image
source: Image of the Among Us game wire game with multiple color blindness filters applyed.
nl: Afbeelding van het Among Us-spel draadspel met verschillende filters voor kleurenblindheid toegepast.
pt_br: Imagem do jogo Among Us usando multiplos filtros de daltonismo.

# Differentiate.Intro.comment2
source: A nice example is the game 'Among Us'. On the image above, from left-to-right then top-to-bottom: no filter, deuteranopia filter, protanopia filter, tritanopia filter. These weird names are the names of some color blindness types.
nl: Een mooi voorbeeld is het spel 'Among Us'. Op de afbeelding hierboven, van links naar rechts en dan van boven naar beneden: geen filter, deuteranopie-filter, protanopie-filter, tritanopie-filter. Dit zijn eigenaardige namen van enkele soorten kleurenblindheid.
pt_br: Um bom exemplo é o jogo 'Among Us'. Na imagem acima, em ordem, estão aplicados os filtros de Deuteranopia, Protanopia e Tritanopia. Esses nomes estranhos são tipos diferentes de daltonismo.

# Differentiate.Handle.text1
source: To check if the feature is enabled, you can check 'UIAccessibility.shouldDifferentiateWithoutColor'
nl: Om te controleren of de functie is ingeschakeld, kun je 'UIAccessibility.shouldDifferentiateWithoutColor' controleren.
pt_br: Para verificar se a opção está habilitada, você pode usar 'UIAccessibility.shouldDifferentiateWithoutColor'

# Differentiate.Handle.text2
source: And you can alo subscribe to listen to changes in this property using the Notification Center.
nl: En je kunt je ook abonneren om te luisteren naar wijzigingen in deze eigenschap met het Notification Center.
pt_br: E você pode também usar a notificação dessa propriedade com o Notification Center para pegar mudanças nesse valor.

# Differentiate.Handle.text3
source: And you can use an Environment property in SwiftUI for the same purpose.
nl: En je kunt een Environment-eigenschap in SwiftUI gebruiken voor hetzelfde doel.
pt_br: E em SwiftUI, você pode usar uma 'Environment property' (variável de ambiente) com o mesmo objetivo.

source: Color Accessibility Features
nl: Kleurtoegankelijkheidsfuncties
pt_br: Opções de acessibilidade com cores

# ReduceTransparency.title
source: Reduce Transparency
nl: Verminder Transparantie
pt_br: Reduzir Transparências

# ReduceTransparency.Intro.text1
source: This is an accessibility option that needs to be enabled on the Device's settings.
nl: Dit is een toegankelijkheidsoptie die moet worden ingeschakeld in de instellingen van het apparaat.
pt_br: Esta é uma opção de acessibilidade que pode ser habilitada nas configurações do dispositivo.

# ReduceTransparency.Intro.text2
source: When enabled, the user want's to tell you they want to reduce the amount of blur and translucency on the app.
nl: Wanneer ingeschakeld, wil de gebruiker je vertellen dat ze de hoeveelheid vervaging en doorzichtigheid in de app willen verminderen.
pt_br: Quando ligada, o usuário pede para que sua aplicação reduza a quantidade de blur e transparências usadas.

# ReduceTransparency.Intro.comment
source: Some poeple may have a hard time looking into translucent elements!
nl: Sommige mensen kunnen moeite hebben om naar doorschijnende elementen te kijken!
pt_br: Algumas pessoas podem ter dificuldade de enxergar ou ler conteúdos com transparências!

# ReduceTransparency.Example.text1
source: Try enabling and disabling this option and check the content below.
nl: Probeer deze optie in en uit te schakelen en controleer de inhoud hieronder.
pt_br: Tente ligar e desligar essa opção e obervar o conteúdo abaixo.

# ReduceTransparency.Example.example
source: Transparent content to be read on top of a blured background
nl: Transparante inhoud om te lezen bovenop een geblurde achtergrond
pt_br: Text transparente em cima de um background 'borrado'.

# ReduceTransparency.Code.text1
source: And, it's pretty easy to handle!
nl: En het is vrij eenvoudig te hanteren!
pt_br: E é muito fácil de tratar!

# ReduceTransparency.Code.text2
source: On UIKit, you need to check a boolean on UIAccessibility to check if the feature is enabled.
nl: Op UIKit moet je een booleaanse waarde controleren op UIAccessibility om te zien of de functie is ingeschakeld.
pt_br: No UIKit, você precisa checkar um booleano no UIAcessibility.

# ReduceTransparency.Code.text3
source: And you can alo subscribe to listen to changes in this property using the Notification Center.
nl: En je kunt je ook abonneren om te luisteren naar wijzigingen in deze eigenschap met het Notification Center.
pt_br: E, claro, você também pode observar a notificação dessa mesma propriedade para tratar caso ela seja alterada, usando o Notification Center.

# ReduceTransparency.Code.text4
source: And on SwiftUI you can use an Environment variable!
nl: En op SwiftUI kun je een Environment-variabele gebruiken!
pt_br: E em SwiftUI você pode usar uma variável de ambiente!

# InvertColors.title
source: Invert Colors
nl: Kleuren Inverteren
pt_br: Inverter cores

# InvertColors.Intro.text1
source: Color Inversion is another accessibility option a user can enable on the device's settings.
nl: Kleurinversie is een andere toegankelijkheidsoptie die een gebruiker kan inschakelen in de instellingen van het apparaat.
pt_br: Inverter cores é outra opção de acessibildiade que pode ser habilitada nas configurações do seu dispositivo.

# InvertColors.Intro.text2
source: There are 2 types of color inversion:
nl: Er zijn 2 soorten kleurinversie:
pt_br: Existem 2 tipos de inversão no iOS:

# InvertColors.Intro.text3
source: Classic - where everything will be inverted;
nl: Klassiek - waar alles zal worden omgekeerd;
pt_br: Clássica - onde tudo será invertido;

# InvertColors.Intro.text4
source: Smart - where (almost) everything in light mode will be inverted, and you (the developer) can choose not to.
nl: Slim - waar (bijna) alles in de lichte modus wordt omgekeerd, en jij (de ontwikkelaar) kunt ervoor kiezen dat niet te doen.
pt_br: Inteligente - onde (quase) tudo em light mode será invertido, e você (desenvolvedor) pode escolher se será invesível ou não.

# InvertColors.Intro.comment1
source: But why would anyone use this?
nl: Maar waarom zou iemand dit gebruiken?
pt_br: Mas por que alguém usaria isso?

# InvertColors.Intro.text5
source: I believe it comes down to difficulties in reading dark text on top of a white background. I myself, when I'm not using glasses, I find it pretty difficult to read content like this, so I preffer the dark mode, with white text on top of a dark background.
nl: Ik denk dat het neerkomt op moeite met het lezen van donkere tekst bovenop een witte achtergrond. Zelf vind ik het behoorlijk moeilijk om inhoud zoals dit te lezen als ik geen bril draag, dus ik geef de voorkeur aan de donkere modus, met witte tekst bovenop een donkere achtergrond.
pt_br: Acredito que recaia na dificuldade as vezes de ler conteúdos de texto preto sobre o fundo branco. (Eu mesmo sem óculos prefiro ler texto com a fonte branca sobre o fundo preto).

# InvertColors.Intro.text6
source: The color inversion comes as an alternative to help you in this scenario.
nl: De kleurinversie komt als een alternatief om je in deze situatie te helpen.
pt_br: A inversão de cores é uma alternativa para ajudar nesse cenário.

# InvertColors.WhatToDo.title
source: What to do as a developer?
nl: Wat te doen als ontwikkelaar?
pt_br: O que fazer enquanto desenvolvedor?

# InvertColors.WhatToDo.text1
source: You basically need to mark what you don't want to be inverted. Like, images, a photo of your dog, a nice hamburguer that would look gross when inverted...
nl: Je moet in feite markeren wat je niet wilt dat wordt omgekeerd. Zoals afbeeldingen, een foto van je hond, een lekkere hamburger die er vies uitziet als deze wordt omgekeerd...
pt_br: Você basicamente precisa marcar o que você não quer que seja invertido. Como imagens, uma foto do seu cachorro, uma foto de um hambúrguer que ficaria bem esquisito quando invertido...

# InvertColors.WhatToDo.text2
source: And to do so, you simply need to set a boolean telling you dont want this view to be inverted.
nl: En om dat te doen, hoef je alleen maar een booleaanse waarde in te stellen die aangeeft dat je wilt dat deze weergave niet wordt omgekeerd.
pt_br: E, para isso, você precisa simplesmente configurar um booleano nas propriedades da sua view, marcando que você não que que ela seja invertida.
