Repository: giovaninppc/AccessibilityHandbook
Catalog: Accessibility Handbook/Strings/*.lproj/Localizable.strings
Languages: nl, pt_br

# TryItYourself.text7
source: The next sections, will introduce you to issues and common uses of accessibility. How to implement them, and how to plan to create more accessible apps.
nl: De volgende secties zullen je introduceren aan problemen en veelvoorkomend gebruik van toegankelijkheid. Hoe ze te implementeren en hoe je kunt plannen om meer toegankelijke apps te maken.

# TryItYourself.text8
source: Don't give up! We are just starting 😉
nl: Geef niet op! We zijn pas net begonnen 😉

# ColorBlind.title
source: Color Blindness
pt_br: Daltonismo

# ColorBlind.About.ishiharaTest
source: Ishihara Test
pt_br: Teste de Ishihara

# Contrast.title
source: Contrast
pt_br: Contraste

# CustomActions.creditCard
source: Credit Card
pt_br: Cartão de Crédito

source: Hint
pt_br: Dica

# Hint.open
source: Open hint
pt_br: Abrir dica

source: Minimum
pt_br: Mínimo

source: Maximum
pt_br: Máximo
